[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17282/desserts/nut-desserts/peanut-desserts/",
                    "name": "Peanut Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9362/microwave-oven-peanut-brittle/",
        "name": "Microwave Oven Peanut Brittle",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2616197.jpg",
            "width": 3384,
            "height": 3804
        },
        "datePublished": "1998-12-18T03:48:37.000Z",
        "description": "I have used this for years and it is very good; much easier than the traditional method and tastes just as good.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "1 pound",
        "recipeIngredient": [
            "1 ½ cups dry roasted peanuts",
            "1 cup white sugar",
            "½ cup light corn syrup",
            "1 pinch salt",
            "1 tablespoon butter",
            "1 teaspoon vanilla extract",
            "1 teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a baking sheet, and set aside. In a glass bowl, combine peanuts, sugar, corn syrup, and salt. Cook in microwave for 6 to 7 minutes on High (700 W); mixture should be bubbly and peanuts browned. Stir in butter and vanilla; cook 2 to 3 minutes longer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Quickly stir in baking soda, just until mixture is foamy. Pour immediately onto greased baking sheet. Let cool 15 minutes, or until set. Break into pieces, and store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Peanut Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda C."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.722174288179465,
            "ratingCount": 1159,
            "itemReviewed": "Microwave Oven Peanut Brittle",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "164.6 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "1.9 mg",
            "fatContent": "7.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "91 mg",
            "sugarContent": "15.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-04T20:04:47.673Z",
                "reviewBody": "I have an 1100 watt microwave and following Linda's recipe my brittle burned after adding the nuts.   I tried it again lowering the time and this is what worked for me.     2 1/2 minutes for the sugar and corn syrup, add the nuts and cook for 2 more minutes, add the vanilla and butter and 1 1/2 minutes more.    I only did the 1 1/2 at the end for my husband because he likes it almost brown.   I prefer it at 1 minute instead and it is gold like the photo on the original.  I liked the hint posted about spraying the pouring edge of the pyrex bowl and also the wooden spoon with Pam and I used parchment paper to line the cookie sheet.   You can re-use that several times and the brittle is not greasy. I also only put in 1 cup of nuts instead of 1 1/2.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIEZEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/546075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T22:52:15.497Z",
                "reviewBody": "My wife and I have made two batches of this, and they both came out perfect! Guess what everyone's getting a tin of this Christmas? : ) Oh, one more thing. We've been making it in one of those glass 4-cup measuring cups. You know, the clear ones with a handle. They work great for handling it and pouring the mixture on the cookie sheet. You can get them at Wal-Mart for about 4 bucks. Oh well, that's all for now. Thanks a bunch for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHUFFLE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/402030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T17:02:01.243Z",
                "reviewBody": "This recipe was great.  Like others, I was grateful not to have to be stirring and stirring this on the stove!!!  I had to try this a few times before it turned out.  The first time it burned a little.  Wanted to pass along what I did just in case it helps others.  I live in Colorado - so high altitude might have affected this a little.  I also have a 900 watt microwave.  I cooked the sugar and syrup for 6 minutes.  Then added the peanuts, salt, butter and vanilla.  Cooked for 2 1/2 more minutes.  Then added the soda.  For those of you who like thinner brittle, here is a tip.  Put your cookie sheet (sprayed with Pam) in the oven at 200 degrees for a few minutes while the brittle is cooking.  Then remove the cookie sheet when the brittle is done.  With the warm pan, it allows you more time to spread it out - as thick or thin as you like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mmulrich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2186393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-16T22:23:14.03Z",
                "reviewBody": "I have made (no exaggerating) dozens of batches-it makes a great gift! I use a 9.5 oz can of Planters lightly salted cashews. Here's what I have found to be helpful: I reduced the baking soda to 1/2-3/4t. baking soda (I could taste the soda-yuck) and I add the nuts after the mixture starts to turn slightly brown (about 4 min. in my microwave). The mixture stiffens up some but will then soften when you cook it again-that way the nuts don't burn at all. Keep adjusting the times for your microwave-it's worth it! Add Tip: to thin/spread out the brittle try using forks to \"pull out\" the candy along w/ heating your cookie sheet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOYMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/573019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T18:36:28.733Z",
                "reviewBody": "This was GREAT! Tips: For some reason the batch always turned out better when I lined the cookie sheet with aluminum foil - chemical reaction w/the baking soda maybe? Also plan to waste at least one batch because there is one unknown in this recipe: your microwave. I had to tinker until I got the timing of everything right. Once I did it was like clockwork! I made 6 batches of this in 2 and a half hours! Not bad considering I didn't have to break an arm stirring the whole time! And it really does taste exactly the same as the stuff done the hard way! After the first 2 batches I just started leaving out the vanilla. You can't really taste it and it's not worth the extra cost IMO. Overall an incredibly easy fast fun recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARFISH9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T16:36:18.89Z",
                "reviewBody": "This recipe is good! It's way better than average, but in nmy opinion, needs more salt. Here are some tips for the people who keep burning the recipe, who can't get their mixture to firm up, or for those who, for the life of them, can't find corn syrup. \r\nA) If you are having trouble with BURNING or you keep getting a BURNT taste, make sure that you're using RAW nuts, and not roasted ones. Mix everything together before putting it into the microwave. Also, keep a close eye on the mixture. Don't go away from your microwave. a) If you have ROASTED NUTS, try putting them in when add the butter instead of putting them in at first. This will reduce flavor transfer, but at least you won't have \"burnt nut\" aftertaste as your flavor!\r\nB) If you HAVE NO CORN SYRUP, use .75 honey and .25 water. This gives a different flavor, too, some might say it tastes a bit more \"old-fashioned\". (? You decide!) \r\nC) Finally, if you are having trouble getting your recipe to harden: \r\n1) Make sure you microwave the mixture on HIGH with a MICROWAVE. When you add the butter and vanilla, check for soft-ball stage...after waving your \"spatula\" in the air for 2 secs, you should have a firm \"glob\" that kind-of holds it shape sitting on your utensil. \r\n2) Use the right amount of butter \r\n3) Don't keep taking the mixture of the microwave to \"check it.\" It has to stay hot to cook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TININI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1353143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-18T05:11:38.313Z",
                "reviewBody": "I have been using this recipe for many years and it always comes out perfectly.  The glass 4 cup measuring cup is a real key for ease in making this recipe.  The original recipe I use calls for a can of cashew pieces and this makes a fantastic brittle!  Everyone I give it to wants the recipe.  I also experimented this year with topping the brittle with a thin layer of chocolate.  Yum!  Let the brittle firm up a bit, but while it is still very warm sprinkle some semi-sweet or milk chocolate morsels on top and the chocolate will start melting almost immediately.  Just spread with a knife or utility spatula and let cool.  I usually do half of my batch with chocolate and half without.  This recipe is a winner for gifts for friends and neighbors, and it is extremely quick and easy.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bernice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2366023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T03:11:00.92Z",
                "reviewBody": "I used a microwave peanut brittle recipe for years, then lost it. This seemed like the closest to my old recipe and luckily it turned out just as good. I've made numerous batches this last week. I find it works fine using salted nuts. In fact, I buy the large container of fancy nuts from Costco and it makes wonderful brittle. My absolutely favorite thing to add is the shaved coconut strips which you can find at places like Trader Joe's, and some of the catalog companies. (Regular flake coconut will burn too easily.) Last night I made a coconut and almond combination which was out of this world. My microwave oven is 1000 watts, instead of the 700 watts this recipe is written for. So I use 5 min. for the first cooking, and 1 min 45 sec for the second cooking. For those who complain that it comes out chewey rather than brittle, it's because it hasn't been cooked enough. This recipe is so quick and easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MHANCIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/251605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T01:57:34.06Z",
                "reviewBody": "This is the only Peanut Brittle recipe I'll use. =) Always turns out good - to avoid the chewies, just keep a glass of cold water on hand - don't add the baking soda untill a little bit of the brittle-part makes a hard ball and cracks in the water. Then you won't be foiled by different microwave powers, and'll have a better idea of how long to zap it next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIANNAKF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/488273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T17:17:12.013Z",
                "reviewBody": "I have been making a similar recipe for years.  I make a ten minute (or so) brittle putting the nuts in at the five minute point, then add the butter, vanilla, and soda at the end.  I followed this recipe putting the butter and vanilla in at the earlier interval and was not so happy with the results.  I think I will stick with my recipe.  I also put in more baking soda which all of my elderly relatives prefer as they say it makes the candy easier on their teeth!  I out in 1 1/2 t of baking soda and it makes the candy really airy...also I live at 5500 feet which may also have something to do with it... ;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cammy Kinstedt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cammyk/"
                }
            }
        ]
    }
]