[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10079/3-ingredient-shortbread-cookies/",
        "name": "3-Ingredient Shortbread Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4709870.jpg",
            "width": 1936,
            "height": 2592
        },
        "datePublished": "1997-11-10T17:50:28.000Z",
        "description": "These melt in your mouth. The secret is in the beating.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "1 ½ cups all-purpose flour",
            "½ cup confectioners' sugar",
            "12 maraschino cherries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine butter or margarine, flour and confectioner's sugar and  beat for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop from teaspoon onto cookie sheet. Decorate with maraschino cherry pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 to 18 minutes, or until bottoms are lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.196531791907514,
            "ratingCount": 173,
            "itemReviewed": "3-Ingredient Shortbread Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "146.5 calories",
            "carbohydrateContent": "12.6 g",
            "cholesterolContent": "27.1 mg",
            "fatContent": "10.3 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "72.9 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-11T15:35:56.52Z",
                "reviewBody": "These were pretty good. However, my dad is a pastry chef and said that the amount of butter in them is way too much. The taste of butter was a little too pronounced. He said that as a general rule for shortbread, the amount of flour always has to be at least double to the amount of butter. Also, he said that the secret to get them to stay in one piece and not fall apart, is in the baking time. Make sure you bake them at least until the are a rich golden instead of white. My first batch was just golden on the bottom, and I was still able to manipulate well, but fell apart when biting into them, and they were a little chewy, or doughy in the mouth. My second batch, I let them get a little more color on them, and there texture was much better! Here you go, that is the secret (I think)of why many people had crumbly falling apart cookies! All credit goes to dad :)\nPerfect dough for piping beautiful shapes. Pretty good when adding a bit of almond extract too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-22T20:15:33.313Z",
                "reviewBody": "These really are light and melt-in-your-mouth good.  I first beat the softened (salted) butter in my electric stand mixer; then beat the dough for the 10 minutes called for.  Shortbread is high on my list of fave cookies, so I didn't think I'd want maraschino cherries messing with my shortbread!  But it really did add a very nice touch.  I used Trader Joe's Maraschino Cherries (no red dye additives and they still taste great).  This does not make very many cookies, so if you want a lot, at least double the recipe!  I probably got the 3 dozen it says it yields, but they are very small cookies!  BTW, there are two recipes for these cookies on this site with one difference:  the other one calls for red AND green maraschino cherries!  Thanks for the great cookie, Carol!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-13T19:55:51.293Z",
                "reviewBody": "Easy and delicious. For Christmas we omitted the cherries dipped edge in chocolate and then in crushed candy cane!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMDOWDY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-05T23:02:50.273Z",
                "reviewBody": "Mine turned out GREAT! I think the key is making sure they are mixed for at least 10 minutes. I used my KitchenAid mixer and let them mix on medium for about 12 minutes (I also whipped the butter by itself first for about 2 minutes) and they were PERFECT! I took them to work and got tons of compliments on them. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ashley8150",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2118575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-19T04:18:46.77Z",
                "reviewBody": "Well I had high hopes for these cookies! The instructions were super easy and the dough when mixed was so yummy and fluffy! I made them exactly as directed (using salted butter - might try unsalted next time) and when the one reviewer said they were \"grainy\" like sand I couldn't imagine how it would be after you whipped them for so long but that's what happened to mine after cooking too! I omitted the cherry and once they were out of the oven I added a large round chocolate piece to the top without moving them off the baking sheet. The first batch came out so fragile that I couldn't even pick them up to eat one! They just fell apart like a cookie made of SAND. I am letting the second batch cool on the pan (which is going to make baking these take a long time!). That might be the ticket? I don't know what the magic touch is? Maybe I shouldn't have fluffed the flour before measuring it? I softened the butter a little and mixed it all together at the same time. No creaming butter first and adding sugar then flour - that might help a little. I did let them cool on the pan before lifting them off and that helped slightly. At least I could sorta pick them up even though once you bit into the cookie it crumbled apart. My 2yr old was VERY upset when her cookie fell on the ground and she didn't get a bite.:( They do taste good and they disolve in your mouth. I personally like a little more substance when I bite into a shortbread cookie and not have it fall apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlene1234",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2229026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:28:23.733Z",
                "reviewBody": "Awesome cookie recipe. Only hint I'd give is to use UNSALTED butter it keeps the dough together and adds to it's light texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AFORSTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/988456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-27T20:34:22.24Z",
                "reviewBody": "These came out beautifully. I substituted 4 oz. cream cheese for 1/2 of the butter but otherwise followed the recipe. They were perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amberica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2450171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T23:24:40.463Z",
                "reviewBody": "So based on the reviews I read I also modified the recipe to reflect the previous review saying 2 C flour to 1 C butter... I also decided to add a bit of the juice from the cherries for extra flavor. I have to say that after mixing for a few moments with hand mixer the best way to describe the state of my kitchen was that of cocaine den! What a mess! So I would suggest that you do it in a food processor if you have one HOWEVER if you are using a food processor do NOT mix for the recommended 10 mins as the heat from the processor will melt the butter and ruin the mix! Mix it until it goes lighter in shade by several shades and looks fluffy and whipped also ensure to scrap down the sides of the processor to ensure even mixing. But do pay attention to the mix and do NOT mix it for more than 5 mins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CEMME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/513103/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T00:02:32.263Z",
                "reviewBody": "after many years of cooking and baking this was my first real disapointment. I followed the recipe to the letter and they are so fragile I can't get them off the cookie sheet.Must be some kind of secret",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1113282/"
                }
            }
        ]
    }
]