[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
                    "name": "Gumbo Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12950/chicken-andouille-gumbo/",
        "name": "Chicken Andouille Gumbo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6296287.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-01-04T03:50:54.000Z",
        "description": "Sausage makes this very spicy. Can be prepared two days ahead.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT3H10M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "12 cups water",
            "3 pounds chicken parts",
            "2 tablespoons vegetable oil",
            "1 ½ pounds okra",
            "½ cup vegetable oil",
            "½ cup all-purpose flour",
            "1 pound andouille sausage, sliced",
            "1 (28 ounce) can Italian-style whole peeled tomatoes",
            "1 green bell pepper, chopped",
            "2 stalks celery, chopped",
            "2 cloves garlic, minced",
            "1 bay leaf",
            "2 teaspoons salt",
            "1 teaspoon dried thyme",
            "1 teaspoon dried basil",
            "1 teaspoon cayenne pepper",
            "1 teaspoon ground black pepper",
            "1 teaspoon file powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water and chicken in large pot. Bring to boil. Reduce heat and simmer until chicken is tender, about 1 hour. Using tongs, transfer chicken to strainer and cool, saving cooking liquid. Remove meat from bones in pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons oil in heavy skillet over medium heat. Add okra and cook until no longer sticky, stirring frequently, about 20 minutes; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir flour and remaining 1/2 cup oil in heavy large Dutch oven. Cook over medium heat until deep golden brown, stirring frequently, about 6 minutes. Add 4 cups reserved chicken cooking broth, okra, andouille sausage, tomatoes with their juices, bell pepper, celery, garlic, bay leaf, salt, thyme, basil, cayenne, and pepper. Cover partially and simmer until thickened, about 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon off any fat from surface of gumbo. Add chicken and file powder to gumbo and simmer gently 15 minutes. (If preparing ahead, cover and refrigerate. Bring to simmer before serving.) Mound rice in shallow bowls if desired. Ladle gumbo over and serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Gumbo Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bob Cody"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.597101449275362,
            "ratingCount": 345,
            "itemReviewed": "Chicken Andouille Gumbo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "781.6 calories",
            "carbohydrateContent": "18.5 g",
            "cholesterolContent": "157.2 mg",
            "fatContent": "60.8 g",
            "fiberContent": "4.5 g",
            "proteinContent": "39.7 g",
            "saturatedFatContent": "15.5 g",
            "servingSize": null,
            "sodiumContent": "1419 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-13T17:43:29.42Z",
                "reviewBody": "I am from Louisiana and I have eaten better gumbo but it was not bad.  A few of you are saying the okra was very slimy.  This is because you must boil your okra in a seperate pot with lots of water for about an hour before you put it into your gumbo.  Also using frozen okra is not as slimy to begin with.  Chop one medium yellow onion and add at same time as other vegetables.  Be very careful of when making your roux(the flour and oil mixture) it can be very tricky.  If you burn it throw it away do not use it, your gumbo will taste burnt.  Also do not cook your roux with the top on.  It is a very delicate thing.  Roux may be purchaseable at your local grocer depending on where you live.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SPREADHEAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1320677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-05T04:38:51Z",
                "reviewBody": "This is the kind of meal that sings to my hubby! I did change a few things though. I used my leftover turkey carcass with onions, celery and carrots to make my stock. I've made several tomato based gumbos before and wanted to stay away from that with this recipe, so I omitted them. In order to obtain a really rich flavor, which this recipe is famous for, the roux needs to become a deep caramel color. Six minutes would never cut it. Forty five minutes of constant stirring will do the trick. Time consuming, but worth it. I also used a whole chopped onion, a cup of green onion and a tablespoon of worcestershire sauce. Very delicious, satisfying and loved by the whole gang Christine! (this was my original review, but I just wanted to thank \"Gettinghealthy\" for the \"dry roux\" suggestion. He/she didn't say how to brown the flour in the oven so I researched it on the net. Boy oh boy, did this ever save a lot of work!!!! You can put whatever amount of flour onto either a cookie sheet or in a cast iron skillet and pop it into the oven at 400 for an hour. Give it a stir every fifteen minutes. The whole house will smell nutty and the flour browns up beautifully. Save and store any remaining flour to add flavor to any gravy. This sure beats standing over that stove and stirring for a half hour. Thanks!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T01:02:53.327Z",
                "reviewBody": "A real keeper! Having made this several times now, here are my helpful hints: I use 8 (not 4) cups cooking liquid, diced (not whole) tomatos, a chopped yellow onion and no file powder. I use frozen sliced okra - just dump it into a pan of boiling water, boil for 12 minutes, then drain in a colander before adding with the rest of the veggies. To make the roux in 6 minutes the oil should be barely simmering but not smoking when you add the flour then stir, stir, stir! If using frozen shrimp make sure you thaw them first, then press between layers of paper towels to remove excess water before adding to the gumbo - they act like little sponges. Lastly, use the leftover chicken liquid when making the rice. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIDESTEIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/862566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-23T18:21:57.983Z",
                "reviewBody": "Delicious gumbo. I modified it a bit (looking for a low cal dish). I used 4 cups chicken broth instead (used in lieu of reserved chicken boiling water) 4 boneless chicken breasts not chicken parts (boiled in water). I used 1 stick of butter instead of oil for the roux. I omitted the file powder (gumbo is very thick without it). I added one large onion & 1 Tablespoon of Old Bay seasoning (it was a bit bland without it). I estimated the calories on the whole dish to be around 3117. A heaping 1/2 cup white rice 1 heaping cup gumbo would be around 385 calories. I figure you will get a minimum of 11 servings from one batch of gumbo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAMATT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1198099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T14:33:12.42Z",
                "reviewBody": "Excellent recipe. We love cajun cooking but there's a lot of fat in this because of the oil. I have learned to brown flour on a cookie sheet in the oven until it's nice and dark and flavorful and it adds just as much roux flavor as a traditional oil/flour roux made in a skillet. I also omitted the tomatoes we prefer our gumbo to not have any. You can also boil a few uncracked eggs directly in the pot about 10 minutes before serving and then crack and peel the hot eggs and eat with the gumbo really yummy and very cajun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cherry2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1589505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T02:28:58.75Z",
                "reviewBody": "This was great! The only thing I did differently was not add the file powder-I believe that if you have okra you don't need file-at any rate it was great. I'm from Louisiana so I know my gumbo! I also just used a hot link sausage-they don't sell andouille where I live.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ilovetocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-28T05:31:05.53Z",
                "reviewBody": "This is my husband's favorite food that I make. The roux takes longer than 6 minutes more like 20. I add chopped onion (about 1 cup) and several cloves of minced garlic and don't use celery or bell pepper. I add 2 cans of \"Roasted Garlic\" diced tomatoes (Hunt's) Use frozen okra and simmer separately for about 20 mins. then strain off the goo. That way the okra is not slimey in the soup. I also add shrimp - the \"Easy-Peel\" frozen kind at the market - and I simmer the shells in just enough water to cover them for about 10 minutes. I strain the shells out and use this flavorful broth as part of the water required. Then I add the raw shrimp in the last 5 mins. of cooking - don't overcook your shrimp or they'll be tough! I add Zatarain's Creole Seasoning to taste. Serve over hot rice. This is so good that my neighbors will come around when they smell this cooking at my house. It's work-intensive but so worth it. Leftovers freeze and reheat well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMALA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/babycatcher/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-26T16:12:09.343Z",
                "reviewBody": "This recipe takes a long time - I cooked it on a rainy Sunday afternoon. The only thing about it that's remotely difficult is browning the flour - just keep an eye on it. This dish was a huge hit at my house. Some of us like to ladle it over rice in our bowls others like it as is. Some of us added Tobasco some not. I substituted 1 lb of peeled deveined shrimp for some of the chicken and put them in for the last simmering. This dish freezes well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LTWARD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/318574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-11T07:47:57.437Z",
                "reviewBody": "Yum!!! Just a few changes but I otherwise followed the recipe. I used a stick of butter with the flour to make the roux and used less chicken but added shrimp. Used red pepper instead of green and threw in some of Emeril's creole seasoning (his recipe from the website not the premade bought stuff). Served it over white rice. Tasted great that day and the next but there was no third day! We will be making this many more times!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Outta here",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/787988/"
                }
            }
        ]
    }
]