[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8137/boston-cream-pie-i/",
        "name": "Boston Cream Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F02%2F25%2F8137_BostonCreamPie_MFS.jpg",
            "width": 854,
            "height": 854
        },
        "datePublished": "1999-01-05T06:09:07.000Z",
        "description": "A rich creamy dessert also known as Boston Cream Cake. It is a wonderful combination of yellow cake, custard and chocolate glaze.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9 inch layer cake",
        "recipeIngredient": [
            "6 tablespoons butter, softened",
            "2 tablespoons all-purpose flour",
            "1 ½ cups cake flour",
            "2 teaspoons baking powder",
            "¼ teaspoon salt",
            "¾ cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "½ cup milk",
            "½ cup light cream",
            "½ cup milk",
            "¼ cup white sugar",
            "1 pinch salt",
            "4 teaspoons cornstarch",
            "2 eggs",
            "½ teaspoon vanilla extract",
            "3 (1 ounce) squares semisweet chocolate",
            "2 tablespoons butter",
            "¼ cup light cream",
            "½ teaspoon vanilla extract",
            "½ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour two 9 inch round cake pans. Sift the all-purpose flour, cake flour, baking powder and salt together and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a deep bowl cream 6 tablespoons of the butter with 3/4 cup sugar until light and fluffy. Beat in the 2 eggs, one at a time, then beat in the 1 teaspoon vanilla extract. Add the flour mixture alternately with the 1/2 cup of the milk in 3 additions, Beating the batter smooth after each addition. Divide the batter between the 2 prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 15 minutes or until cakes begin to shrink away from the sides of the pans and centers spring back when lightly touched. Turn the cakes onto wire racks to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make The Filling: Combine the 1/2 cup light cream with 1/4 cup of the  milk and cook over medium heat until bubbles begin to form around the edge of the pan. Immediately add 1/4 cup of the sugar and the salt, stirring until dissolved. Remove the pan from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine 1/4 cup of the milk with the cornstarch and whisk to remove lumps. Whisk in the 2 eggs. Add the hot cream mixture in a thin stream, whisking constantly. Return to the mixture to the saucepan, bring to a boil, and cook over low heat, stirring constantly, until the custard thickens and is smooth (about 5 minutes). Remove from heat and stir in the 1/2 teaspoon vanilla and allow to cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make The Chocolate Frosting: In a heavy saucepan over low heat, stir the chocolate pieces and 2 tablespoons butter until they are completely melted. Remove from the heat and, stirring constantly, add the 1/4 cup light cream in a thin steady stream. When mixture is smooth, stir in the confectioners' sugar and beat  vigorously. Stir in the 1/2 teaspoon vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Assemble Cake: Spread the cooled filling over one the cooled cakes and place the second cake on top. Pour the chocolate frosting evenly over the top allowing it to spill down the sides.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nancy D."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.764044943820225,
            "ratingCount": 89,
            "itemReviewed": "Boston Cream Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "325.5 calories",
            "carbohydrateContent": "43.4 g",
            "cholesterolContent": "93.9 mg",
            "fatContent": "15.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "222.5 mg",
            "sugarContent": "26.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-01-20T18:03:39.107Z",
                "reviewBody": "This cake was delicious! I must admit that I made the process easier by bypassing the \"cake from scratch\" part and substituted a Duncan Hines Yellow cake mix instead... much easier and I'm sure just as yummy. I did have trouble trying to figure out what \"light cream\" was. Didn't have anything like that in my grocery store... I ended up buying something called \"table cream\" which turns out to be light cream with some sodium. I ommited the pinch of salt for the filling since cream already had. Otherwise the icing was superb and it was easy to put together!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANET W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-14T20:41:41.06Z",
                "reviewBody": "My family says this is the best cake they have ever eaten! Instead of making the cakes by scratch I cheated and used box cake mix. I also cut each layer in two so there are 4 layers of cake and 3 layers of custard. Marvelous!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/201630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-20T18:03:29.56Z",
                "reviewBody": "I made this to take to work as a going away treat for a friend moving to Boston.  I cheated and made a yellow cake mix in a sheet cake pan, turned it out, and (once it cooled) cut it in half with a piece of string down the center.  I then put the bottom half back in (carefully!) and made this cream recipe, I had to quadruple it to get enough, but it was very good.  I then put the top half of the cake on, and made a triple  batch of this glaze and poured it on top.  I had to add a little extra powdered sugar though to cut the tart semisweet taste.  After the glaze hardened in the fridge I took some of the custard/filling I had saved, put it in a baggie, kneaded it with my hands, snipped off a corner and then drizzled it over the top of the cake to make it prettier.  The end result, it was delicious and beautiful!  Tasted just like from a restaurant only it served way more people.  A coworker loved the custard filling so much, she ate four pieces (ha ha!)  Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOBS WIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-26T08:53:23.043Z",
                "reviewBody": "This was the dryest cake I have ever eaten. I should have taken the other rater's advice and substituted a box cake. Also the filling is flavorless. The icing was the only part that was good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIELEARY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-20T00:33:07.66Z",
                "reviewBody": "This review is for the frosting only. Like others I cheated and used a cake mix and jello pudding as filling. But the frosting came out beautifully! It was fortunate that I actually had the semisweet baking squares. I wonder how it would turn out if you had to sub chocolate chips? I didn't have any cream so I used whole milk instead and it worked just fine. So easy and so fancy looking with the smooth frosting. Will definitely use again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRICIAJONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/948695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-26T23:54:54.763Z",
                "reviewBody": "I also cheated with cake mix LOL. I had some problems with the other parts of this recipe that more experienced cooks perhaps avoided. The filling went wrong somewhere around the \"whisk in the 2 eggs\" part that apparently wasn't enough to completely mix all the ingredients although it looked uniform; if I was to do it over again I'd beat the eggs with the salt until completely homogenized before adding to the other ingredients. I had to bail out to boxed pudding. The ganache (icing) went wrong at the add 1/4 cup conf. sugar and beat vigorously part; this resulted in a somewhat lumpy and grainy texture that no amount of beating would fix. If I was to do it over I'd maybe sift it in a little at a time or I'm told that corn syrup is good for this kind of icing. The flavor was great though dark and rich but sweet enough. All in all people enjoyed it and I'll probably try it again watch out for those tricky spots though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Fred G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2640160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-28T18:57:51.037Z",
                "reviewBody": "Boston cream pie is my favorite and I must admit as another member did that this was very dry and flavorless.I was very disappointed. Will keep looking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ginny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2134870/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-14T21:23:36.44Z",
                "reviewBody": "I made this entire recipe from scratch.  The cake was not dry at ALL, there was enough batter to fill up two 9 inch cake pans, the filling and frosting were wonderful, and the end result was one crazy-good pie that I will make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pawprints",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1769808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-19T01:23:22.76Z",
                "reviewBody": "I used a yellow cake mix. This turned out really well. The filling was the best. I would so make this another time it was wonderfull.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2918586/"
                }
            }
        ]
    }
]