[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/180/soups-stews-and-chili/soup/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13041/my-best-clam-chowder/",
        "name": "My Best Clam Chowder",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F27%2FMy-Best-Clam-Chowder.jpg",
            "width": 960,
            "height": 960,
            "caption": "My Best Clam Chowder"
        },
        "datePublished": "1999-01-08T01:49:30.000Z",
        "description": "A delicious, traditional, cream based chowder, this recipe calls for the standard chowder ingredients: onion, celery, potatoes, diced carrots, clams, and cream.  A little red wine vinegar is added before serving for extra flavor.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 (6.5 ounce) cans minced clams",
            "1 cup minced onion",
            "1 cup diced celery",
            "2 cups cubed potatoes",
            "1 cup diced carrots",
            "¾ cup butter",
            "¾ cup all-purpose flour",
            "1 quart half-and-half cream",
            "2 tablespoons red wine vinegar",
            "1 ½ teaspoons salt",
            "ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Drain juice from clams into a large skillet over the onions, celery, potatoes and carrots. Add water to cover, and cook over medium heat until tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a large, heavy saucepan, melt the butter over medium heat. Whisk in flour until smooth. Whisk in cream and stir constantly until thick and smooth. Stir in vegetables and clam juice. Heat through, but do not boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in clams just before serving. If they cook too much they get tough. When clams are heated through, stir in vinegar, and season with salt and pepper.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Seafood"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PIONEERGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.620831617949774,
            "ratingCount": 2429,
            "itemReviewed": "My Best Clam Chowder",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "501.2 calories",
            "carbohydrateContent": "28.4 g",
            "cholesterolContent": "136.6 mg",
            "fatContent": "32.7 g",
            "fiberContent": "2.2 g",
            "proteinContent": "23.9 g",
            "saturatedFatContent": "19.7 g",
            "servingSize": null,
            "sodiumContent": "712.3 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-15T15:34:25.647Z",
                "reviewBody": "This was awesome.  One modification, as per some earlier readers' comments:  Before doing anything, I browned six strips of bacon in the large skillet, removed them and let them drain.  Then, I added the veggies to the bacon fat and proceeded as described (with clam juice, water, etc.)  Crumbled the bacon into the soup after it was all combined.  Adds fat, but a huge flavor too.  Simply outstanding recipe here -- I love the red wine vinegar idea.  Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFSINGLEDAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-09T17:34:29.047Z",
                "reviewBody": "Very good base recipe but definitely does not warrant five stars. To increase flavor, I substituted clam juice for the water, added bacon grease in leiu of half the butter.  The bacon grease, while not exactly healthy, gave the chowder a better flavor (IMPORTANT NOTE:  You must let the roux cook down before adding the half and half ~ this will eliminate the flour taste that so many are noting in their reviews). Added 1/2 teaspoon of Bay Seasoning and 1/2 teaspoon of onion powder for more flavor.  Used a mix of chopped and minced clams and substituted 1/2 teaspoon garlic salt for a portion of the 1 1/2 teaspoon regular salt.  Stirred only 1 tablespoon of the vinegar into the chowder prior to serving.  Topped the chowder with crumbled bacon and a few chives for color.  Helpful Tips:  For a smokey flavor, add 1/2 teaspoon of liquid smoke which adds depth and complexity to the chowder base.  Add fresh grilled corn cut off the cob which increases the smokey flavor.  Replace black ground pepper with white pepper ~ it has a more delicate flavor than the ground black pepper which can be rather harsh with such a creamy base.  Most Important:  Do not add the clams to the chowder until you are ready to serve ~ the longer seafood \"cooks\" the tougher it becomes!  Delicious with the changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T20:08:53.733Z",
                "reviewBody": "I have been a clam chowder fan for as long as I can remember.  I order clam chowder often - when it's available.  This recipe is exceptional and compares favorably with the best clam chowder recipes I've tasted in fine restaurants.  I did the bacon thing as many other reviewers recommended.  I'm glad I did.  It added just one more interesting taste element to this already fantastic flavored soup.  I prefer my soup thick, so I used all 1/2 & 1/2 as well as a trace of heavy whipping cream that I wanted to get rid of.  When the soup was slightly thicker than even I like, I thinned it out ever so slightly with a little skim milk.  The only recommendation I might add, for those that prefer the consistency of more substantial clam;  get the chopped clam instead of the minced.  I think that's what I'll do next time I fix this, which will be often!  It's good enough to be an award winning soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T20:08:21.763Z",
                "reviewBody": "Very good recipe and is now a keeper in my personal recipes.  I left out the celery and carrots due to veggie pickiness in the family and was concerned that would affect the overall flavor.  Not a bit.  Interestingly, I tasted it prior to adding the salt and red wine vinegar.  VERY bland, uninteresting.  I added the salt, OK, that picked it up so that it started to taste like clam chowder.  But the real kick was the vinegar.  It brought it all together with a great taste!  BTW, as suggested by others I used all clam juice instead of water, added some bacon and sauted the onion in the bacon fat before adding the potatoes and clam juice.  Minor changes but bacon just sounded so good.  Well done, Sharon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BHYLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-02T01:41:36.077Z",
                "reviewBody": "My husband and I are both loved this clam chowder. I changed it alittle by cooking the onions in drippings from 4 slices of bacon and reducing the amount of butter. I also used 5 cans of whole baby clams. We are both from Maine and this is better than most restaurants up there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-03T17:32:50.673Z",
                "reviewBody": "Delicious!!  I make this recipe twice a month. Following other reviews, I use cornstarch instead of flour. I heat the cream (fat free) over low heat, while the vegetables are simmering. I mix 3/4 cornstarch in with 1/4 cup milk, then add that to the cream. I don't use the red wine vinegar, b/c I don't think it needs it. I also add Old Bay seasoning, garlic and onion powder, and I use dried minced onion instead of fresh. LOVE THIS RECIPE!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Lui",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1439399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T04:58:47.233Z",
                "reviewBody": "I am a chef and make clam chowder in restaurants and catering and use a similar recipe when I make it.  This recipe seems quite solid but here is what I do if anyone wants to try a little spin on it.  I add some fresh garlic to the sauteed veggies while they cook in bacon fat with a dash of butter(salt pork or ham hocks also work well here)  I do not use any onion at all but substitute shallot instead and nearly carmalize all the veggies first.  I do not use any half and half but instead use an extra can (or make your own) clam juice/stock and make up for the added water content by using heavy cream.   You wont need quite as much heavy cream as it calls for half and half and it still comes out nice and creamy with a little more clam flavor.  I add the chopped crispy bacon and clams towards the end of the cooking process as to not have tough clams or rubbery bacon with less flavor.  Try it out if you like...i also cook soup with a couple bay leaves, a little celery salt, thyme and a couple other minor adds that i like in clam chowder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7787160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T03:10:22.327Z",
                "reviewBody": "This is a good clam chowder recipe. However, when I first made this I felt that the half and half made it too thick like a stew. Since then I have used milk and it's much better. I also use chopped clams instead of minced. Thanks Sharon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSWISS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/836972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-20T03:12:11.553Z",
                "reviewBody": "We lapped this stuff up!  I was dubious first because there was a lot of vegetables and juice in the first mixture, but it all mixed together wonderfully! \r\n\r\nI also used part half&half and part skim milk and it was still VERY rich.  I also added some chopped fresh parsley at the very end and will try it with some bacon next time, although honestly it does'nt need it.\r\n\r\nI also recommend using bottled clam juice in place of the water if you like more of a sea taste for your chowder and I used 3 cans of chopped clams and 2 cans of minced.  It makes a LOT of leftovers and I froze them for a later meal.  \r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSALLIED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762587/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "My Best Clam Chowder",
            "description": "See how to make a creamy, 5-star clam chowder.",
            "uploadDate": "2012-07-10T18:39:26.262Z",
            "duration": "PT3M48.103S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8940ea66-b8d4-4978-9e28-7b0946fedd43%2Fa4736e00-5b37-4f7a-91d0-2e0f62236a65%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729110736001"
        }
    }
]