[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10095/candy-cane-cookies-i/",
        "name": "Candy Cane Cookies I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F27124.jpg",
            "width": 2848,
            "height": 2132
        },
        "datePublished": "1997-11-11T23:20:20.000Z",
        "description": "Make one complete cookie at a time.  If the dough of one color is shaped first, the little rolls become to dry to twist.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "½ cup butter",
            "½ cup shortening",
            "1 cup sifted confectioners' sugar",
            "1 egg",
            "1 ½ teaspoons almond extract",
            "1 teaspoon vanilla extract",
            "2 ½ cups sifted all-purpose flour",
            "1 teaspoon salt",
            "½ teaspoon red food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix well the shortening and butter, sugar, egg, almond and vanilla. In a separate bowl, mix flour and salt and add to shortening mixture.  Divide dough in half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend red food coloring into one half.  Roll 1 teaspoon of the red dough and 1 teaspoon of the white dough on lightly floured board into 4 inch strips.  Place strips side by side and  press lightly together and twist like a rope.  Curve top of rope down to look like the handle of a candy cane.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 9 minutes or until lightly browned.  Remove while still warm.   Sprinkle with  1/2 cup crushed peppermint stick candy and 1/2 cup sugar (optional).\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dolores White"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.798076923076923,
            "ratingCount": 104,
            "itemReviewed": "Candy Cane Cookies I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "287.3 calories",
            "carbohydrateContent": "30.4 g",
            "cholesterolContent": "35.8 mg",
            "fatContent": "16.9 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "254.8 mg",
            "sugarContent": "10.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-05T20:25:59.17Z",
                "reviewBody": "I have been making this recipe for over 30 years and have had NO problems with it except it takes time.  I roll out long (2 1/2 foot) lengths of each color then cut to the size I want.  Do not use too much flour to do this or the colors will not stick together when you roll them together and twist.  Use just enough to keep it from sticking to you or the counter.  If you have trouble rolling them or they break easily when removed from the pan, make smaller ones.  You decide the length when you cut them.  After reading some later comments on these cookies, I felt a need to comment on eggs and butter.  Whenever you bake the size of egg you use can make a BIG difference as well as butter vs margarine.  Margarine has water in it which alters the recipe.  Eggs, I generally use extra large (Costco eggs).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DBDCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T17:08:23.77Z",
                "reviewBody": "I have been making these cookies since I was a little girl.  My family has made a couple changes to the recipe through the years though.  First, if you are having problems with the cookies breaking, use regular white sugar instead of the confectioners' in the recipe.  It still yields a delicious delicate cookie, but the regular sugar makes a cookie just slightly chewy and alot stronger.  I have never had them fall apart after doing this.  Secondly, we never coat them in crushed candy canes.  I don't feel that peppermint and almond extract really go together. We instead coat our candy canes with confectioners' sugar before serving.  It just adds a little something extra and gives a nice presentation.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ATLMICHELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1421576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T21:04:58.56Z",
                "reviewBody": "This is the recipe my mom and I used as a child. We had lost it and tried to replicate it but it was never quite the same. My father and brother start nagging me in October to make candy canes for Christmas. Making the canes is a little labor intensive but everyone loves them. I've also rolled them and made cut cookies (which Dad and brother don't like as well) and I've made part of the dough green to make wreaths. Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NJBAKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/579160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T15:38:35.547Z",
                "reviewBody": "I found it easier to divide both the red and white dough balls into 8 parts each then roll one of each color into a log and cut each log into a number of parts (about a dozen...depends on the exact size you want the cookies to be) then work with those little nuggets of dough as you need them. Also after giving the two ropes a twist I gave 'em another roll so they were a single stripped stick and came out more like a candy cane. You can also substitute the almond extra with peppermint as many people aren't expecting them to be almond flavored.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ONEIROS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714457/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T21:17:16.18Z",
                "reviewBody": "This is a great base recipe. I was used to them with a mint flavor instead of almond so I used vanilla and peppermint (no almond) extract and substituted granulated sugar for powdered. The consistency of the dough seemed fine and the two colors twisted together as expected. I sprayed the pan with non-stick spray before baking and had no cookies brake when removing them from the pan. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Selene K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3082077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-10T20:17:55.71Z",
                "reviewBody": "after reading all the reviews with the problems of breakage I decided since this recipe was so close to the spooky witches fingers recipe which I had no problems with I'd adopt the differences between the two recipes here. I didn't want to use shortening so I used all butter but added the tsp of baking powder and cooked at 325 for 15 min. They were perfect. No breakage and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne Musella-Fling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1043735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T17:09:17.133Z",
                "reviewBody": "These are the same that my mom has been making for 40 years! The complaints on here are the same ones I've been hearing from her for at least 35 years (LOL). I agree the size of egg AND shortening make a HUGE difference in how the dough comes out. The dough tends to be a bit on the dry side -- use extra large or large eggs and the dough will be easier work and shouldn't crack so much. I moved to Ohio 10 years ago and mom has tried shipping them to me (they don't withstand the postal service too well) a few years back she just started rolling the dough out and cutting it like a sugar cookie -- they are much more durable and still taste GREAT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dave Hirschler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3982505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-21T23:51:51.67Z",
                "reviewBody": "These tasted pretty much like I remember having when I was a kid. I used 1 cup of butter and no shortening to avoid hydrogenated oils and I think this made mine spread/flatten out a lot and made them more cakey rather than pastry-like in texture. (I mention this only as fyi for anyone else who prefers not to use shortening when baking) But they were yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DENISEI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/983495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-06T21:25:05.7Z",
                "reviewBody": "These cookies are the same ones my Mom used to make for my sister and me. They were always my holiday favorites. The almond extract adds a great flavor and the dough is easy to handle if you roll it with your hands into thin strips. No sugar or candy coating necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELA N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/232568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-10T03:40:44.09Z",
                "reviewBody": "YUK!! Not a very good flavor and worst of all is that the dough is extremely horrible to handle. The dough kept cracking as I rolled it into shape. I tried rolling the dough with a rolling pin to do something else with it and it didn't roll with a pin well. I wound up making 12 candy canes and threw the rest of the dough out! By far the worst dough I have ever had the misfortune of handling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Leah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/224834/"
                }
            }
        ]
    }
]