[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10159/cranberry-almond-biscotti/",
        "name": "Cranberry Almond Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F141445.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1997-11-13T02:12:20.000Z",
        "description": "I modified a recipe to make this a darker biscotti. For a richer almond flavor, use almond extract instead of the vanilla.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "30 cookies",
        "recipeIngredient": [
            "2 ¼ cups all-purpose flour",
            "1 cup white sugar",
            "1 teaspoon baking powder",
            "½ teaspoon baking soda",
            "2 egg whites",
            "2 eggs",
            "1 tablespoon vanilla extract",
            "¾ cup sliced almonds",
            "1 cup sweetened-dried cranberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (170 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine dry ingredients in a medium sized mixing bowl. Whisk together eggs, egg whites, and vanilla or almond extract in a separate mixing bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add egg mixture  to dry ingredients, mixing just until moist, using an electric mixer on medium speed. Add dried cranberries and almonds; mix thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On floured surface, divide batter in half and pat each half into a log approximately 14 inches long and 1 1/2 inches thick. Place on a cookie sheet and bake 30 minutes or until firm. Cool on a wire rack about 10 minutes, or until cool enough to handle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut biscotti on the diagonal into 1/2-inch slices. Reduce oven temperature to 300 degrees F (150 degrees C).  Place cut biscotti upright on a cookie sheet, spacing them about an inch apart, and bake for an additional 20 minutes. Let cool and store in a loosely covered container.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "KATHIANNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4520547945205475,
            "ratingCount": 146,
            "itemReviewed": "Cranberry Almond Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "188.8 calories",
            "carbohydrateContent": "35.5 g",
            "cholesterolContent": "24.8 mg",
            "fatContent": "3.2 g",
            "fiberContent": "1.4 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "91.6 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-23T04:18:49.55Z",
                "reviewBody": "This is what traditional biscotti is *supposed* to taste like.  Biscotti is not supposed to have oils or fats in them and are supposed to be one of the more nutritious cookies that you can make as a result.\n\nWith that said, I have made this recipe a dozen or so times and I have added a few things that others may find handy:\n\n1) You can \"knead\" the cookie dough in the bowl you are working with.  You may need to wet your hands to avoid copious amounts of batter sticking to you.\n\n2) Add the almonds and cranberries to the dry ingredients as it is far easier to incorporate them into the dry than the wet.\n\n3) Add lemon zest or orange zest to the mix to make the cookies even more aromatic and enjoyable. \n\n4) Instead of the \"logs\" that are suggested, create 2 giant cookies about 5-6 inches in diameter.  Put them on baking paper to ease in cleanup and removal.  The cookies will be cut in straight lines and result in large biscotti instead of smallish ones.  With a circle, there is not need to cut on a bias, since any angle is straight in a circle.\n\n5) If your fingers can stand it (or use an oven mit), cut the biscotti into fingers almost immediately upon removing them from the oven.  The biscotti will still be soft enough not to crumble when you cut them and you can save 10 minutes of cooling time.\n\n6) Ensure that the second time you bake them, you lay the fingers bottom-down instead of possibly on their sides.  This will prevent uneven browning on the sides.\n\n7) Coat with chocolate o",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gmclearn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3410036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-20T15:54:23.357Z",
                "reviewBody": "When I first made these I had never done biscotti before and I was afraid they would be a flop but they were GREAT! I used the almond extract and the only thing you need to do to these that is not in the recipie is to knead them for a few minutes when they are in the two seperate logs or else the dough is a bit crumbly and unmanagable. I have made these twice now and the second time I dipped oneend in chocolate and gave them away to friends around the holidays so pretty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPH577",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1146320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-02T19:23:53.45Z",
                "reviewBody": "I didn't like this one at all. I've made many different kinds of biscotti before and I thought this one sounded strange without any butter or oil in it but figured I'd give it a try anyhow. My first instinct was right though. The texture was not at all good and they seemed stale later that afternoon already.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "STARBUCKS-GIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-25T21:12:46.95Z",
                "reviewBody": "Excellent! I forgot to put the cranberries and almonds in but I had already put the logs onto the cookie sheet so I sprinkled some almonds on top (I had used almond extract) and baked them anyway. Then I made a second batch with the cranberries and almonds and vanilla extract and both turned out very very good! HINTS: 1.) Like the previous reviewer said just knead the dough before shaping it making it all stick together. That adds a little love to the recipe too I'm sure it makes it taste extra special:) 2.) Try using SUGAR instead of flour to cover the surface you shape it on. This gives it a nice crystallized slightly sweet texture to the outside and gives it the extra \"oomph\" that separates it from other biscotti recipes! THANKS for a great recipe - I'll be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laetchison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1276585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T16:16:00.88Z",
                "reviewBody": "FANTASTIC!! This biscotti was perfect! Everything you think about a biscotti - is what this is! Long and thick and ultra crispy yet has a nice delicate flavor! I don't know why other recipes are used - when this one is so low in fat and so easy to make! It is really versitile! I used 3 eggs instead of the 2 eggs and 2 egg whites. I also used a little less sugar than what was called for - and it was sweet enough. I have made it as written and I have also made it with other modifications. I made it into Coconut Biscotti by omitting the almonds and dried cranberries and added 2 cups of flaked sweetened coconuts and 1 tsp. cinnamon. I also made it with chocolate chips and sprinkles some cinnamon sugar on the sliced biscottis when the baked the second time. They were all fantastic! I will be making this again! UPDATE - I made these for PASSOVER! Instead of the 2 1/4 cup flour - i substituted 1/2 of that amount of matzo cake meal and 1/2 the amount of potato starch! I also made another batch and instead of flour used 1/2 the amount of matzo meal and 1/2 the amount potato starch - both came out great - but i liked the one with matzo cake meal as it has a finer crumb than matzo meal. - Both were fantastic! I used chocolate chips instead of the almonds and cranberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef4Six",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2646978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-21T21:12:30.89Z",
                "reviewBody": "I substituted three quarters of the sugar with Splenda with excellent results. They are outstanding!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Norma Horan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T03:47:48.497Z",
                "reviewBody": "This is so easy (for biscotti). I made this last year for a cookie exchange with 13 other women and this was voted as the winner. I added 1 t. cinnamon and 1/2 t nutmeg and used Crasins instead of fresh cranberrys. This was a welcome recipe that I didn't have to struggle with broken pices at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINA MURRAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/203836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-28T19:38:23.29Z",
                "reviewBody": "This recipe was extremely easy to make and low in fat to boot! I used whole almonds instead of sliced and it turned out perfectly! I will definitely be making this biscotti recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAULA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/260008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-06T17:24:01.937Z",
                "reviewBody": "I have made these Biscotti repeatedly with outstanding results. I make them gluten free and they are easily adapted to GF starches with the addition of xantham gum. They are crumbly to slice but the crumbs taste so delicious we don't mind the extra tidbits! Keeps well if they don't get eaten quickly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LKOLLEEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756070/"
                }
            }
        ]
    }
]