[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17539/chocolate-mousse-cake-iv/",
        "name": "Chocolate Mousse Cake IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2289501.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "1999-01-15T19:05:37.000Z",
        "description": "Chocolate cake with chocolate mousse filling. Everyone will think you bought it at a bakery!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "1 - 9 inch cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package chocolate cake mix",
            "1 (14 ounce) can sweetened condensed milk",
            "2 (1 ounce) squares unsweetened chocolate, melted",
            "½ cup cold water",
            "1 (3.9 ounce) package instant chocolate pudding mix",
            "1 cup heavy cream, whipped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Prepare and bake cake mix according to package directions for two 9-inch layers. Cool and remove from pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together sweetened condensed milk and melted chocolate. Gradually stir in the water, then instant pudding until smooth. Chill for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the chocolate mixture from the refrigerator, and stir to loosen. Fold in whipped cream and return to the refrigerator for at least another hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place one layer of cake onto a serving plate. Top with 1 1/2 cups of the mousse, then cover with the remaining cake layer. Frost with the remaining mousse, and refrigerate until serving. Garnish with fresh fruit or chocolate shavings.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.606606606606607,
            "ratingCount": 333,
            "itemReviewed": "Chocolate Mousse Cake IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "326.9 calories",
            "carbohydrateContent": "50.5 g",
            "cholesterolContent": "21.2 mg",
            "fatContent": "13.6 g",
            "fiberContent": "1.8 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "455.9 mg",
            "sugarContent": "34.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-06T23:04:07.53Z",
                "reviewBody": "TO SUM UP ALL THE REVIEWS:    YOU MUST do these changes and you will have PERFECT results!  Add 1/4 tsp cream of tartar to heavy cream before whipping.  CHILL the bowl and mixers you will use to whip the heavy whipping cream for atleast one hour in the freezer. After baking the cake and letting sit for 10 minutes to cool immediately wrap cake tightly in plastic wrap(a very successful wedding cake baker gave me this tip) It will make the cake SUPER moist! After wrapping the cake put in fridge until completely cool or if you have time let cake sit out until completely cool. You must follow the recipe and cool everything for its specified times or mousse will end up runny. Fold in mousse like stated!  VERY important!  Do NOT stir!  Fold and fold until completely incorporated. ALSO, change the amount of water you add to chocolate mixture to 1/3 cup.    I used two dark 9in pans for the cake.  I cooked my cake for 30 minutes at 325deg.   The mousse is so unbelievably decadent and delicious!   My cake turned out PERFECT! VERY best cake recipe out there! I did use a yellow cake mix b/c I feared chocolate may be a bit over the top(and im a chocoholic!) im glad I did, the mousse is SO rich! Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Medic's Wife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2345227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-09T23:20:55.903Z",
                "reviewBody": "This has got to be the best cake I have ever tasted.  Hard to believe it started with a box.  I used the \"butter recipe\" box mix that uses a stick of butter.  I made mine as a torte with 6 layers and it turned out great.  A lot of reviewers had mentioned trouble when they went to take the cake to work or such.  So here are a few little catering tricks I use when I need to transport delicate cakes like this one.   If you don't want your icing to slide on the layers, add a 1/4 teaspoon cream of tarter to the heavy cream before you whip it up.  It will stablize the whip cream somewhat, just as it does for egg whites.  Be sure to whip until you get stiff peaks.  Also, after you put the mousse between the layers, chill the cake for about 30-45 minutes and then frost the rest and return it to chill until you need to transport it.  With the extra time in the fridge, the mousse between the layers has time to set up and settle in to the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bonniejo roberts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-15T17:25:03.547Z",
                "reviewBody": "Just made this cake for the second time in as many weeks.  I'm a great cook...not such a great baker, but this recipe let's me pretend I am.  Wonderful, moist recipe and definately better if combined and let to sit overnight.  I also used only 1/4 cup of water and used Fudge chocolate cake and fudge chocolate pudding.  I thought that it was perfect! For those of you the have the problem with the runny mousse.  Please heed previous advice about cold cream and beating it until very stiff.  Also, just in case you don't know.  You must'nt beat the cream into the chocolate as it deflates the whipped air.  What you need to do is gently fold  about 1/3 of whipped cream into the chocolate and fold over until white stripes are gone and then add more whipped cream.  Continue until all whipped cream is folded into chocolate.  STOP when there is no more white streaks showing.  Refrigerate immediately and you should have a wonderful mousse.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLYNEAUX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/291617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T17:31:50.073Z",
                "reviewBody": "This was a wonderful recipe! I made this cake for a co-worker's b-day and used a yellow cake mix instead of chocolate put strawberries between the layers as decoration and it turned out awesome! I even got several proposals of marriage from the guys I work with...LOL (already married though.) I read where a great many people had problems with the icing & I can't say I encountered any problems. The tip about reducing the water by 1/4 c came in handy as well as the tip about the cream of tartar to stabilize the whipping cream. I will say that having worked with whipping cream before it can be a little tricky you have make sure it is whipped into stiff peaks or it will turn any recipe into a BIG MESS if you don't. Definitely do not make this recipe if you are in a hurry and I agree with making it the night/day before. One tip I have not seen that may help is to make sure you are using heavy whipping cream and it is very cold do not take it out of the fridge unless it is to put it straight into the bowl to whip. It is also best to use a beater that has a whisk attachment regular beaters do have the same effect sometimes. The most important tip I give to all my friends when working with whipping cream is to be sure to CHILL YOUR BOWL this can make a huge difference. Stainless is the best I let my bowl sit in the freezer while I am preparing the cake mix. Once I am ready to whip the cream I add it to the chilled bowl and whip it to stiff peaks and then place it in the fridge",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HILLY29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hilly_starting_over_in_2009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-14T02:05:08.357Z",
                "reviewBody": "The mousse worked perfect for me here's what I did: melted chocolate and added condensed milk and mix until JUST combined. Added water (at room temp.) and stired through when ALMOST combined add pudding mix. Refrigerate for 45 minutes. While chilling beat cream until thick and heavy (just before it turns to butter - I mean REALLY thick) refrigerate cream to get very cold (use a ceramic or metal bowl to help it get as cold as possible). Add the cold cream to the cold pudding and mix well. Refrigerate overnight covered with cling wrap(8 hours plus). Bake what ever cake you like (chocolate sponge is my favourite)and top with the mousse. Refrigerate again (for about 2-4 hours) and serve. It does take a little pre-planning but worth all the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-21T15:31:33.03Z",
                "reviewBody": "I love this cake so much that I made it three weeks in a row! I used butter cake instead of chocolate for one version just as good. My only recommendation is the same as the other reviewers use REALLY cold cream to whip. Try putting a metal bowl in the freezer for about 10 minutes before adding and whipping cream. Also don't whip or stir in the cream to the chocolate mix fold gently. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVEBUGSMAMMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/970163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T02:54:16.81Z",
                "reviewBody": "I used Hersheys deep dark chocolate cake recipe from this site instead of a mix. The mousse I used to fill and frost the two layer cake. It was one of the most moist cakes ever. I even had extra mousse to use with each serving. wonderful!! Will make again and again! Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen Langham Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T11:40:28.013Z",
                "reviewBody": "Very rich cake! Co-workers RAVED about it! The mousse was thick more like a frosting but nevertheless it was to die for! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T02:28:41.373Z",
                "reviewBody": "i got a marriage proposal on the filling alone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANYONEHUNGRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T11:30:45.92Z",
                "reviewBody": "This cake was quite delicious and easy to assemble. Be careful not to chill the mousse longer than the recommended 30 minutes. I left it in the fridge for almost two hours and had a very hard time softening it enough to fold in the whipped cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GREENVILLAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/837953/"
                }
            }
        ]
    }
]