[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2421/desserts/frostings-and-icings/buttercream/",
                    "name": "Buttercream",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8127/new-duchess-spice-cake-with-maple-buttercream-frosting/",
        "name": "New Duchess Spice Cake with Maple Buttercream Frosting",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1068679.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-01-15T19:31:56.000Z",
        "description": "I knew that my husband's favorite cake was spice cake so I made this for him and he absolutely died when he tasted it! It's now his favorite (even better than his mom's recipe!).",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9-inch layer cake",
        "recipeIngredient": [
            "2 ⅓ cups all-purpose flour",
            "1 cup white sugar",
            "1 teaspoon baking soda",
            "1 ½ teaspoons ground cinnamon",
            "¾ teaspoon ground nutmeg",
            "¼ teaspoon ground cloves",
            "1 teaspoon salt",
            "1 cup packed brown sugar",
            "⅔ cup shortening",
            "1 cup buttermilk",
            "3 eggs",
            "½ cup shortening",
            "½ cup butter, softened",
            "1 teaspoon maple flavored extract",
            "4 cups confectioners' sugar",
            "2 tablespoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch cake pans or one oblong pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift flour, white sugar, baking soda, cinnamon, nutmeg, cloves, and salt together. Add brown sugar, 2/3 cup shortening, and buttermilk. Beat 2 minutes. Add eggs, one at a time, beating well after each addition.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes or oblong pan for 45 minutes, until toothpick comes out clean. Cool. Frost.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make frosting: cream butter and 1/2 cup shortening together. Add maple flavoring. Gradually add confectioners' sugar. Gradually add milk and continue beating until light and airy. Add more milk if necessary. Color with maple coloring, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Buttercream"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4140625,
            "ratingCount": 128,
            "itemReviewed": "New Duchess Spice Cake with Maple Buttercream Frosting",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "559.2 calories",
            "carbohydrateContent": "81.1 g",
            "cholesterolContent": "58.2 mg",
            "fatContent": "25.2 g",
            "fiberContent": "0.7 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "342.3 mg",
            "sugarContent": "64.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-29T17:14:55.363Z",
                "reviewBody": "This cake was delicious but there are a few things I would change for next time. First of all I would cut the frosting in half. I baked it in a 13x9 pan and there was literally about an inch of frosting. Also 45 minutes is a little too long to bake it in a 13x9. When I took it out it was just starting to get black and hard aroung the edges. One last thing...next time I might add some raisins or nuts to the batter. Thanx",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KEVINCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/776349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-20T18:32:32.103Z",
                "reviewBody": "I struggled with how many stars to rate this cake. I was not impressed with the cake itself or the recipe directions but the frosting was a real winner. Traditionally a cake of this type has pretty standard directions: cream the butter or shortening and sugar(s) add eggs one at time then add the sifted dry ingredients alternately with the liquid beginning and ending with the dry ingredients. The second problem is that the baking time as directed is far too long. Even at 25 minutes I believe my layer cake was overbaked which I'm sure contributed to the third problem which is that the cake was not nearly as moist as it should have been. The flavor was great and I did add 1 tsp. of double-strength vanilla. Now the frosting is perfect - silky fluffy light and smooth with just the right amount of maple flavor. But even here there was a problem. Other reviewers have commented they had too much frosting for their 9x13\" cake. I on the other hand made a layer cake and did not have enough frosting to frost the sides. Unfortunately given the issues with the mixing and baking instructions and the fact that this was on the drier side I can only call this an average cake even though the frosting was simply perfect and beautiful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T14:35:48.937Z",
                "reviewBody": "This was good but I did have to modify it. Like others my cake was done in 25 minutes and I was very thankful for the reviews or I might have walked away from the oven and ended up with a burnt cake! I split the batter into two nine inch rounds so that may have had something to do with it. Otherwise the recipe was great tasted just like the spice cake I remember. The spice ratio was PERFECT but overall not quite strong enough for me so I would probably increase the spices by half next time just to my own preference. I didn't have any maple extract so I tried substituting some of the sugar in the frosting for real maple syrup. The texture was fine but the maple flavor was hardly noticeable--just a warning for anyone else who might try the same thing;0). Otherwise it was great. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MixieArmadillo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1190181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T19:56:42.3Z",
                "reviewBody": "Spice cake is my favorite cake as well. I have been wanting to try this recipe but was worried the high ratings were more for the frosting than the cake. Not to worry! I did make a few changes but nothing that substantially changed the recipe. Most of my changes were in the directions because I'm really anal when it come to preparation. First I sifted the flour cinnamon baking soda salt nutmeg and cloves but not the white sugar. I substituted unsalted butter for the shortening and creamed it with the white and brown sugars. I then beat in the eggs (one at a time as directed) as well as a teaspoon of vanilla extract. Finally I added the flour mixture (in fourths) alternately with the buttermilk (in thirds) beginning and ending with the flour mixture. I know this sounds complicated and time consuming but it really isn't. I baked my cake in a 13x9 pan for 35 minutes. 45 minutes is too long. I always use an oven thermometer so I know my oven is correct. Anyway I frosted it with a traditional cream cheese frosting and my husband and I both thoroughly enjoyed it! So thank you Stephanie from both of us!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-07T18:54:47.623Z",
                "reviewBody": "The frosting was superb! I added an extra 1/2 tsp. maple flavoring to the frosting since the flavor was too subtle. The cake however was very dry. I'll keep the frosting recipe and search for another spice cake recipe to go with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-21T17:35:38.247Z",
                "reviewBody": "Spice cake and carrot cake are tied as my favorite. I loved this recipe but made a couple of healthy changes. I used Splenda in place of the white sugar olive oil in place of shortening and added a cup of applesauce for moisture. I did not substitude anything in the frosting (best part) but cut it in half and had enough. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-10T18:54:33.127Z",
                "reviewBody": "WHEN WILL I LEARN??? This cake is not good.  It's dry, just like pretty much everyone else has said... but noooooooooooo, I had to try it anyway thinking my superior talent in the kitchen could side step the inequities of this recipe.    The edges of the cake were hockeypuck-esque. The inside was dry and crumbly.  I creamed the sugar/shortening and even increased the shortening to meet 1/2 the sugar level.  Beat in the eggs one at a time, added the dry mixture to the wet, adding buttermilk inbetween scoops of flour - didn't overmix.  I gave it all I had... Please folks... stop rating the frosting!  When will I learn to trust the reviews?  When will I learn?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1524223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-28T21:54:45.037Z",
                "reviewBody": "i didnt make the cake...i was looking for a maple frosting recipe and found this so i only made the frosting. but it deserves 5 stars i'll definetly be using it again! i added a little extra maple and decreased the confectioners sugar by almost a cup. its a very sweet frosting as written. thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sparrow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5140540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-04T17:53:54.38Z",
                "reviewBody": "The cake itself is delicious and moist with a wonderful texture. The smell of the cake baking had my son's mouth watering. We couldn't wait any longer and iced it while it was still slightly warm. I did make a couple of small changes -- I used all butter instead of butter and shortening and half the quantity of icing was perfect for the sheet cake version. YUM! Next time I will add some ginger and some allspice to the batter. To those who claim the cake is dry I suspect that you're using too much flour. Make sure to sift it thoroughly BEFORE measuring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne Reissig-Peabody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/767230/"
                }
            }
        ]
    }
]