[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/171/soups-stews-and-chili/broth-and-stocks/",
                    "name": "Broth and Stock Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15928/soups-stews-and-chili/broth-and-stocks/chicken-stock/",
                    "name": "Chicken Stock Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13072/chicken-broth-in-a-slow-cooker/",
        "name": "Chicken Broth in a Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F33556.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-01-18T02:40:32.000Z",
        "description": "This is the recipe I use to make chicken broth for use in other recipes. Because it's done in the slow cooker, you don't need to fuss with it. I like to use breasts and wings, but any bone in pieces will make a nice broth.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT10H0M",
        "totalTime": "P0DT10H15M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "2 ½ pounds bone-in chicken pieces",
            "6 cups water",
            "2 stalks celery, chopped",
            "2 carrots, chopped",
            "1 onion, quartered",
            "1 tablespoon dried basil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken pieces, water, celery, carrots, onion, and basil in a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low setting for 8 to 10 hours. Strain before using, and discard vegetables. Chicken may be removed from the bones, and used in soup.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Broth and Stock Recipes",
            "Chicken Stock Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Micki Stout"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.627358490566038,
            "ratingCount": 212,
            "itemReviewed": "Chicken Broth in a Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "247.2 calories",
            "carbohydrateContent": "5.8 g",
            "cholesterolContent": "61.5 mg",
            "fatContent": "14.8 g",
            "fiberContent": "1.8 g",
            "proteinContent": "21.7 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "99.2 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-09T16:07:27.997Z",
                "reviewBody": "micki thanks for the great recipe! this is the best way to make chicken broth!!! no skimming:-) i have made it about three/four times. i played around with using different cuts of chicken and i feel chicken thighs and wings work the best. the dark meat held up to the long cooking time. i don't like dried basil, instead i used a bit of fresh thyme, one bay leaf, one tsp of black peppercorns (don't use gourmet blend - way to peppery). fyi - the last batch of broth i made, i deboned the chicken after 4 hours. i put the bones back in for the last 4 hours and the broth came out more rich and thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRSW00DY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T17:33:58.69Z",
                "reviewBody": "Excellent recipe!  I think one should try to give the recipe an \"as is\" a before rating so the rating is fair, but since I make chicken broth all the time and in the crock pot I am going to violate my rule.  I am dying to try basil in the broth having never tried it before.  It should be wonderful and why didn't I think of it myself as it is a natural for chicken?  lol!  As a tip to others, I buy whole chickens when they are on sale, throw them in the freezer and whenever I need chicken meat for a recipe I cook one in the crock pot.  I don't bother thawing, I just remove the outer plastic bag.   Also longer cooking concentrates the broth and makes it more flavorful, so those who had problems with flavor could improve it by longer cooking.  I usually start mine at night before I go to bed so it is ready to finish when I get up the next morning.  I use a large glass to hold a quart freezer bag open while I ladle the broth into it.  I do two sizes; a 3 cup and a 1 cup.  The one cup is handy for when a recipe only needs a small amount of both.  I remove the air from the bags and lay them flat on a cookie sheet.  Once they are frozen hard, stand them up on end and put in a shoebox sized plastic basket.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bobbie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1833669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-05T03:26:24.403Z",
                "reviewBody": "Good recipe.  I used thighs, and didn't bother skinning them.  After cooking all day, I let it sit in the fridge overnight and skimmed off the large amount of fat on top.  I used some in Vegetable Couscous from this site, and froze the rest in 1-cup portions to use in recipes.  It has a nice deep, rich flavor and made the couscous taste wonderful.  I have done this before with a chicken or turkey carcass.  I added a bit of salt (not too much though, I hate how salty store-bought broths are, even the \"reduced-sodium\" varieties...)  Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T18:53:03.25Z",
                "reviewBody": "I made many batches of this wonderful broth when the recipe was posted. I filled 1/2 gallon size freezer bags with the strained broth and put them in the freezer. This fall I have already made two WONDERFUL home-made 'chicken noodle' and 'chicken vegtable and rice' soups in the crock pot with this broth as my base. I can't wait to make more for the freezer and upcoming winter months!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lovemyfamily09",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-15T19:13:34.257Z",
                "reviewBody": "Micki thanks. I'm new to crock pot cooking. This is such a grand idea because I so much prefer home made stock to canned or ugh cubes. I left out basil didn't peel onion. Peel gives a little darker color. I put broth in refrig. discarded fat then put into ice cube tray froze then placed cubes into freezer bag. Have easy home made on demand. Much easier than old way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAYBETHEBEST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1211721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T05:38:53.943Z",
                "reviewBody": "I used chicken thighs only for deeper flavor. About halfway through I removed the skin & meat from the bones and returned the bones to the crockpot. After it was done I placed the broth in the fridge overnight so that the fat could rise to the top solidify and I could just lift it off. Worked great. Used some then jarred up the rest and froze it. Homemade chicken stock is so flavorful and better yet I can control the seasonings especially salt that is so prevalent in the store-bought stuff! Thanks so much Micki!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-10T20:19:30.687Z",
                "reviewBody": "I have made this recipe a few times now and have followed suggestions regarding spices to add by other reviewers. The broth turned out wonderful each time though the first couple of times I only made soups with it. I liked the original version best for making other recipes with the chicken except that I substituted dried parlsey for basil. After cooking it all day I strained the vegetables and left the broth with the chicken in it in the refrigerator overnight. The next day I skimmed the fat cut up the meat and strained the broth through a sieve lined with a paper towel. Half of the broth will be used with some of the chicken in soup and I froze the other half to make the Oriental Shrimp Noodle soup also on this site. I also made Angel's Chunky Chicken Salad and chicken burritos using Salsa Chicken Burrito filling both recipes on this site and both yummy. Four different meals from one recipe gives me a little variety as I'm cooking for two. Thank you for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb1970",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1562335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-28T15:46:55.857Z",
                "reviewBody": "love the idea of making stock in a slow cooker. i never thought i'd make my own stock until i stumpled upon this recipe. this is a great fuss-free recipe. i cooked it overnight for 10 hours and i ended up with a clear rich stock. i omitted the basil and instead used thyme, parsley, bay leaves, peppercorns and a pinch of nutmeg. i added some salt at the end to taste. after i strained it i left it in the fridge to cool and scooped off the fat on top. will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UNPLAINJANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-20T18:14:12.433Z",
                "reviewBody": "This is so much tastier than the chicken bouillon water soup I've been making before! I always thought making homemade stock was too involved but this is very simple. I used the bones from a rotisserie chicken and added a bay leaf and few peppercorns. I didn't even bother chopping up the veggies too much. I cut them in half and just tossed them in. For the soup I discarded all the old veggies and put in new ones because the old ones were zapped of flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-02T23:35:18.723Z",
                "reviewBody": "Wonderful stock - and so easy anyone could do it. We love parsley so I subbed parsley for the basil and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "heavenscent100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8265122/"
                }
            }
        ]
    }
]