[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1552/soups-stews-and-chili/soup/vegetable-soup/potato-soup/",
                    "name": "Potato Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12922/cheesy-potato-and-corn-chowder/",
        "name": "Cheesy Potato and Corn Chowder",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1074932.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-01-21T18:26:41.000Z",
        "description": "Comfort food . . . hot and tasty for those cold winter days.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 - 8 servings",
        "recipeIngredient": [
            "2 tablespoons margarine",
            "1 cup chopped celery",
            "1 cup chopped onion",
            "2 (14.5 ounce) cans chicken broth",
            "3 cups peeled and cubed potatoes",
            "1 (15 ounce) can whole kernel corn",
            "1 (4 ounce) can diced green chiles",
            "1 (2.5 ounce) package country style gravy mix",
            "2 cups milk",
            "1 cup shredded Mexican-style processed cheese food"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In large saucepan, melt margarine over medium high heat.  Add celery and onion; cook and stir until tender, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add chicken broth; bring to a boil.  Add potatoes; cook over low heat for 20 to 25 minutes or until potatoes are soft, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in corn and chiles; return to boiling.  Dissolve gravy mix in milk; stir into boiling mixture.  Add cheese; cook and stir over low heat until cheese is melted.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Potato Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jackay"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.734753146176186,
            "ratingCount": 1033,
            "itemReviewed": "Cheesy Potato and Corn Chowder",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.3 calories",
            "carbohydrateContent": "37.8 g",
            "cholesterolContent": "23.3 mg",
            "fatContent": "11.8 g",
            "fiberContent": "4.4 g",
            "proteinContent": "11.3 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "1020.8 mg",
            "sugarContent": "11 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-02T18:15:46.8Z",
                "reviewBody": "this was scrumpious. \nwhat we did was fry  about half lb. bacon drain some fat then fry onions,celery,carrots and chilis in that .\nthan add broth and potatoes cook till tender and stir in cheese and some cream and milk and 1 can corn and 2 cans cream corn . \nserved it in big soup bowls topped with the bacon crumbled . \neverybody loved it little ones to oldest .\n is a keeper \n***************************************\n\neven thou its summer still make this soup\ni fry up few slices bacon then cook veggies in some a the bacon drippings then put carrots ,onions ,celery and chilis in crockpot with chicken broth add potatoes and corn and cook on low about 6 hrs till potatoes tender then add the creamed corn, milk and cream.\nand cook about 1/2 hr and then add the cheese and let it melt into the soup .\nwe have it in bowls topped with the crumbled bacon even in hot weather with crockpot it doesnt heat up kitchen",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaryElizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2872456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-22T21:37:01.623Z",
                "reviewBody": "For such a short list of unassuming, everyday items, this recipe is outstanding!  Every cooks dream for a quick easy meal!!!  Helpful hints:  Use olive oil (better for you) in place of the margarine and \"simply\" diced potatoes with onions if you are pressed for time.  I used 1/2 and 1/2 and the country sausage gravy mix (as that's all I had).  Added corn that I had grilled during the summer and froze for stews and soups in the winter...  Wow, the smokey flavor using the frozen corn from the grill infused the soup with that little something extra chefs strive for!  On a side note:  I was rather skeptical of using the Mexican style Velvetta, but the creaminess of the cheese is what smoothed the flavor out and gave it the extra spice to keep it from being bland...  Simply wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-23T19:22:37.76Z",
                "reviewBody": "delicious! here's how to lighten the recipe up a bit if you are trying to eat healthy: extra virgin olive oil rather than margarine, skim milk, chicken gravy mix rather than the country style gravy mix and 2% velveeta in place of the real thing. the soup still tasted rich and delicious! other modifications i made include adding one can of cream style corn and a dash of cayenne pepper and tobasco sauce. a very satisfying soup that i will be making again and again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sjwRN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1498212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-28T20:50:01.997Z",
                "reviewBody": "This is one of my new favorite recipes from this website.  I have been looking for a corn chowder similiar to a local restaurant and now I have found it!  I made the following changes:  I omitted the chilies, cut down on the onion, added two cans of corn & one can of cream corn and used 1 cup of milk with 1 cup of heavy cream.  At the last minute I threw in some shredded chicken breast from a rotisserie chicken from the grocery store (it still would have been good without that) I also used Yukon Gold potatoes in this recipe.  This was to die for!  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANI80",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-31T03:06:42.417Z",
                "reviewBody": "This is DELICIOUS.  It looks unassuming but it has a bite to it.  This recipe makes a ton, so be careful.  I doubled the recipe so that I could have leftovers, but I would have had plenty of leftovers with the original.  I made a few changes. I thinly sliced 8oz of bacon and cooked it in the soup pot with a little olive oil until crispy.  I removed the bacon and set it aside. (Use it as a garnish later!) Then, I added the butter and the onions and celery.  You could leave out the olive oil, but olive oil has a much higher burning point and adds some stability as well as some nice flavor.  Other than that, I added two cups of diced carrots to the potatoes, subbed half of the milk with half-and-half, 1 can of corn and 2 cans of cream-style corn, and I used 1 cup Pepper Jack (instead of chiles or velveeta, yuck!) and 1 cup of Mex-mix cheese. I also added some shredded, cooked chicken in with the cheese. Be careful with the spices. I tasted it when I checked the potatoes and it was a little bland. The Jack will add the kick it needs, so don't worry.  I used low sodium, low fat chicken broth because I cook for people with different preferences in saltiness.  If you use low sodium broth, you WILL need to add salt.  A few notes: Don't use the gravy that has 'sausage bits' unless you're using a slow-cooker-it takes them a while to reconstitute.  This recipe freezes very nicely. Defrost in the fridge the day before eating.  It separates some before it freezes so reheat it on the stove",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAMCHES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-09T23:42:23.077Z",
                "reviewBody": "This chowder is GREAT!! I followed the directions pretty closely which I normally don't do. The only thing I changed: I substituted ham broth/ soup base for the chicken broth and I added real bacon bits along w/ chopt green onions to the top!I didn't have the mexi velveeta so I used the regular kind. I like another reviewer wasn't sure I wanted to use processed cheese but it was great!!! My whole family loved it-which seldom happens!! I will keep coming back to this recipe. It is easy to make changes according to what you have on hand!!! Thank you for sharing! Cheryl",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/302291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-17T00:22:02.413Z",
                "reviewBody": "This is absolutly amazing. I made this soup for a head chef at a fancy steakhouse and he was so impressed. I used a little extra cheese (be careful it will get too salty if you add too much) added some bacon and grilled the corn (which i TOTALLY recommend nothing beats that flavor!) and added a few extra peppers in there because we love spicy food and it went perfect. I served it with a salad and homemade garlic bread. nobody could move afterwards it was so exellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carlaKK9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2208231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T13:42:01.563Z",
                "reviewBody": "This was very good soup. My 6 year old loved it. It makes quite a bit but we enjoyed the leftovers the next night (and for lunch the following day). I added a can of creamed corn which seemed to work well. Since I don't normally cook with velveeta I just used shredded sharp cheddar which I already had on hand. I used a package of simply potatoes with diced onions instead of the potatoes and onion. I will cook them a little longer though next time. They weren't quite as done as I would have liked- my fault as I was trying to hurry dinner along. I also added some diced ham to make it a more complete meal. We like having meat in our soup but next time I might try grilled chicken as the ham did make the soup a little saltier than I would have liked. Definitely a recipe I will keep and use again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CTCOOK1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1224726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-27T14:13:22.7Z",
                "reviewBody": "This is the most awesome recipe!!!! I make this and I ALWAYS have to make triple batches. I also have a vegetarian friend and so I will use veggie broth instead of the chicken broth and you can not tell the difference. This is one incredible soup. Love it! Thanks for sharing this one. This has been handed down to my kids as well.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "love-always / Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1678004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-14T00:26:20.143Z",
                "reviewBody": "The gravy made this too rich and detracted from the overall flavor. I would make a roux instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8606777/"
                }
            }
        ]
    }
]