[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7070/injera/",
        "name": "Injera",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F651532.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-23T10:41:43.000Z",
        "description": "This is the staple bread of Ethiopia. It is traditionally made with teff, a very finely milled millet flour. Regular millet flour from a health food store will work fine. Use this bread to sop up the flavors of spicy stews.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P1DT0H20M",
        "recipeYield": "14 very small loaves",
        "recipeIngredient": [
            "1 tablespoon active dry yeast",
            "1 teaspoon honey",
            "5 cups warm water (110 degrees F/45 degrees C)",
            "3 cups finely ground millet flour",
            "¼ teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast and honey in 1/4 cup of the water. Allow to proof and add the remainder of the water and the millet flour. Stir until smooth and then cover. Allow to stand at room temperature for 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the batter well and mix in the baking soda.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large non-stick skillet over medium heat. Pour about 1/3 cup of the batter into the pan in a spiral pattern to cover the bottom of the pan evenly. Tilt the pan to quickly even out the batter. Cover the pan and allow to cook for about 1 minute. The bread should not brown but rather rise slightly and very easy to remove. It is cooked only on one side. This top should be slightly moist. Remove to a platter and cool. Stack the cooked breads on a plate.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.064516129032258,
            "ratingCount": 31,
            "itemReviewed": "Injera",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "166.1 calories",
            "carbohydrateContent": "32 g",
            "cholesterolContent": null,
            "fatContent": "1.8 g",
            "fiberContent": "3.8 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "27.6 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-04-25T10:50:38.937Z",
                "reviewBody": "Injera is a a little tricky, but once you get the hang of it, it's easy.  You pan HAS to be at the perfect temperature or else ANY injera will stick.  It is designed to be laid flat on a plate and piled high with a thick stew.  It has a bland taste and a spongey texture, which make it perfect for soaking up rich stews.  You actually use it instead of utensils.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/58833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T18:56:32.127Z",
                "reviewBody": "Authentic recipe & preparation. Injera is tricky to make, but practice makes perfect. Injera is a sourdough flatbread- that's why the dough sits for 24hrs, for the sourdough fermentation process. It is cooked only on one side; the uncooked side stays spongy & soft. And for 'accidentalfoodie': You are correct that teff and millet aren't the same grain. But you are incorrect in that BOTH are gluten-free. Gluten by definition is the protein in wheat. There is no gluten in either millet or teff. Teff is the world's smallest grain- technically a grass, native to east Africa. It can range widely in colors, is very high in fiber & protein, and has a sweety/nutty flavor. Teff is often assumed to be sour, as many recipes/preparations partially or fully ferment the grain (as is the case with this recipe, where it basically becomes sourdough). Millet is a name of a family of grains (also grasses) native to India and central/west Africa. They grow very well in arid regions, have a pearl-like grain, and are mild in flavor and high in protein. Toasting the grain before cooking or grinding for flour can improve the taste. Teff is sometimes considered to be a millet grain (a member of the millet family), but in the US, what is sold as \"millet flour\" is from a different plant than teff flour. Use real teff flour if you can find it-- it will give a more complex/robust taste than millet flour, which is usually pretty bland. But either one will work fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "annaship",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4598282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-12T07:40:28.807Z",
                "reviewBody": "Loved this recipe. This bread is not intended to be eaten alone. Injera is used to pick up your food. Think of it as the ethiopian version of chop-stix! The spongy bread takes on the flavor of the food you are eating. Try it with Atar Allecha or Ginger veggies! I will hold onto this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennie Jennings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503608/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-17T18:06:12.927Z",
                "reviewBody": "This recipe is authentic. Yes Injera does take a little while to get down correctly but it is worth it. For those who aren't familiar with the spongey (yes it really does feel and taste spongey) bread it is supposed to be bland. Traditionally the sponge bread is used in place of silverware to eat stews curries and things like pickled cabbage. There is even etiquette for eating Ethiopian food (when eating you have to take care to not place your fingers inside your mouth) So yes the bread is bland but you don't just eat the bread. Please keep in mind that if you make Injera you will also need to make other dishes to eat with the bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kiwi-Veggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5376156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:44:12.14Z",
                "reviewBody": "I tried this recipe with teff flour and was totally unimpressed. My \"bread\" stuck to my non-stick pan and was impossible to remove in one piece. I greased the non-stick pan... still stuck. I added an egg to the batter to hopefully get something that would stick together (like a crepe). It was finally possible to remove but I found the flavor bland and lifeless. Not a recipe I'd try again. (However the teff flour made a fine addition in my focaccia bread.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LISAAJSF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/637644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T16:26:11.603Z",
                "reviewBody": "Teff and millet are not actually the same grain: Millet for one thing is gluten-free while teff has gluten. So cooking with millet may be one reason this recipe hasn't worked out because gluten gives dough elasticity and makes it rise better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AccidentalFoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2365154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-10T13:24:18.103Z",
                "reviewBody": "I followed this recipe to a tee (I had to guess that step 1 meant to mix yeast in 1/4 cup of millet add 1/4 cup of warm water and let sit for 10 mins). I wanted to make a couple breads that night so I took about 3 cups of the batter out and added an egg about 1/2 tsp baking soda and 1/2 cup of spelt flour (maybe a bit more). I cooked this batter as I would a crepe and the taste and texture was great for the stew I had with the bread. I left the rest of the batter to sit for 24 hours. When I tried to cook the rest of it the following night it just did not work and the taste was awful. Again I added 2 eggs and about 2 cups of spelt flour and this thickened up the batter and allowed me to cook them (it takes a while for them to cook so wait until the bottom is fully brown and flip them to brown other side). Even after all this I still did not really like the taste but my boyfriend did. My advice: If you try this recipe and get the same results that I did try adding some flour and eggs to the batter so that you don t have to waste it. I also recommend halving the recipe since after adding the flour and eggs it made at least 10 large breads.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "chickremedy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1725914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-20T17:52:21.257Z",
                "reviewBody": "this recipe was a distaster! it the batter seperated out overnight and was extremely thin. after trying a variety of techniques never got one pancake with this recipe. we're finding that other more traditional recipes discourage the use of stone ground flour (such as the millet flour recommended here). teff seems to be the only one that will work and if you can't find it whole wheat flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "timbo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2908256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T22:12:22.277Z",
                "reviewBody": "Corrected first step.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            }
        ]
    }
]