[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13358/beef-stew-iv/",
        "name": "Beef Stew IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3720.jpg",
            "width": 2304,
            "height": 1536
        },
        "datePublished": "1999-01-25T00:29:32.000Z",
        "description": "Old time favorite",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pound cubed <a href=\"https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/\" aria-label=\"beef stew\">beef stew</a> meat",
            "3 tablespoons all-purpose flour",
            "3 tablespoons shortening",
            "1 teaspoon salt",
            "⅛ teaspoon ground black pepper",
            "4 cups water",
            "1 onion, finely diced",
            "¼ teaspoon paprika",
            "1 clove garlic, minced",
            "1 teaspoon Worcestershire sauce",
            "1 bay leaf",
            "3 carrots, quartered",
            "3 potatoes, peeled and quartered",
            "¼ cup all-purpose flour",
            "½ cup frozen corn kernels"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dredge beef in flour and then, in a medium stock pot, brown beef on all sides in shortening.  Add salt, pepper, water, onion, paprika, garlic, Worcestershire sauce and bay leave.  Bring to a boil, cover and simmer for 2 hours or until meat is tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add carrots and potatoes and simmer for 45 minutes or until tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove bay leave and meat from stew, add 1 tablespoon flour or cornstarch and mix, in order to thicken stew.  After mixing let sit for a few minutes to thicken, if not to desired thickness add more flour or cornstarch and repeat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once thickened return meat and add corn to stew, heat through and serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joanne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.427835051546392,
            "ratingCount": 388,
            "itemReviewed": "Beef Stew IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "395.1 calories",
            "carbohydrateContent": "33.5 g",
            "cholesterolContent": "50.6 mg",
            "fatContent": "21.3 g",
            "fiberContent": "4.1 g",
            "proteinContent": "17.8 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "468 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-03T23:54:45.263Z",
                "reviewBody": "I'm rating this based on the recipe as it's written. It's awful lol. However it is 100% salvagable. Definately substitute the water with beef broth (I did two cans of vegetable broth and two beef) I added an additional cup of merlot 3 bay leaves and some thyme. Rather than simmer in the oven I transfered the meat to the crockpot after had browned it. Also I added some fresh minced garlic to the meat while is was browing and it was great. By cooking in the crockpot I found that by the time I added the potatoes and let them cook for a good hour or so the starch from them thickened up the stew just right. I added salt and pepper to taste and a little more garlic the last 30 minutes or so and it was really good. But this definately needed some doctoring up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T02:47:25.45Z",
                "reviewBody": "The best beef stew we've ever had! I've made many stews so I know what we like and dislike in it. I omitted the worchestire sauce because it just overpowers the other flavors and we really don't care for it. I used 1/2 water & 1/2 beef broth. I also seasoned the meat/flour with blk pepper seasoning salt garlic powder paprika and onion powder then saved the leftover flour to thicken the stew with. After browning the meat I added enough water and scraped up the bits on the bottom of the pan for added flavor then added all the broth & water onions and celery. For added flavor I added thyme rosemary extra bay leaf and extra seasonings. I suggest when you cut up the beef potatoes and carrots try to make them all the same sizes and not so big. At the last hr added the veggies corn & peas and last minute added the leftover seasoned flour (which was mixed w/h20 so it doesn't get lumpy when added to the hot stew). Served this with french bread and everyone loved it! This will now be our staple beef stew. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-06T15:56:01.51Z",
                "reviewBody": "I've been making this recipe for several years, and it is great as is, but I always tweak recipes because my hubby and I love dishes with lots of flavor.  I add cumin, garlic powder, fresh ground pepper, and paprika to the flour before dredging the beef.  Instead of shortening, I use butter and olive oil.  I also substitute 2 beef bouillion cubes for the salt and add 1/4 C ketchup, 1 tsp oregano, and an extra bay leaf.  This is a perfect fall or winter meal with homemade bread...definitely one of my favorite comfort foods!  This can easily be made in the crockpot so it can be ready when you come home from work.  Just brown the beef before adding to the crockpot, add all the rest of the ingredients, and cook on low for 6 hours. Before serving, add the 1/4 C flour paste and heat on high for 15 min to thicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T02:20:51.73Z",
                "reviewBody": "I started making this back several years ago and usually make it at least once a month. It is a great base for a stew but it definitely needs alot of flavor added to it. For added flavor and also for thickening purposes....try it this way and I am sure you will not be dissapointed. When the meet is browned and you have added all the basic things such as your water...onions..garlic etc....let it simmer for about 15 minutes and then try adding.....a few tablespoons each of ketchup...barbecue sauce...A-1 sauce...and chili sauce. Also add some extra worstershire sauce and a tablespoon or so of sugar. I know...it may sound a little strange but believe me...you will love the results! When all that is added...let simmer for about 45 minutes and then add your vegetables and simmer until tender. Do it just this way and I guarantee you that will continue to from now on. The flavors are amazing and it makes this a very satisfying meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNAINNC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-06T01:23:24.827Z",
                "reviewBody": "This was great...my husband loved it but I did use some variations. First I dredged the stew meat in flour season salt pepper and paprika then I browed it in a pan with olive oil and minced garlic. I added 4 cups of water but also added \"Better than Base\" which is basically a beef boullion. Everything else is pretty much the same with the exception of adding corn I substituted celery. It was great but next time I'm not adding worcestershire sauce and also watch how long you cook the meat I cooked it a little too long and it started to fall apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1514807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-19T00:20:55.153Z",
                "reviewBody": "This stew is indeed great! It doesnt need the long cooking time to get the desired flavour as well. All it took was an hour and a half. I didnt use shortening. replaced it with normal oil. My boyfriend loves it. I made extra and he brought it to work today and his co-workers tried it and they all think that it is great. Somehow it tasted better when you leave it over night. My suggestion is cook it the day before you want to eat it and store it in the fridge overnight. You will be pleasantly surprised!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARINAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T16:17:14.327Z",
                "reviewBody": "This is THE BEST beef stew recipe. It's a staple at our house- I make it at least two or three times a month! I did change a few things (mostly on advice from other reviewers). I add two cans of diced tomatoes and two cans of beef broth instead of the water skip the corn and paprika and double the worcestershire sauce. I also add 1 tsp of parsley and 1/8 tsp of red pepper for a little kick. Sometimes I add a can of garbanzo beans and a can of italian green beans too. Gives it lots of flavor and texture. Yum! And perfect for this cold weather!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TESSERYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-19T21:42:10.793Z",
                "reviewBody": "Awesome Stew Joanne! This was oh-so-good! I changed the recipe a little by omitting the corn and adding 2 chopped celery stalks. Also instead of adding 4 cups water I added 6 cups water seasoned with 4 beef bouillon cubes. This made a wonderfully seasoned stew! I will DEFINITELY be making this one again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sourfleed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/682948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-19T18:34:03.84Z",
                "reviewBody": "Thank you so much! I have tried several recipes in an attempt to obtain the same great stew a friend of mine had made. This was excellent! My husband was very impressed. I followed the recipe with the following changes: 2 lbs meat 6 cups water 6 beef bouilon cubes used vegetable oil instead of shortening no salt no bay leaf no corn added 1 stalk celery & 1 teas rosemary. I mixed 6 tbls cornstarch with 6 tbls water & added it to stew & got the perfect consistency of \"old fashioned stew\". I made this last night & had to have some of the leftovers for breakfast this a.m. & I usually don't eat any breakfast. Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHAYNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/301392/"
                }
            }
        ]
    }
]