[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9435/almond-crunch/",
        "name": "Almond Crunch",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F889617.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-27T20:09:04.000Z",
        "description": "I am begged for this recipe whenever I serve it.  My advice: Invest in a good candy thermometer and always, always, always use good ingredients. Do not use margarine as a substitute for the butter; the water content is too high.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "2 pounds",
        "recipeIngredient": [
            "1 cup blanched slivered almonds",
            "1 cup butter",
            "1 ¼ cups white sugar",
            "2 tablespoons light corn syrup",
            "2 tablespoons water",
            "2 cups milk chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Arrange almonds in a single layer on a baking sheet. Toast in the preheated oven until lightly browned, approximately 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a jelly roll pan with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy saucepan, combine butter, sugar, corn syrup, and water. Cook over medium heat, stirring constantly, until mixture boils. Boil, without stirring, to hard crack stage, 300 degrees F (150 degrees C). Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working quickly, stir in almonds, and pour mixture into foil lined jelly roll pan; tip pan from side to side to spread candy evenly in pan. Sprinkle chocolate chips over candy brittle. Let stand about 5 minutes, or until shiny and soft. Spread chocolate evenly over candy. Cool to room temperature, then refrigerate for 1 hour. Break into bite-size pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Heather Walker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.72027972027972,
            "ratingCount": 143,
            "itemReviewed": "Almond Crunch",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "316.6 calories",
            "carbohydrateContent": "32.6 g",
            "cholesterolContent": "35.1 mg",
            "fatContent": "21 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "84.1 mg",
            "sugarContent": "28.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-24T02:53:43.717Z",
                "reviewBody": "This is superb. A couple of suggestions: (1) Add 1 teaspoon of salt to the mixture at the beginning - it cuts down on the sweetness; (2) When the mixture comes to a boil reduce the heat one notch from medium and stir occasionally - I've had no problem with a burned taste; (3) As others have said buy a good candy thermometer - I purchased a digital candy thermometer from Williams Sonoma and love it; (4) Use a silicon spoon to stir the mixture - it wont stick to the spoon; (5) Put the jelly roll pan covered with aluminum foil or Release on one side of the stove and turn on the buners to medium low. When the mixture is poured onto the hot pan the pan stays hot and the mixture is easy to spread. Use the back of a large spoon sprayed with Pam to spread the mixture; (6)I've tried the almonds per the recipe toasted walnuts unsalted roasted peanuts and toasted pecans. My favorite is the toasted pecans. I use 1 1/2 cups of toasted pecans in the mixture and sprinkle 1/2 cup toasted pecans on the top; (7) I've used milk chocolate a mixture of milk chocolate with peanut butter chips (when I used the peanuts) semisweet chocolate and bittersweet chocolate. They all work well. It's a matter of taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C2KING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T13:34:39.827Z",
                "reviewBody": "I love this recipe! Made 20 lbs this year as gifts. Couple of hints: The new \"Release Foil\" is much easier to get off than regular. I double the recipe (but just use 1 regular-size bag of milk chocolate) and use the bottom of a broiler pan. Don't accidentally use semi-sweet! I prefer sliced almonds and crush a few over the chocolate before it hardens to make it prettier. BIG tip: I've ruined a few pans over the years making this. I'm not a chemist but the candy still tastes great and my pans are not scorched if I stir it constantly even after it boils. In fact when I have NOT stirred it it tastes burned. It's inconvenient to stand there stirring but worth it to me. I also HIGHLY suggest getting a good thermometer! This year I made it on a cold day and set the pans out on the screened-in porch so didn't have to mess with rotating through refrigerators! Yum Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHOLICMOMMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/236338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-28T16:28:03.077Z",
                "reviewBody": "Almond crunch is fantastic and very addictive! It is very easy to make and is delicious. One thing I would recommend is to extend the foil over at least two ends of the jelly roll pan before you pour in the crunch because when you tilt the pan to spread it around the foil just kind of moves with it. This is going to be my holiday gift for the neighbors this year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kiki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-26T22:13:10.42Z",
                "reviewBody": "FANTASTIC!! This was my first attempt at making candy and it was so easy. I brought it to a party and all my friends LOVED it!! I enjoyed it so much I made a second batch just for myself. Tip: I placed the roasted almonds on the jelly roll pan and poured the toffee over them instead of mixing the almonds into the toffee. After I break it into pieces I keep the candy in the fridge so the chocolate stays firm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAJORSKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T00:48:40.28Z",
                "reviewBody": "Yum! This recipe has an addictive caramel-flavored crunch and is an interesting alternative to peanut brittle. In fact I like it better because it's crunchy without being too hard. To avoid burning (which is what I almost did on my first try) start out with your burner at a medium-low setting and increase the heat as needed to reach the right temperature.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T02:36:36.403Z",
                "reviewBody": "Made this for Christmas and everyone loved it. I made it twice and found that 300 degrees was a bit too much in the heavy pot I used. The second time I made it I cooked to only 295 degrees and it turned out better. Guess you need to watch it closely when it nears the right temperature. VERY GOOD! Everyone wanted the recipe just as you had said!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OVERLAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-23T16:09:45.247Z",
                "reviewBody": "I've made this recipe (3) times in the past week the results were interesting 1st time - wrong size pan inaccurate candy thermometer and the plastic mixing spoon began to melt. 1st batch in the garbage. 2nd batch - awesome - 3rd batch - nuts not toasted long enough so it tasted gummy and when I poured the mixture in the lined pan it began to harden before I could spread it to the sides. When this recipes works the taste is fantastic - when it doesn't it really doesn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mariatarp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/471046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-30T14:33:24.42Z",
                "reviewBody": "Incredible! My husband loves it so much that he had me make gifts of it for 15 people at work for Christmas! The only thing I would change about the original recipe is to stir the mixture frequently after it boils. The first time I made it I did not stir it after it began to boil...but it burned (my husband still ate the entire batch). I halved the amount of chocolate chips on top and the amount of chocolate was fine. I agree with another reviewer who suggested to put sliced almonds on top of the chocolate (and press down lightly with a spatula so they stick better). It made the presentation much prettier. Thank you - this recipe will be a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy Dale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-02T13:45:01.903Z",
                "reviewBody": "Very good and easy. Read the other reviews and heating the jelly roll pan was a great idea. Spread quickly with a pan-sprayed spoon. Just a thinner toffee I think makes a better candy. I also stirred slightly after it came to a boil and it didn't affect the end result. I don't know that I would have been able to keep it from sticking to the bottom of the pan if I hadn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "keycook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/624632/"
                }
            }
        ]
    }
]