[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7063/amish-friendship-bread-starter/",
        "name": "Amish Friendship Bread Starter",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F676554.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-28T16:40:50.000Z",
        "description": "Make something special to share with a friend! This delicious starter can make a variety of breads. Do not use metal containers or utensils.",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P9DT0H40M",
        "recipeYield": "4 cups of starter",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "¼ cup warm water (110 degrees F/45 degrees C)",
            "3 cups all-purpose flour, divided",
            "3 cups white sugar, divided",
            "3 cups milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast in water. Let stand 10 minutes. In a 2 quart container glass, plastic or ceramic container, combine 1 cup flour and 1 cup sugar. Mix thoroughly or flour will lump when milk is added. Slowly stir in 1 cup milk and dissolved yeast mixture. Cover loosely and let stand until bubbly. Consider this day 1 of the 10 day cycle. Leave loosely covered at room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On days 2 through 4; stir starter with a spoon. Day 5; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Days 6 through 9; stir only.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Day 10; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Remove 1 cup to make your first bread, give 2 cups to friends along with this recipe, and your favorite Amish Bread recipe. Store the remaining 1 cup starter in a container in the refrigerator, or begin the 10 day process over again (beginning with step 2).\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GINNY LEE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.699751861042183,
            "ratingCount": 403,
            "itemReviewed": "Amish Friendship Bread Starter",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "33.9 calories",
            "carbohydrateContent": "7.7 g",
            "cholesterolContent": "0.5 mg",
            "fatContent": "0.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "2.6 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-14T21:02:24.527Z",
                "reviewBody": "I love this bread, but always run out of people to give the starter too.  This last time I froze them.  I took one out and just let it sit for the 10 days, not adding the extra 3 cups on the 5th or 10th day, I just stirred it each day.  Then on the 10th day I followed the rest of the recipe and the bread turned out wonderful, no difference and I don't have to find 3 people to give a starter too.  Thought this might help anyone trying to find a friend to share with or if your friends all say no.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "juliamom42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-04T20:25:51.15Z",
                "reviewBody": "If you read up on sourdoughs and starters, you'll find that one of the reasons people mess with them is the health benefit of the natural occuring yeasts.  Unfortunately, most people these days have become too \"domesticated\", and so can't see how letting something go sour on its own can be any good.  Thus, most \"official\" starter recipes call for addition of store bought yeast.  In the authentic way, you start with one cup each of flour, milk and sugar, stir it every day for the first 4 days, add one cup each of flour, milk and sugar on day 5, stir well; stir it every day for the next 4 days; add one cup each of flour, milk and sugar on day 10, stir well - and you should be ready to use the starter.  Traditional recipes ask to only use wooden or plastic bowls/jars/utensils.  This is done because there is a possibility of the yeast's acidity acting on the metal and changing PH and messing everything up.  The other important point to make, is that when you're making the starter, it should be left uncovered or covered loosely with cheese cloth or such.  The starter needs airflow!  Once ready, the starter could be kept in the fridge for about 2 weeks; to reactivate it, take it out and feed it with one cup each of flour, milk and sugar, stir well and leave at room temperature.  I think that starter can be covered with a lid/kept in a zip-lock bag while refridgerated.  For those who want to have their starter always available - keep it at room temperature, stir it every day, and fe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Olga",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2655988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-15T03:58:17.06Z",
                "reviewBody": "I'm just curious what happens if you forget to add the ingredients on the specified day or does the batter go bad if you don't bake the batter in 10 days.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2205994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T21:59:44.197Z",
                "reviewBody": "THIS IS THE RECIPE/NOTES THAT I GOT WITH THE BREAD THAT WAS PASSED TO ME AND IT'S QUITE DIFFERENT SO I'M CURIOUS HOW MUCH IT MATTERS???\nPlease note the following:\nDo not use any type of metal spoon or bowl.\nDo not refrigerate.\nIf air gets into the bag, let it out.\nIt is normal for the batter to rise and ferment.\n\n Day 1: Do nothing, this is the day you receive the batter. The bag is dated.\n Day 2: Mash the bag\n Day 3: Mash the bag\n Day 4: Mash the bag\n Day 5: Mash the bag\n Day 6: Add to the bag :1 C. flour  1 C. sugar and 1 C. cold milk.  Mash the bag.\n Day 7: Mash the bag\n Day 8: Mash the bag\n Day 9: Mash the bag\n Day 10: Follow the directions below:\n \n 1. Pour the entire contents of the bag into a Non Metal Bowl.\n 2. Add 1 1/2 C. flour, 1 1/2 C. of sugar, 1 1/2 C. of milk\n 3. Measure out 4 separate batters (1 cup each) into 4 Ziplock (1 gallon bags). \n Keep a starter bag for yourself and give 3 to friends with a copy of the recipe.\n Note: If you keep a starter for yourself you will be baking every 10 days.\n\nBaking Instructions:\n 1. Preheat the oven to 325 degrees.\n 2. To the remaining batter in the bowl add:\n  \n 3 eggs\n 1 cup of oil\n 1/2 cup of milk\n 1 cup of sugar\n 2 tsp. of cinnamon\n 1/2 tsp. of vanilla\n 1 1/2 tsp. of baking powder\n 1/2 tsp. of baking soda\n 1/2 tsp. of salt\n 2 cups of flour\n 2 small boxes of pudding\n (optional) 1 cup of chopped nuts, raisins, dried fruit or chocolate chips\n\n 3. Grease 2 large loaf pans(may need 3 medium sized loaf pans)\n 4. Mix into separ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Ann Claudio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1640571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T03:22:21.64Z",
                "reviewBody": "I use to keep my starter in plastic bags but read somewhere that the starter needs AIR to grow...makes sense.  So I picked up a couple of glass jars (8cups) with glass lids (that have the removable plastic thingy on them to keep it air tight)...well I took OFF the plastic thingy to allow are IN.  The Starter is on Day 6 and is growing and bubbly like I have NEVER had it before...must be the little bit of air.  My instructions say DO NOT USE METAL to stir...I use the handle part (with a hole in it) from a plastic ladle...you can use anything when you're baking on day 10.  I also keep 1 cup for my next starter batch and cook a DOUBLE recipe of the same cakes using about 2 cups of starter for each recipe.  Works out great! This is a great beginner/experimenting/use what you have on the shelf kinda recipe.  Wrap extra cakes (LOL if there's any left) in waxed paper, then in foil, then place in plastic bags in the freezer...they last for months!  In all the years I've made it...I've never had any complaints.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JustMe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2386017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-05T21:54:47.817Z",
                "reviewBody": "Help! Im on day 2 of the started and my mix is no longer making bubbles. I've followed everything exactly and cant figure out why i have no progress with bubbles. Is something wrong should i pitch the mix and start over? help please!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "knkiesgen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2391850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T04:44:26.373Z",
                "reviewBody": "Sounds great but I need some answers before getting started .... if after 10 days you are going to start over with 1 cup of the starter (stir day 2-4, add ingredients day 5 etc) do you leave this 1 cup of starter at room temperature or follow the steps and leave it in the refrigerator? And how long will the starter store in the refrigerator before you need to stir it, use it or freeze it? As a newbie sourdough maker I thank you for any advice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SOCAL REINER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/963945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T12:48:43.83Z",
                "reviewBody": "I made some Amish Friendship bread when I was 13 years old and I loved it. I was very happy to find a started recipe and now I have a question. I added the sugar, flour, and milk on the 6th day and my bag is no longer making bubbles. Did I do something wrong or is this normal. Before I added it the bag was fermenting and making bubbles and now it has stopped. I would appreciate any help. Thank You",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2213425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-30T02:43:02.72Z",
                "reviewBody": "yummo: what happens if you do use a metal bowl or spoon? Just curious because the person that gave me the starter kit did use a metal bowl on hers and they both turned out fine. Does anyone know why it says that? Metal is supposed to kill the yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "emily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2383450/"
                }
            }
        ]
    }
]