[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2409/desserts/pies/custard-and-cream-pies/key-lime-pie/",
                    "name": "Key Lime Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12528/key-lime-pie-vi/",
        "name": "Key Lime Pie VI",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F452530.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-01-30T11:08:25.000Z",
        "description": "A Key Lime Pie made without sweetened condensed milk. It really enhances the flavor of the lime.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9 inch pie",
        "recipeIngredient": [
            "1 cup white sugar",
            "¼ cup all-purpose flour",
            "3 tablespoons cornstarch",
            "¼ teaspoon salt",
            "2 cups water",
            "3 eggs",
            "1 tablespoon butter",
            "¼ cup key lime juice",
            "1 tablespoon grated lime zest",
            "1 (9 inch) pie crust, baked",
            "¼ teaspoon cream of tartar",
            "6 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the eggs. Beat the egg yolks and set the whites aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the 1 cup white sugar, flour, cornstarch and salt in a saucepan. Gradually stir in the water. Cook over medium heat until thickened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gradually stir the cooked sugar mixture into the beaten egg yolks, beating constantly. Return the mixture to low heat and cook, stirring constantly, for 2 minutes. Stir in the butter, lime juice and lime zest. Let mixture cool slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg whites until light and frothy. Add the cream of tartar and continue beating until stiff peaks form. Gradually beat in the remaining 6 tablespoons white sugar and beat until the meringue is stiff and glossy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the lime filling into the prepared pie shell. Then pile the meringue on top, spreading it until it touches the edges of the pastry to prevent the meringue from shrinking. Bake pie at 425 degrees F (220 degrees C) for 5 to 6 minutes or until meringue top is golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Key Lime Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JACLYN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.256756756756757,
            "ratingCount": 74,
            "itemReviewed": "Key Lime Pie VI",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.8 calories",
            "carbohydrateContent": "48.9 g",
            "cholesterolContent": "73.6 mg",
            "fatContent": "8.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "211.7 mg",
            "sugarContent": "35.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-26T17:19:01.11Z",
                "reviewBody": "Okay, first of all, it's true that the use of water instead of condensed milk really enhances the flavour of the lime.  But what I can't understand is why the recipe states to add the lime juice after the rest of the filling is cooked.  In my case, the filling was nice and thick up until this point, but the lime juice diluted it so much that it was like soup when I poured it into the pie shell, foolishly hoping that a brief stint in the oven would help it set.  Well, it never set, even after a  night in the refrigerator.  But I hate to waste, so the next day, I poured out the filling, reheated it with a little more flour until it got thick, then poured it back into the pie shell and baked it again.  This time it came out beautiful and perfectly set, even without refrigeration.  So I would definitely recommend this recipe - just don't do what I did and pour in the filling unless it is thick enough to form ribbons when stirred.  If it is too soupy, add more flour or cook it a little longer, but don't hope for it to set up in the oven, because it won't!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAZZMATAZZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-28T14:36:24.09Z",
                "reviewBody": "ohhhhhlaaalaaaah! This was to die for. I had never made a key lime pie before found a lovely and fragrant bunch of them on sale so decided to buy and give it a whirl. This was outstanding! Stood up so nicely was not soupy cut into nice slices and sooo creamy. I think the flour is the key to creaminess. The only mods. I made were to add more lime zest and used 1/2 cup of key lime juice and cut the water accordingly. I also used lime-essence water instead. The lime water is great if you can find it. I get it at CVS drugstore in the dollar aisle! It is simply bottled water with a faint essence of lime. This recipe is a keeper. I used the french pastry pie crust from this site and it all turned out so nicely. remember to keep egg whites at room temp when making meringue and make sure that beaters and bowl are free from any oil or fat or meringue will not set up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-17T04:39:55.32Z",
                "reviewBody": "Came out great everyone loved it. Very simple and easy to understand. Just need to remember to let the mixture boil completely to activate the corn starch. I realized my mistake before it was too late and everything turned out delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2493572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-18T16:49:12.807Z",
                "reviewBody": "I made this pie for my parents who are crazy about key lime pie. This pie came out beautiful and delicious and everyone RAVED! It has the perfect balance of sweet and tart and it s so full of key lime flavor. I had never made anything with key limes before this pie and I was surprised with how small key limes are so I had no idea how many I would need to get the amount of juice and zest needed for this recipe. The limes I used were cherry tomato-sized. It took about 7 limes (1/4 lb.) to get cup juice and an additional 3 limes (10 total) to get the 1 Tbsp. zest. I think the trick to getting the pie to set up after adding the juice and butter is to bring it back up to a boil. I also stirred the mixture a couple of times while it cooled in the pan a little before pouring into the crust. I used a graham cracker crust (brushed with an egg wash and prebaked at 375 for 5 minutes) and the meringue turned out lovely as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-11T04:42:23.77Z",
                "reviewBody": "Thank you so much for sharing this! My grandmother is from Key West and has very strict requirements in order for a pie to be considered a \"real\" Key Lime Pie - it must have a traditional pastry crust instead of graham cracker it must have meringue - not whipped cream and it should be yellow never green! This recipe meets all the the requirements and is exactly like the ones my Gramma has always made! So excited to share this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Morris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3296897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-18T17:23:48.217Z",
                "reviewBody": "I thought this was great; a very pure and clear flavour as it's not combined with the condensed milk. I will admit however that I made a few changes for my own preferences. I like a graham cracker crust so I used this instead of a plain baked shell. And I don't like meringue no matter HOW it is made so I omitted the meringue from my pie. Over all an easy to follow recipe with excellent results and with a low cost.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Jayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2078192/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T19:24:11.577Z",
                "reviewBody": "This recipe is excellent. I've made it many times and now also use it for lemon meringue pies (substituting the same amount of lemon juice and zest for the lime). I especially like it that no condensed milk is required so the fruit taste really stands out--cheaper and healthier without the condensed milk too. Also this meringue recipe is better than the one I used to make--simpler and never fails. Two tips: Make sure the filling doesn't look thin before you add it to the pie shell. If it does look thin cook it a little longer at a slightly higher temperature until it has a pudding-like consistency. Second make sure you clean your beaters thoroughly before doing the meringue and see that they're cool. I put mine in the fridge (along with the bowl and utensils) until it's time to use them. You can also make the meringue first so that you don't have to clean the beaters etc. before you use them to do the egg yolks. (If your kitchen is warm put the bowl of meringue in the fridge until it's time to top the pie.) Anyway thanks very much Jack for this great recipe. Can't wait to try it for orange pineapple and other fruit-juice pies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T02:36:06.03Z",
                "reviewBody": "While the taste was good it wasn't 'wow'. The directions were great though and the lime layer came out perfectly and cut really well. I think both the lime and the meringue needed more sugar to give a bit of a kick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hannah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-21T21:31:31.347Z",
                "reviewBody": "I tried this recipe twice. I used a flaky tart crust both times to keep it from being too sweet. I also used bottled lime juice both times and think fresh would have been better. The first time I followed the recipe and found I needed extra corn starch to thicken after adding the lime juice. It was also SO sweet that I threw it out and made a second one. The second time I used 1.5c water and 1c lime juice plus added a half tablespoon extra corn starch in the beginning and it was MUCH better. I also made fresh whipped cream instead of the meringue as it was still very sweet. I guess in the end I just don't like my deserts sickly sweet even with a zing of lime. Here's a picture prior to the whipped cream!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4902457/"
                }
            }
        ]
    }
]