[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/837/desserts/cookies/biscotti/",
                    "name": "Biscotti Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10158/chocolate-cherry-biscotti/",
        "name": "Chocolate Cherry Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5400.jpg",
            "width": 3296,
            "height": 2256
        },
        "datePublished": "1997-11-22T12:55:36.000Z",
        "description": "These are one of my favorites. I make them every holiday season. They are great for mailing and keep for weeks!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "½ cup butter, softened",
            "¾ cup white sugar",
            "3 eggs",
            "2 teaspoons almond extract",
            "3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ cup chopped candied cherries",
            "½ cup mini semi-sweet chocolate chips",
            "½ cup chopped white chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a large cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the almond extract. Combine the flour and baking powder; stir into the creamed mixture until just blended. Mix in candied cherries and mini chocolate chips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With lightly floured hands, shape dough into two 10 inch long loaves. Place rolls 5 inches apart on the prepared cookie sheet; flatten each to 3 inch width.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes, or until set and light golden brown. Cool 10 minutes. Using a serrated knife, cut loaves diagonally into 1/2 inch slices.  Arrange slices cut side down on ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes, or until bottoms begin to brown. Turn, and bake an additional 5 minutes, or until browned and crisp. Cool completely. Melt white chocolate in the microwave, stirring every 20 to 30 seconds until smooth. Drizzle cookies with melted white chocolate. Store in tightly covered container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Biscotti Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer Wall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.662068965517242,
            "ratingCount": 145,
            "itemReviewed": "Chocolate Cherry Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "113.9 calories",
            "carbohydrateContent": "16.6 g",
            "cholesterolContent": "22.8 mg",
            "fatContent": "4.6 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "55.2 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-27T17:07:13.42Z",
                "reviewBody": "Wow! Wow! WOW! I just finished making 14 dozen of these for holiday gifts. Now I consider myself a good cook but far from a good baker. This was easy and unbelievably tasty! Made a few mods: I hand mixed in the flour and chips/cherries I didn't do the final 5 minute flip/bake and I made 7 dozen of them with cranberries (dried) and pecans (chopped) instead of the chocolate/cherry mixture. Also instead of using the white chocolate I drizzled vanilla almond bark (half dyed red half dyed green) over the cooled cookies. They're so pretty! Packaged in cellophane holiday gift bags (after wrapping cookies in waxed paper) and tied with a bow. Can't say it enough how much I HIGHLY RECOMMEND this recipe! Thanks so much for sharing! My gift recipients will thank you too!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Veggie_K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-26T17:25:34.64Z",
                "reviewBody": "Used dried cherries instead of candied. I wraped the dough in plastic and chilled.Shapeing the dough into logs while still in the plastic made it simple and had no mess. Stood cookies upright for second baking and reduced cooking time in half works great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T16:43:19.99Z",
                "reviewBody": "I would give these a 10 if I could. There were absolutely amazing. They were a nice compromise between the \"orginial\" biscotti (which had no fat other than eggs) and the buttery, cookie-like biscotti that most recipes produce. The biscotti cut well without crumbling (which was a problem with many other recipes), they puffed up perfectly, and they store nicely as well--everything you could want in a biscotti recipe! I made a few small changes: I halved the recipe, and cut back the butter by 1 tablespoon (so in the original, I would have used about 1/3 instead of 1/2 cup). I also added about 1/4 cup of toasted, flaked coconut, and I used cashews (out of almonds) instead. At the end, I melted 1/2 cup of white chocolate with a dab of butter and dipped the cooled biscotti in it.\r\n\r\nA few notes for anyone trying this recipe: I found that it might be helpful to drop the oven temperature to 250-300 after the first baking, since the outside of my biscotti was browning a little faster than it was crisping. Also, I did not grease my pan after the first baking (as suggested in the recipe), and though I had no problems with my non-stick pan, the biscotti on my other baking pan did stick a little bit. Overall, this is a great recipe, and one that I would use over and over again in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AURYANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T04:32:49.217Z",
                "reviewBody": "The biscotti are good but I have a few mentions - #1 when I printed the recipe it had no oven temperature #2 It calls for 1/2 cup white confectioners coating - and in step 7 it says to Drizzle cookies with melted white choc - Confectioners coating & white choc are not the same thing. If your out buying ingredients by those listed you wouldn't have the white choc to melt! Oh and just so you know - If you want two batches make them seperate and do not double the recipe - They don't turn out as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DLMAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-31T18:17:31.72Z",
                "reviewBody": "This recipe was very simple and quite tasty. Great cookie for dunking! I know a lot of people have complained about not being able to \"drizzle\" the white chocolate as it never seems to get thin enough in the microwave. I used white chocolate chips and put them in the microwave for about 30 seconds on 50% power...stirred...then did another 20 seconds. The chocolate was actually warm not too hot to handle. So at that point I spooned the melted chocolate into a small ziploc bag and snipped off a very small cut from the corner. I was then easily able to squeeze and pipe the chocolate onto the biscotti. Made it so easy! You can see the result from the photo I just uploaded.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nowanorris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1599825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-27T05:37:28.967Z",
                "reviewBody": "My biscotti turned out perfect following this recipe. They were absolutely delicious. For those of you that said your biscotti crumbled make sure you cut while they are still warm (7-10 minutes after taking out of oven). The key is also using a good quality serrated (bread) knife to cut. If you do this and follow the recipe directions your biscotti should not crumble. I agree with others that commented you don't need to cook that long after you flip. You just need to dry them out a little more. You can even turn down the heat in the oven. Great recipe! Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1NIKI1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1362561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-11T14:40:44.453Z",
                "reviewBody": "These were difficult to work with -- even with a serrated bread knife. They crumble and consequently they're hard to do at a full 10\" size. Nevertheless they look lovely and people love receiving them as a gift. They are softer than other recipes because of their butter. If you prefer a firmer crispier biscotti for dunking look for recipes where egg is the only fat in the ingredients list. As for candied cherries those are the little syrupy cherries that are sold in small round tubs. They're usually with the seasonal baking stuff--you would find them wherever you find those tubs of chopped fruit that people use in fruitcakes. The only difference is that the fruitcake mix is multicolored and includes pineapple and candied citrus peel (which I never liked as a kid). But basically it's the same thing. You could probably get away with using marachino cherries but the candied cherries are \"waxier\" and have less moisture. However they are brighter and moister than dried cherries/cranberries. The chocolate and cherries make this recipes pricey to pull off--but like I said it looks great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHAMMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-27T23:34:53.8Z",
                "reviewBody": "I loved this biscotti recipe. The texture was just like I want...not hard as a brick and doesn't fall apart in my coffee. The cherry/chocolate combination is always delicious but I'm sure I'll make it again with other ingredients for a change. I gave some away as gifts and kept the rest for myself. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bev Miller Johnstone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/237963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T00:51:38.2Z",
                "reviewBody": "These are soooo good! Sometimes for Christmas I substitute peppermint extract for the almond and it gives these biscotti a nice flavor. Makes them especially good with hot cocoa!! I make these every year for Christmas gatherings & gifts and they are always well-received. Thanks for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T20:34:18.267Z",
                "reviewBody": "I've been making biscotti for 20 yrs. but this recipe crumbled when I tried to cut it. I'll bake for a shorter time if I try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "gina hinz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4334607/"
                }
            }
        ]
    }
]