[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15490/desserts/cakes/cake-mix-cakes/yellow-cake/",
                    "name": "Yellow Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8151/rave-reviews-coconut-cake/",
        "name": "Rave Reviews Coconut Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F15642.jpg",
            "width": 3024,
            "height": 2016
        },
        "datePublished": "1999-02-01T22:49:46.000Z",
        "description": "A wonderful moist coconut cake perfect for birthday parties. Walnuts and pecans are interchangeable in this recipe.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -8 or 9 inch layer cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "1 (3.5 ounce) package instant vanilla pudding mix",
            "1 ⅓ cups water",
            "4 eggs",
            "¼ cup vegetable oil",
            "2 cups flaked coconut",
            "1 cup chopped walnuts",
            "4 tablespoons butter",
            "2 cups flaked coconut",
            "2 teaspoons milk",
            "3 ½ cups confectioners' sugar",
            "½ teaspoon vanilla extract",
            "1 (8 ounce) package cream cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 8 or 9 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend the cake mix, pudding mix, water, eggs and oil in a large mixing bowl. Beat at medium speed for 4 minutes. Stir in 2 cups of the coconut and the chopped walnuts. Pour the batter into the prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 35 minutes. Let cakes cool in pans for 15 minutes then remove and finish cooling on rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting: Melt the butter or margarine in a skillet. Add the 2 cups flaked coconut and stir constantly over low heat until golden brown. Spread coconut on absorbent paper to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream the remaining 2 tablespoons butter or margarine with the cream cheese. Add the milk and confectioners' sugar alternately, beating well. Add the vanilla and stir in 1 3/4 cups of the toasted coconut.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Assemble Cake: Spread tops  of cooled cake layers with some of the frosting. Stack them and then frost the sides of the cake. Sprinkle Cake with the remaining toasted coconut.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Yellow Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Glenda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.627272727272727,
            "ratingCount": 110,
            "itemReviewed": "Rave Reviews Coconut Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "692.5 calories",
            "carbohydrateContent": "90.9 g",
            "cholesterolContent": "93.6 mg",
            "fatContent": "34.9 g",
            "fiberContent": "3.6 g",
            "proteinContent": "7.7 g",
            "saturatedFatContent": "15.5 g",
            "servingSize": null,
            "sodiumContent": "577.5 mg",
            "sugarContent": "68.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-15T23:58:08.247Z",
                "reviewBody": "Good but there's an error in the recipe.  The first step that uses butter should say to melt only half the butter to fry the coconut - it doesn't say that but later says use the remaining butter.  Don't mess up this step otherwise you'll have really greasy coconut.  I had to drain mine twice on papertowels.  Otherwise, it was good.  The frosting didn't make as much as I would have liked so I'd double the frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LILYP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1193979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T18:13:03.827Z",
                "reviewBody": "Sorry to have to give this recipe its first bad review...there must be something REALLY wrong with one or more of the ingredient measurements or the amount of time to bake. Both the cake and the frosting were a disaster. I only deviated from the recipe in that I omitted the nuts. The cake was nowhere near fully baked after 35 minutes - I had to put it in again for about another 20 minutes at least...and then it was super crumbly. I think there was too much egg in the batter. The frosting was impossible to spread smoothly which made the crumbly cake fall apart even more! In hindsight this is not too surprising - there is not much of anything moist added to the cream cheese in order to give it a cake-frosting consistency. I am not a novice baker so I probably should have followed my instincts a little more but I guess I was fooled by all the glowing reviews this recipe recieved. No one said they changed anything. I have a hard time believing that following this recipe exactly could yield a good cake...anyway there are a lot of other coconut cake recipes out there so next time I'll try a different one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "YASAMIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-03T23:17:59.263Z",
                "reviewBody": "This cake is very good!! But... I did make a couple of changes. I used 3 Jumbo eggs 1/3 cup oil and omitted the walnuts. I toasted the coconut in a 350 degree oven for about 10 mins before adding to the cake mixture. Also a couple of points the recipe does not point out.... The 4 Tbsp. of butter is divided 2 Tbsp for the toasting of the frosting coconut & 2 Tbsp for mixing in the frosting itself. I used 2 round non-stick dark cake pans and one regular round cake pan. The non-stick dark layers were a bit overdone at 30 MINUTES and the regular pan was perfect. So be sure to watch your cakes closely as 35 mins seemed too long when you are dividing the cake mix into 3 round cake pans. As for the frosting it's very yummy but I had to add 1/2 a can of vanilla frosting to make enough for the whole cake. Next time I will 1 1/2 the recipe! You will not be disappointed just be sure to watch your baking time!! YUMMY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISCOOKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/895058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-29T19:06:06Z",
                "reviewBody": "This cake is wonderful! I substituted coconut cream pudding mix for the vanilla and coco loco coconut milk for one cup of the water. I actually forgot to add the vegetable oil. It was so delicious. I don't care for coconut much but the toasted coconut was wonderful! My niece said it was the best cake she'd ever eaten.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEXASREDTOP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T23:44:59.823Z",
                "reviewBody": "I scaled this recipe down (from the original 12 to 9) which was the perfect amount to make 12 standard size cupcakes. I baked them at 350 for 20 to 25 minutes and they turned out great - just make sure to bake until the tops are dry although the cake will seem firm when the top is still sticky. I'm a pastry chef and I work for a cupcake exclusive bakery in Austin TX so I suppose this is kind of my specialty. As for the cake mix if you don't have a box of cake mix then you can always make your own using \"Cake Mixes from Scratch\" recipe on this site. Half of that recipe will be just enough. As for the icing it is absolutely divine but it needs to be refrigerated for 10-15 minutes before you use it. Toasting the coconut was a lot less complicated that it's made out to be. I put it on medium heat and just kept the coconut moving the entire time and then I poured it out of the pan onto a paper plate with some napkins. Make sure your cakes are completely cooled before you try to ice them as cream cheese icing is notorious for melting easily. If you get impatient then just throw them in the fridge for a while like I did - you definitely do NOT have to worry about these drying out. I think the pudding is really the key to all the great moisture but it makes the texture a bit heavier than a regular cake. Either way it's a wonderful recipe and a great deviation from the standard variety of cakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chrysaea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2356598/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-16T05:26:16.86Z",
                "reviewBody": "Amazing cake but as others have said not near enough icing. I doubled it the second time I made it and it was gobbled up! Even my husband who fussed that he \"didn't really like coconut\" ate more than anyone else. Just be sure to double the icing because the recipe will NOT give you enough for 3 layers...even if you are stingy with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn in Texas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2330369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:47:54.77Z",
                "reviewBody": "This is moist and flavorful. And like its name always gets rave reviews. I make this cake occasionally for special functions. Most recently I served it at a baby shower using Pineapple Filling (on this site from Traci Poole) between the layers. Yummy. Thanks for bringing this great cake to the forefront Glenda!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T01:19:29.793Z",
                "reviewBody": "I made this cake for my two grandkids for Easter. They loved it. I decorated some of the coconut green for the top layer and added chocolate candy eggs jelly beans etc. I also filled between the layers with the Pineapple Filling found on this site. With doing this there was plenty of frosting. The cake was really good but OMG the frosting was wonderful. Please - like others have stated - divide the 4 tablespoons of butter. Two tablespoons for cake and the other two for toasting the coconut. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beverly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10595742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-11T14:52:39.64Z",
                "reviewBody": "I needed to make a coconut cake for a hawaiian-themed dinner with some friends and this turned out wonderful. Everyone absolutely loved it! I basically followed the recipe except for a few minor changes. I used pecans instead of walnuts and I added some a bit of crushed pineapple to the batter. I used a 9 x 13 in. glass pan. Also I made sure to mix the everything for at least 4 mins so the pudding mix would thicken. I did have to bake it for more than 30 mins - maybe 35-40. The frosting was delicious and the toasted coconut was the perfect final touch. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "emilindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1807787/"
                }
            }
        ]
    }
]