[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11780/easy-chicken-tetrazzini/",
        "name": "Easy Chicken Tetrazzini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3332203.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "1999-02-03T19:45:37.000Z",
        "description": "A delicious recipe given to me by my sister, Ruth Clark. This is a favorite with my kids and their friends. The recipe is easy to double.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound cooked and drained spaghetti",
            "5 chicken breasts, cooked and cubed",
            "2 (10.75 ounce) cans  condensed cream of chicken soup",
            "2 ¼ cups water",
            "¼ cup butter",
            "2 cubes  chicken bouillon",
            "¼ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Put cooked spaghetti into 9x13-inch baking dish. Place chicken on top of spaghetti.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In medium saucepan heat together soup, water, butter, and bouillon. Bring to a boil and then pour over the pasta and chicken. Put shredded cheese (to taste) on top and press down a bit.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marian Collins"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.343112244897959,
            "ratingCount": 784,
            "itemReviewed": "Easy Chicken Tetrazzini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "473.1 calories",
            "carbohydrateContent": "48.2 g",
            "cholesterolContent": "76.8 mg",
            "fatContent": "17.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "29.2 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "898.3 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-04T17:06:55.933Z",
                "reviewBody": "My new favorite!!! I used a whole fryer, reserving ALL of the broth and straining it. Many other reviewers said to add 1 cream of chicken and 1 cream of mushroom soup, and that's what I did. I also used chicken broth instead of water for the saucepan mixture. I also added 1/4 tsp. garlic powder and 1/4 tsp onion powder, and I salted and peppered to taste as well. I boiled Angel Hair pasta 16 oz. in the remaining chicken broth, It made ALL the difference in the world! I used a Kroger brand cheese, they have a wonderful medium sharp cheddar, yum! To top off the cheese I sprinkled a little Progresso Italian style bread crumbs over all(another reviewersuggestion). I think you could lay some broccoli, or some other green on top of pasta and pour chicken mixture on top of that and have a one dish meal. I also think I remember that from another reviewer, thanks. The recipe I had was SO bland, but not this one, full of flavor! Oh, and I did put in mushrooms and it was wonderful!!! Thanks so much for the new addition to my recipe box. I am not a creative cook that throws in a pinch of this and a little of that, I cook strictly from recipies 80% of the time, so these reviews from everyone really help me. Thank you to EVERYONE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TeensyNeesie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2128308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-28T20:32:28.423Z",
                "reviewBody": "After reading the reviews I realized what a great base recipe Marion has provided.  You add or delete to your personal preference.  I like to cut my chicken breast into cubes while frozen since it's easier to cut and it makes less mess and let them thaw in fridge.  I added lemon pepper, garlic powder, a little salt and fresh ground black pepper to ziplock bag with chicken and tossed to coat.  I used one tbsp of butter and 2 tbsp of olive oil and sauteed chicken till just about cooked through.  In place of the bouillon and water I also used low sodium chicken broth.  I used 1 can of cream of mushroom and 1 can of cream of chicken 99% fat free since I only had one can of each on hand.  I also diced up a small onion and added one can of mushrooms.  This turned out really good so thanks again Marion for a recipe that can be tweaked to everyones preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking 101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1793893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-09T00:09:08.567Z",
                "reviewBody": "This was the best chicken tetrazzini I've ever had!  I used boneless skinless chicken breast, cut into small pieces and seasoned with lemon juice, paprika, rosemary, thyme, oregano, minced garlic, and black pepper.  I also used whole wheat spaghetti, and one can cream of chicken and one cream of celery.  Preparing the soup according to the directions, I was worried that the dish would be too liquidy, but it was perfect.  SO flavorful and good!  As other reviewers have noted, it might be a little bland if you prepare it as written, without customizing with your favorite spices.  For me, the seasonings I used in baking the chicken worked out perfectly for seasoning the tetrazzini.  This is a recipe I'll definitely make again.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zekele",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-02T10:45:58.707Z",
                "reviewBody": "Like others, I used 1 can Cream of Mushroom, 1 can Cream of Chicken and 1 3/4 cups of the broth from boiling the chicken, also added 1 1/2 teaspoons of chicken soup base.  To the soup mixture I added 1 small can of sliced mushrooms, 1/2 bag frozen peas, 2 TBS butter, about a teaspoon of garlic salt, 1 1/2 teaspoon of black pepper, some seasoning salt, and about a tablespoon of dried parsley.  Cooked the soup mixture to heat then then added the cooked spaghetti right into the pot to mix.  Poured all into a baking dish - - topped with cheddar cheese and baked. I also took others advice to add buttered ritz cracker crumbs to the top - - I did this in the last 10 minutes of baking.  Overall turned out good - - You really need to dress this one up a bit - - I think it would be pretty plain without the extras.  My boys didn't like the cheddar cheese on top because it got a little hard -- next time maybe I'll mix the shredded cheese into the noodle mix before baking?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Chiocca Kirsch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/155214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T20:04:20.56Z",
                "reviewBody": "Slight variations: use egg noodles or corkscrew pasta in place of the spaghetti (it holds the sauce better), you really only need to use one bullion cube (lowers the sodium in this recipe drastically! still great flavor), DO NOT USE LOW FAT OR FAT FREE SOUP! ( DOES NOT MAKE FOR CREAMY CONSISTENCY).Mix cheddar cheese w/ 1/4 cup (or more if you like) Italian flavored bread cumbs for crunchy browned topping!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Victoria Ganann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-02T20:41:51.493Z",
                "reviewBody": "Just a request to the very kind ladies (or men) who take the time to write reviews that change (or augment) the recipes. We rookies that cook for out ladies (my case) often copy these recipes. In my case, I almost always copy half a dozen of your comments along with the recipes to help me improve the dish…and it usually works out great. So my hat’s off to you. So when you say that you’ve added “herbs,” please write what herbs you have added or in other words be specific as to what you have done. You can’t imagine how helpful your comments are to guys like me lacking your years of experience with this. Thanks again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Subroutine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4907963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T14:20:05.733Z",
                "reviewBody": "Very good and wow! It makes alot (as others have warned)! I used fettucini noodles (broken in half) b/c I'm all out of spaghetti and the first thing I thought this dish needed was a little color from some veggies. When melting the butter (B4 adding the soups) I added some fresh/sliced mushrooms some chopped celery minced onion and some chopped green bell pepper. I sauted them for a few min until soft and then added the soup. Also I used 2c water and added 1/4c white wine. Finally when mixing it all together I added a jar of diced pimentos and a little more sharp cheddar cheese. Very basic recipe that allows you to easily add/subtract and the result was very tasty! Thanks Marian!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T04:31:35.507Z",
                "reviewBody": "I gave this a 5 because it was sooo good and so simple to make. I did add some onion, garlic,red pepper and broccoli to the chicken when cooking to make it healthier, and also some spices as well.  Instead of water I added chicken broth. It was very tasty and not bland at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAZZZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/642113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-26T01:59:01.217Z",
                "reviewBody": "AWESOME RECIPE! HUSBAND SEASONED WATER W/SEASONED SALT PEPPER GARLIC POWDER AND ONION POWDER THEN BOILED CHICKEN. I USED THE SAME WATER TO BOIL THE NOODLES. REALLY KICKED UP THE FLAVOR. ALSO USED 98% FAT FREE SOUP FOR A LIGHTER RECIPE. ONLY 6 WW POINTS PER SERVING.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLLEHEW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1359418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T17:52:22.907Z",
                "reviewBody": "This was pretty good. Rating recipe as is...I did alot to spruce it up which means this recipe isn't all that great. Im scared to know what it would take like without all the seasoning I added. After it was all said and done my husband said it was good just needed some pepper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erica Awotwi Clay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2527689/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy Chicken Tetrazzini",
            "description": "See how to make Easy Chicken Tetrazzini.",
            "uploadDate": "2012-10-17T00:44:11.718Z",
            "duration": "PT4M16.465S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbe01baa7-1365-469a-aac2-79ade81b308b%2F86e60336-78d7-42d1-af61-ff6c80b07410%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1904892015001"
        }
    }
]