[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8149/flourless-chocolate-cake-i/",
        "name": "Flourless Chocolate Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F668993.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "1999-02-04T02:40:43.000Z",
        "description": "A dense chocolate cake for those of us who can't tolerate wheat or gluten.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -10 inch round cake",
        "recipeIngredient": [
            "½ cup water",
            "¼ teaspoon salt",
            "¾ cup white sugar",
            "18 (1 ounce) squares bittersweet chocolate",
            "1 cup unsalted butter",
            "6 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Grease one 10 inch round cake pan and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small saucepan over medium heat combine the water, salt and sugar. Stir until completely dissolved and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Either in the top half of a double boiler or in a microwave oven melt the bittersweet chocolate. Pour the chocolate into the bowl of an electric mixer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the butter into pieces and beat the butter into the chocolate, 1 piece at a time. Beat in the hot sugar-water. Slowly beat in the eggs, one at a time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the batter into the prepared pan. Have a pan larger than the cake pan ready, put the cake pan in the larger pan and fill the pan with boiling water halfway up the sides of the cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cake in the water bath at 300 degrees F (150 degrees C) for 45 minutes. The center will still look wet. Chill cake overnight in the pan. To unmold, dip the bottom of the cake pan in hot water for 10 seconds and invert onto a serving plate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maggie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.65406427221172,
            "ratingCount": 1058,
            "itemReviewed": "Flourless Chocolate Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "340.9 calories",
            "carbohydrateContent": "27.5 g",
            "cholesterolContent": "101.6 mg",
            "fatContent": "24 g",
            "fiberContent": "2.4 g",
            "proteinContent": "4.6 g",
            "saturatedFatContent": "14.4 g",
            "servingSize": null,
            "sodiumContent": "66 mg",
            "sugarContent": "23.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-10T20:27:28.107Z",
                "reviewBody": "This is a fantastic recipe for chocolate lovers.  I made this three different ways over the past holidays and here are my suggestions. I tried Baker’s, Nestle and Ghirardelli bittersweet chocolate. My guests preferred the Nestle brand the best. Just as good as Ghirardelli but at half the price.  For you mint lovers, for one cake I added ¾ tsp. of mint extract to the mix. Very nice and subtle result. The other reviewer advice I tried and agree with includes:  Eliminate 3 egg yolks and use 3 eggs and 3 egg whites; Use parchment paper in bottom of spring form pan. I sprayed the parchment and sides of the pan with PAM; Use a lot of heavy duty foil to seal the pan and keep the water bath out. By the third try, it was totally dry; Use Grand Marnier instead of the water. It’s pricey, but what the heck; Use a long very thin blade knife to cut the cake. Run it under hot water before each cut. This eliminated sticking. I made a raspberry sauce that I served on the plate but also put a small dab of whipped cream on each piece. “Nuked” each piece for 15 seconds before adding the cream and raspberry sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-02T17:48:39.827Z",
                "reviewBody": "This was wonderful.. the second time around. This may sound a bit moronic.. but the wording threw us the first time. We used 18 squares of chocolate, instead of 18 ozs. Ended up laughing about it, taking a picture and calling it \" Chocolate Passover Quiche 2005\". Personally.. I would take out the (1 ounce) and just say \" 18 ozs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-27T15:29:53.343Z",
                "reviewBody": " Wow! Definitely going in the mainstay - tried and true - file of my recipe book.     I'm a personal chef/caterer and last night I catered for a group of very well known classical musicians - beef tenderloin, fresh herb roasted vegetables and new potatoes, field green  salad, vermouth roasted shad, prosciutto pesto palmiers, macaroons, and this flourless chocolate cake. I had several marriage proposals, was approached in the kitchen for more of this cake, and was personally brought out and given a toast for the meal (but really the cake).  Are you sold? Follow the recipe exactly! I usually change things around - but there is NO NEED TO CHANGE A THING.  I used ghiradelli bittersweet chocolate chips (about a bag and 1/2 of 11.5 oz bags).  I wrapped my cake pan in foil for the water bath because I used a cheap spring form pan.  Amazingly, the cooking times and everything are perfect. DON'T CHANGE.  And a big thanks to Maggie. oh yeah - served with whipped cream (heavy whipping cream and a little powdered sugar) and fresh strawberries.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAUREN30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1226732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T18:28:44.98Z",
                "reviewBody": "Great!  I just got back from an office party where I made this for my boss, as she is allergic to wheat.  Every single person out of 10 people ate both the cake and the ice cream I served with it!  Like others have said, a little goes a long way.\n\nThings I didn't bother with: \n1) the water bath\n2) the wax paper\n3) the dunking the bottom in hot water before serving\n\nThese didn't make any difference at all. It still came out perfect.  I simply unsnapped the springform lock and voila, ready to cut.\n\nThings I did do:\n1) Followed others' suggestions of one bag of chocolate chips and 4 squares unsweet chocolate\n2) Used a springform 10.5 inch pan sprayed with Pam.\n3) Served it with vanilla ice cream\n4) Served it at room temperature  \n\nIt absolutely needed something like the ice cream to go with it.  I wished I had fresh whipped cream, it would have been better maybe.  But as it is, this recipe comes out like the moistest, richest brownie you've ever had.  So between the \"brownie\" and the ice cream, no one could refuse!  I don't think it would be good just by itself, as it needs the vanilla or cream to offset the richness so you're not overloaded with chocolate taste.  I don't think the caramel drizzle others have suggested would be good, as it is extremely sweet already.  Your call.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Womack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2036722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T20:26:32.903Z",
                "reviewBody": "This should not be considered just an alternate for those who can't handle gluten!  This is a spectacular, elegant, high end finish to the best of the best meals. You can delight SO many as you needn't(shouldn't) slice hearty portions. I used semisweet chocolate chips, and it was VERY GOOD, just cut back a bit on the sugar.A dusting of powdered sugar fresh raspberries and a sweetened sour cream garnish bring it up another level. Could CAUSE a celebration if there isn't one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEANNEBD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-24T21:33:05.137Z",
                "reviewBody": "Rich and delicious. I baked it it in small ramekins that were greased and dusted with cocoa powder. Cooking time was decreased by about 15 minutes. I poured blackberry sauce over the top and ate them straight from the ramekins. My guests couldn't finish theirs so I might make them even smaller next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "junglepeachpie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2128766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-27T04:18:02.39Z",
                "reviewBody": "People will think you spent hours making this wonderful dessert yet it's so easy. The only change I made was using fresh brewed espresso instead of water. It tasted like pudding when it was warm & like a truffle torte when it was cold. WOW!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNICKERPUSS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/447615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T17:10:24.253Z",
                "reviewBody": "Excellent flavor ! Tastes like a rich truffle cheesecake. Best when made the day before and chilled. Here are the changes I made to the recipe 1)Reduced the butter by 2 tbsp 2) Used 3 whole eggs and 3 egg whites 3) Used strong brewed coffee instead of the water 4) Used 12 ozs of Ghiradelli bittersweet (60% cocoa) chips and 6 ozs of Ghiradelli semisweet chips (but did not change the amount of sugar that the recipe asks for) 5) added vanilla essence. I used a 9\" round non-stick cake pan, and sprayed lots of Bake-Ease non-stick spray before I poured the batter in. I baked it at 300 F for 50 minutes, in a water bath. I allowed it to cool to room temperature on counter, and then flipped in onto a tray. I had no problems with the cake sticking to the pan, and I think this was because I used a non-stick pan. Decorated the cake with strawberry syrup (made from microwaved strawberry preserves), fresh cut strawberries and powdered sugar. I chilled this cake in the fridge for a whole day before I served it. Got rave reviews on it - \"Wow, this is better than what you get in top quality restaurants\", \"Tastes exactly like a truffle\", \"Absolutely delicious when eaten with the strawberries\". This is a rich cake (richer when you increase the proportion of bittersweet chocolate or coffee) that you need to serve with something fruity (like berries) to complement the taste. On the whole very impressive and tasty and not at all time consuming. Will make again many times ! :) ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shweta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2810994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T02:56:45.903Z",
                "reviewBody": "This cake was to die for.  Everyone thought it was so rich and incredible!  I think next time I will add 1/4 c. more sugar.  Thank you so much!  This is a keeper and so perfect for any special occasion.  The texture is amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDYEHALE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/572858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-16T06:37:24.687Z",
                "reviewBody": "Did I do something wrong?? My cake was grainy and lacked that smooth truffle-like texture. It also had a noticable fat layer at the bottom from the butter - ewwwww!\r\nI used a silicone cake pan with good results, as far as being able to remove the cake without a lot of the hassle of all those foil layers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAGELAU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1295062/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Flourless Chocolate Cake I",
            "description": "This dense chocolate cake is perfect for those who avoid flour or gluten.",
            "uploadDate": "2012-09-04T20:54:19.765Z",
            "duration": "PT2M57.344S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc3a5bcde-48ad-4018-af69-976f8de9acca%2F38ae764f-3bb7-4043-9adf-80445740fb3d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1822996897001"
        }
    }
]