[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8144/mardi-gras-king-cake/",
        "name": "Mardi Gras King Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5071873.jpg",
            "width": 1445,
            "height": 960
        },
        "datePublished": "1999-02-06T01:02:34.000Z",
        "description": "The King Cake is a New Orleans tradition that involves a pastry, a small plastic baby, and a party. The King Cake is baked with a small plastic baby hidden inside, the person who gets the slice with baby in it has to host the next party.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "2 cakes",
        "recipeIngredient": [
            "1 cup milk",
            "¼ cup butter",
            "2 (.25 ounce) packages active dry yeast",
            "⅔ cup warm water (110 degrees F/45 degrees C)",
            "½ cup white sugar",
            "2 eggs",
            "1 ½ teaspoons salt",
            "½ teaspoon freshly grated nutmeg",
            "5 ½ cups all-purpose flour",
            "1 cup packed brown sugar",
            "1 tablespoon ground cinnamon",
            "⅔ cup chopped pecans",
            "½ cup all-purpose flour",
            "½ cup raisins",
            "½ cup melted butter",
            "1 cup confectioners' sugar",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Scald milk, remove from heat and stir in 1/4 cup of butter. Allow mixture to cool to room temperature. In a large bowl, dissolve yeast in the warm water with 1 tablespoon of the white sugar. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When yeast mixture is bubbling, add the cooled milk mixture. Whisk in the eggs. Stir in the remaining white sugar, salt and nutmeg. Beat the flour into the milk/egg mixture 1 cup at a time. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth or plastic wrap and let rise in a warm place until doubled in volume, about 2 hours. When risen, punch down and divide dough in half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease 2 cookie sheets or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling: Combine the brown sugar, ground cinnamon, chopped pecans, 1/2 cup flour and 1/2 cup raisins. Pour 1/2 cup melted butter over the cinnamon mixture and mix until crumbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough halves out into large rectangles (approximately 10x16 inches or so). Sprinkle the filling evenly over the dough and roll up each half tightly like a jelly roll, beginning at the wide side. Bring the ends of each roll together to form 2 oval shaped rings. Place each ring on a prepared cookie sheet. With scissors make cuts 1/3 of the way through the rings at 1 inch intervals. Let rise in a warm spot until doubled in size, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes. Push the doll into the bottom of the cake. Frost while warm with the confectioners' sugar blended with 1 to 2 tablespoons of water.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.534526854219949,
            "ratingCount": 391,
            "itemReviewed": "Mardi Gras King Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "418.2 calories",
            "carbohydrateContent": "68.7 g",
            "cholesterolContent": "47.3 mg",
            "fatContent": "13.4 g",
            "fiberContent": "2.3 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "300.5 mg",
            "sugarContent": "30.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-03-09T18:37:55.293Z",
                "reviewBody": "Absolutely incredible.  I have made the cake twice and both times I cut the recipe in half.  I also substitute applesauce for the butter in the dough and add lots of raisins and prepare the dough using a bread maker (use extra milk instead of the water and just throw the ingredients in the bread maker according to its directions - I do liquids, then dry ingredients, and yeast last).  For the filling I also use applesauce instead of butter but add a little at a time to get a nice pasty filling that I can spread.  Before I bake the bread, I add an egg white wash so that it comes out golden brown.  I can not believe how delicious this cake is without using any butter.  No one believes me that it isn't full of oil and butter.  My favorite recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JNFAGAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-05T18:59:54.233Z",
                "reviewBody": "I am from New Orleans and find this to be a very authentic tasting recipe. I use my bread machine on the dough cycle thru step 3 and find it makes the recipe even easier.  It can also be filled with ready made pie fillings ie. lemon,cherry,apple which is another thing that is being done in New Orleans. Plastic babies can be gotten from party stores in the baby shower area.  thanks Jo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCBIANCO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/580308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-03T16:40:27.077Z",
                "reviewBody": "I made this for a Mardi Gras Party in French class, and everyone loved it!  If you leave out the plastic baby, it also makes a great breakfast bread!  I get requests for it all the time.  Tip:  If making it for breakfast, make most of the roll the night before, and let it rise the second time overnight.  Then simply pop it in the oven the next morning, glaze, and Voila!  A delicious breakfast bread.  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSEM1985",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/19276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-02T01:09:41.283Z",
                "reviewBody": "Better than bakeries! Living and eating in New Orleans for my entire life I was a bit skeptical if I could actually pull off a king cake.  I wanted to make mine a tad more traditional so I made the following modifications: 1. NO RAISINS in the filling- I have never (in my 20-something years of eating king cake) seen raisins in one.  I did make 1 and 1/2 times the filling too. 2. To first rise the dough I placed a mug of boiled water in the back of the microwave.  I then placed my covered bowl of dough in the Micro and shut the door for 2 hours.  The dough came out so fluffy.  I think this technique played a part in the pillowy softness and tender layers of the finished cake. 3. I opted for a elegant braided look.  Instead of just rolling the filling in a spiral I divided each rolled dough sheet into three sections.  I then scattered the filling on top and rolled those long pieces into mini-spirals.  I was then able to roll each segment out longer and finally braid the three sections together.  It looks so nice on a cross-section when sliced too! 4. I placed a ramekin in the center while the cake was rising the second time to prevent the middle of the cake from rising together- I wanted to keep the ring shape of it all. 5. Baked at 350 degrees for 27 minutes- worked perfect for my oven.  My general advice would be to bake until the top is evenly golden. 6. I ended up using the entire icing recipe on one of my cakes and I had to thin it with a bit more water than called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laur5270",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4527690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-06T13:17:22.25Z",
                "reviewBody": "My family loved this king cake .  I used a cream cheese filling also .  It turned out really good .  I used 2 blocks of cream cheese softened w/ 3 Tablespoons of flour , 2 teaspoons on vanilla and 2 Tablespoons of milk .  mix untill creamy and spread over other filling .  I think I will used stawberry and the cream cheese filling next time .",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicolle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2611044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-20T22:13:20.49Z",
                "reviewBody": "As a native Louisianaian, this is a great recipe with the following changes: 1) Leave out the raisens, 2)double the filling, 3)REDUCE the temperature to 335, and REDUCE the bake time to 27 minutes - the published time/temp will overbake, 4) generously brush the outside of the pastry with olive oil just before baking, 5)for the icing use 1 block of cream cheese, 1/2 stick butter, 1 teaspoon lemon juice, 1/4 cup  milk, and add powdered suger to the consistancy you like.  5) For best results use unbleached & unbrominated all purpose flour. 6)To leave a nice hole in the middle, use a 4\" diameter baking ring in the center.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "little_red8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4470524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-16T08:56:54.877Z",
                "reviewBody": "raisins in king cake???? yuck!  and for those who are interested, there is much more to the story of the baby in the cake.  although now many anticipate the the finder will host the next party, it was originally used to bestow the honor of royalty for the mardi gras balls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "little bear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2258212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T16:34:48.613Z",
                "reviewBody": "I made this last night for 15 hungry people at our poker night. I used the bread machine method (liquids first then solids with the yeast on top) and it worked great. For the filling I left out the raisins and for the frosting I used milk instead of water in the powdered sugar and just eyeballed it; it was more like 4-5 tbsp milk instead of 2 making the consistency easy to pour over the cake. I made my own purple sugar about 1/3 c sugar 3 drops red food coloring and 3 drops blue. If you do this I suggest mixing the food coloring together before adding it to the sugar and it takes quite a bit of stirring to break up the colored bits but it worked great. Tip: pour the colored sugar on RIGHT AFTER",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Johanna WISHES she were a",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1041860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-24T21:03:35.437Z",
                "reviewBody": "I was on a hunt to find a great King Cake recipe this past Mardi Gras.  I made a dozen of these and everyone absolutely LOVED them.  It is the easiest recipe (as far as King Cakes go) and the most authentic I found.  I had people originally from New Orleans saying it tasted just like home!  I shaped mine into a circle without the cuts and slathered the icing and stripes of yellow, purple, and green sugar - I also sat my babies on the top so that there wasn't an accidental choking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALSTONS4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13292/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mardi Gras King Cake",
            "description": "The famous New Orleans cake with the surprise inside!",
            "uploadDate": "2014-01-01T23:08:16.063Z",
            "duration": "PT7M12.849S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F25489e9e-07cd-4a23-a7b5-78be15fa8bd2%2F2068ccb2-6519-4c31-8aae-0ea08144e1e6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2998899940001"
        }
    }
]