[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11760/quick-gnocchi/",
        "name": "Quick Gnocchi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F454856.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "1999-02-09T01:10:21.000Z",
        "description": "An easier version of an Italian favorite, using instant mashed potatoes.  This recipe can easily be double, tripled, etc.  I make multiple batches, and freeze. To freeze, put on cookie sheets until frozen, and then put into plastic bags.  Serve with your favorite spaghetti sauce.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 cup dry potato flakes",
            "1 cup boiling water",
            "1 egg, beaten",
            "1 teaspoon salt",
            "⅛ teaspoon ground black pepper",
            "1 ½ cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place potato flakes in a medium-size bowl.  Pour in boiling water; stir until blended.  Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in egg, salt, and pepper.  Blend in enough flour to make a fairly stiff dough. Turn dough out on a well floured board.  Knead lightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half. Shape each half into a long thin roll, the thickness of a breadstick.  With a knife dipped in flour, cut into bite-size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a few gnocchi in boiling water. As the gnocchi rise to the top of the pot, remove them with a slotted spoon.  Repeat until all are cooked.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sandy Metzler"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.507186858316222,
            "ratingCount": 487,
            "itemReviewed": "Quick Gnocchi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "462.3 calories",
            "carbohydrateContent": "91.3 g",
            "cholesterolContent": "93 mg",
            "fatContent": "3.5 g",
            "fiberContent": "4.2 g",
            "proteinContent": "14.8 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "1224.6 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-17T17:20:50.983Z",
                "reviewBody": "I don't think this recipe is intended to replace real gnocchi, it's meant to be a GREAT short cut alternative! Hence the 5 star rating.  If it was being compared to real gnocchi, I'd probably only give it a 4.  I really was expecting to hate this recipe because I HATE instant mashed potatoes.  You would never know there was anything instant with these gnocchi.  On a whim I decided to serve Good Friday dinner, I was a little strapped for time and served these to my Italian husband and mother in law.  My husband knew what was in them and said they were not as good as the real thing, but very very close!  I didn't tell my mother in law, she had second helpings and liked them!  I would use this again!  It takes some time to prepare, but it saved time from peeling the potatoes, boiling, ricing, letting them cool so you can add eggs, etc.  As others have mentioned add flour gradually.  Dough should be soft not stiff.  Too much flour makes tough gnocchi.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EASYLYVIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1395812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-09T14:23:28.067Z",
                "reviewBody": "I grew up making gnocchi with my Italian grandmother and she would substitute instant potatoes sometimes. I never knew a good ratio though so I was so glad when I found this because with real potatoes is a lot of work when you have 2 year old twins. I will definitely be making this again. I didn't need as much flour as the recipe called for. It does get very sticky but that is how it should be. After you mix it all together into a dough, if you put it on a floured cookie sheet in the fridge for at least 15 minutes, it will make it a ton easier to work with. It will get stickier as it warms though. Also, if you roll them 1/2\"  thick, they will be less dumpling like as some people stated. I found this recipe to be extremely good and will definitely be making them again! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2766087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T04:36:14.793Z",
                "reviewBody": "Learn from my mistakes:  I didn't follow this recipe the first time, assuming the ratio of liquid to potato flakes on the box of instant potatoes was correct.. Big, big mistake.  Follow this recipe EXACTLY and the Gnocchi will turn out fabulously!  I did add some chopped spinach to the dough for color and a hint of flavor, and served it with a tomato-vodka-cream sauce.  My friends are still raving about it!!!!  Oh, let some people come early to help you roll and cut  the gnocchi pieces, it was a fun group task...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David Pinkus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/562480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T03:35:25.64Z",
                "reviewBody": "Wow!  Thank you so so much for this recipe.  We LOVE gnocchi, but had never considered making them at home (only restaurants and the occasional store bought).  I was looking for recipes that would freeze well and stumbled upon this one.  Excellent!  I did take the advice of another reviewer and seasoned with rosemary instead of pepper.  The rosemary flavor jumped out beautifully in the finished product.  I also added a bit of Romano cheese to the dough.  I couldn't taste it so it either needs more or should just be left out.  I want to emphasize that my husband is a food snob.  He has eaten at some of the finest restaurants in the U.S.  He never \"LOVES\" what I make.  It is always \"okay\" or \"fine.\"  A constant critic of gnocchi in restaurants, he loved this one!  I could see trying to make it a little lighter in texture, fiddling with flavors, etc, but this is a great base recipe to work with.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMATD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/205038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-29T18:52:26.763Z",
                "reviewBody": "Wow!  Gnocchi DOES NOT get any easier then this recipe!  I don't like instant spuds like everyone else, but you can't taste them in this recipe.  I agree they needed a little kick so I added some finely minced fresh basil, and garlic salt to the dough.  I also used the fork \"dent and pull\" method to set the ridge pattern in them. People say you should make those little indentations with a fork so that the sauce has something to cling to.  It did work and there were little puddles of sauce hidden in all the wrinkles.  YUM-O!  I'm thrilled the other rater mentioned they freeze well too! Another perk!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dung Beetle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T19:59:10.17Z",
                "reviewBody": "Can I just say WOW.  I never knew fresh gnocchi could be this easy.  Granted, dough is always a pain to work with, but this was very simple and took no time at all.  I recommend being heavy handed with seasonings and adding seasoning salt, garlic powder, rosemary and Italian seasoning to the dough.  As suggested by others, I would add some Romano next time myself.  And I would double this recipe if feeding another person, seeing as I ate the whole batch myself no problem!  They were delicious with a bottled Alfredo sauce!  Bon appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LILSPINSTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-31T21:00:55.717Z",
                "reviewBody": "This is a very good recipe for what it is.  Nothing is ever going to compare to real made-from-scratch gnocchi, but these come pretty darm close.  I'm excited to try some of the flavor variations that others have mentioned.  Just two notes:  Keeping the size of each dumpling quite small (about the size of your thumbnail or a bit bigger) will produce a better result.  Also, I didn't need anything even close to 1 1/2 c. of flour.  I doubt I used even half of that.  So, add the flour very slowly--too much will result in dense, tough gnocchi.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/374258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T21:37:18.537Z",
                "reviewBody": "after reading the stellar reviews i couldn't resist making this gnocchi recipe. overall i thought the taste was pretty good but my boyfriend loved them. cut the size of your gnocchi a little smaller because they puff up during the cooking process. this dish served well with the \"tomato cream sauce for pasta\" recipe also on this website. thanks sandy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIE30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1083034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-28T10:35:41.447Z",
                "reviewBody": "this recipe is very handy and lets you serve a dish of gnocchi in no time at all. Well so they are not THE real thing (believe me I know what I'm talking of I'm Italian my mum makes them starting from boiling potatoes an all). But this process is definitely quicker and not so messy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/93610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T01:14:23.01Z",
                "reviewBody": "I found this recipe labor intensive for what it was. Although we liked the gnocchi I wouldn't make this recipe again. First you can only make a few at a time so we did not really get to eat as a family. We have a local brand of frozen that are just as good or better. Sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baby Whisperer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739789/"
                }
            }
        ]
    }
]