[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12009/creamy-cajun-chicken-pasta/",
        "name": "Creamy Cajun Chicken Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F04%2Fimage-151.jpg",
            "width": 1280,
            "height": 720
        },
        "datePublished": "1999-02-20T00:27:56.000Z",
        "description": "Try this when you are feeling daring and want to mix things up a bit! A Southern inspired recipe that is sure to add a little fun to your dinner table. Try serving it with corn bread.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "4 ounces linguine pasta",
            "2 boneless, skinless chicken breast halves, sliced into thin strips",
            "2 teaspoons Cajun seasoning",
            "2 tablespoons butter",
            "1 green bell pepper, chopped",
            "½ red bell pepper, chopped",
            "4 fresh mushrooms, sliced",
            "1 green onion, minced",
            "1 ½ cups heavy cream",
            "¼ teaspoon dried basil",
            "¼ teaspoon lemon pepper",
            "¼ teaspoon salt",
            "⅛ teaspoon garlic powder",
            "⅛ teaspoon ground black pepper",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes, or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place chicken and Cajun seasoning in a bowl, and toss to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, saute chicken in butter until no longer pink and juices run clear, about 5 to 7 minutes. Add green and red bell peppers, sliced mushrooms and green onions; cook for 2 to 3 minutes. Reduce heat, and stir in heavy cream. Season the sauce with basil, lemon pepper, salt, garlic powder and ground black pepper, and heat through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, toss linguini with sauce. Sprinkle with grated Parmesan cheese.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tammy Schill"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.682165605095541,
            "ratingCount": 3140,
            "itemReviewed": "Creamy Cajun Chicken Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1109.2 calories",
            "carbohydrateContent": "53.7 g",
            "cholesterolContent": "347.9 mg",
            "fatContent": "82.2 g",
            "fiberContent": "4.4 g",
            "proteinContent": "42.7 g",
            "saturatedFatContent": "50 g",
            "servingSize": null,
            "sodiumContent": "1134.2 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-12-26T05:38:18.36Z",
                "reviewBody": "So I have now made this recipe a minimum of about 50 times.  It is our favorite recipe on this site, and my husband's absolute favorite meal.  Having made it so many times, I have tried every variation under the sun, and I have come up with what I think it the most flavorful method. Here are my suggestions:  1. Don't waste time chopping fresh peppers or paying the extra cost.  Buy the bagged frozen red, green, yellow pepper, and onion blend found in most brands.  You will not lose any flavor, and I promise you won't know the difference. 2. Heavy cream is best, but to cut calories 1/2 heavy cream and 1/2 ff half/half + 1-2 t. corn starch works, too. 3. Mushrooms aren't necessary, but use baby bellas if you do.  4.  Add more cajun seasoning.  This recipe doesn't call for nearly enough, but you will need to add strictly based upon your taste.  Once everything is added to the sauce, I taste it and keep adding until it tastes just right.  A little extra salt is usually required, as well.  5.  For the meat, I have found two variations that are PERFECT.  Our favorite is to use a rotissiere chicken from the  grocery deli.  Debone, add the meat to the sauce.  YUMMY.  We also like it with a pound of fresh shrimp. 6. Use  3/4 of a box of linguine. Four ounces? Crazy. UPDATE:  Many reviewers complain about the sauce being too thin for this recipe.  Just let the sauce simmer longer, or mix a little corn starch (a tsp.) with small amount of liquid (milk or water) & add it to the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VBHOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T17:19:10.497Z",
                "reviewBody": "very good.  i used the fat-free half and half with a little cornstarch to thicken.  it turned out great without the extra fat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LETTR6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T17:19:33.873Z",
                "reviewBody": "I originally saw this recipe in a Taste of Home issue from 1995.  This dish is served at the Monroe Street Grille in Tallahassee, Florida.  The manager provided the recipe to Taste of Home magazine. I made it and loved it! I made this dish when I was snowed in one day.  I substituted many things b/c I couldn't get to the store - I defrosted skinless/boneless chicken from a bulk freezer pack.  I used canned mushrooms instead of fresh, and I had to make my own cajun seasoning since I didn't have that either (1/2 tsp. garlic powder, 1 tsp pepper, 1/2 tsp. onion salt, 1/2 tsp. paprika, 1/2 tsp cayenne pepper to make 1 TBS Cajun seasoning).  I added Tobasco sauce and did need to add 1 tsp. flour to thicken the sauce.  I also omitted the green and red peppers and lemon-pepper seasoning, b/c, surprise! I didn't have those in the house either.  However, overall it was EXCELLENT and my fiance and I finished all of it.  I will definitely be making this again. Tasted just like Fettucini New Orleans that you can order in restaurants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEN78RN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-09T04:00:03.51Z",
                "reviewBody": "This recipe is quite good as written though I rarely make it due to the high calorie and fat content.  Once in a while, I'll suprise the family as a special treat as everyone likes it!  Couple of things could use improvement....  Use fresh minced garlic vs garlic powder ~ using fresh helps the recipe develop different levels of complexity beyond the Cajun seasoning.   Instead of green peppers, I usually substitute Anaheim, Pasilla or Hatch chili peppers when I can find them (Hatch chilis can be found in Hatch Valley, NM, and are wonderful).  I also increase the amount of Cajun seasoning to taste and add 1/2 tsp of onion powder.  The sauce is thin; good, but quite thin as many other reviewers have noted.  To avoid the thinness, make a roux using flour, butter and some of the sauce.  Please note:  It's important to let the roux cook down to a beautiful golden color before adding it back to the sauce otherwise you will taste the flour in it.  Thanks Tammy for the submission.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T22:19:47.857Z",
                "reviewBody": "this is sooooo good. this is the kind of food i crave and what i usually order at restaurants. i did make a few changes that would work well for the calorie conscious...first of all i used about a T of the cajun seasoning that my boyfriend makes (i think it is emeril's recipe from food tv). i sauteed the chicken in pam, removed from the pan, sauteeed about 1/2 - 3/4 c of mushrooms, 2 T of finely chopped onion, and 1/2 T of chopped garlic in pam also.  removed that. added about a tablespoon of butter to the pan and scraped up all the brown bits. added 1 T of flour and cooked a couple of minutes until thick. then i used a little more than a cup of fat free half and half. let it thicken, then i dumped everything back into the sauce, added one chopped roasted red pepper, and a deseeded and chopped tomato; i doubled all the seasonings. tossed this with pasta and it was spectacular. i know this isn't a particularly diet friendly recipe, even this way, but it sure beats the restaurants version of creamy pasta and i think it tastes even better. my boyfriend LOVED it and he hates cream sauces (he also has a huge aversion to low fat/fat free recipes, but he didn't know). This made about four servings. I think it would be wonderful in the summer w/ lots of fresh veggies. may add baby spinach next time or broccoli... thank you so much for this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLEYSALYER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-12T20:10:29.373Z",
                "reviewBody": "This is a great recipe.  I played a little with it by adding 1/2 cup white wine and some shrimp along with the chicken.  I also added extra cajon seasoning and Tabasco.  My husband loved it!  We will definately have this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINNYG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T17:19:46.327Z",
                "reviewBody": "Excellent! I did substitute fat free evaporated milk for the whipping cream and also added a little flour to thicken the mixture. The taste was wonderful even with this change.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY081101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T23:00:54Z",
                "reviewBody": "I'm really sick so I needed a quick dinner I could throw together with as little effort as possible. I added a little more cajun seasoning, used all red pepper (we don't care for green peppers), a small sliced yellow onion instead of one green onion, I added a few cloves of fresh minced garlic and I increased the basil, lemon pepper and garlic powder. This fed all three of us (the kids ate most of it with my not feeling so good) and the boys and I just loved it. Huge hit. I do think that it would not have been as good had I not increased the spices. Next time, I'll add more mushrooms. I think this would be good with some steamed or roasted broccoli tossed in for an \"all-in-one\" meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T12:27:05.42Z",
                "reviewBody": "I cook a lot and this recipe was very good. For me to rate something five stars the recipe has to be spectacular! I'm sure I'll make it again. Because of the comments about it being bland I did add more cajun seasoning and more cayanne pepper. We like spicy! I can't afford the calories so I used Land O Lakes Fat Free Half and Half and no one would know the difference. I use this in Alfredo sauce also. I thickened it with flour and water just like any gravy and it was wonderful. There are so many different cajun spice recipies and the spice would make all the difference in the world as to how bland or spicy your finished dish is. I looked for a spice recipe on line and made my own. I also tossed in a little broccoli at the end for some more color. Corn would also be good! I might try that next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNA1000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:55:53.890Z",
                "reviewBody": "I hate to be the one to give this recipe a bad review when there are so many great ones, but my family and I thought it was awful!  It was first of all very unappetizing to look at.  I used half and half like some of the reviews suggested and it was like we had pasta soup.  The peppers are barely cooked.  My son choked down a little and when my husband came in a little later he would'nt even touch it.  I did double the spices, but it just wasn't any good.  Please note that I've been cooking for years and years so I know how to follow a recipe.  I was just so surprized how yucky this was when there were so many great reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SGROS18737",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253910/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cajun Chicken Pasta",
            "description": "See how to make a creamy chicken sauté served over linguine.",
            "uploadDate": "2013-12-26T18:39:42.704Z",
            "duration": "PT2M52.005S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F49101a7e-e380-4d34-8071-11914e012a61%2Fb0378e6c-7797-439e-aa44-9676c2a0bf95%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2976322709001"
        }
    }
]