[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11729/american-lasagna/",
        "name": "American Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4458437.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "1999-02-21T22:33:41.000Z",
        "description": "Making this lasagna a day ahead and refrigerating overnight allows the spices to meld, and gives it exceptional flavor.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ pounds lean ground beef",
            "1 onion, chopped",
            "2 cloves garlic, minced",
            "1 tablespoon chopped fresh basil",
            "1 teaspoon dried oregano",
            "2 tablespoons brown sugar",
            "1 ½ teaspoons salt",
            "1 (29 ounce) can diced tomatoes",
            "2 (6 ounce) cans tomato paste",
            "12 dry lasagna noodles",
            "2 eggs, beaten",
            "1 pint part-skim ricotta cheese",
            "½ cup grated Parmesan cheese",
            "2 tablespoons dried parsley",
            "1 teaspoon salt",
            "1 pound mozzarella cheese, shredded",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium heat, brown ground beef, onion and garlic for 5 minutes; drain fat. Mix in basil, oregano, brown sugar, 1 1/2 teaspoons salt, diced tomatoes and tomato paste. Simmer for 30 to 45 minutes, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Bring a large pot of lightly salted water to a boil. Add lasagna noodles, and cook for 5 to 8 minutes, or until al dente; drain. Lay noodles flat on towels, and blot dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together eggs, ricotta, Parmesan cheese, parsley and 1 teaspoon salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer 1/3 of the lasagna noodles in the bottom of a 9x13 inch baking dish. Cover noodles with 1/2 ricotta mixture, 1/2 of the mozzarella cheese and 1/3 of the sauce. Repeat. Top with remaining noodles and sauce. Sprinkle additional Parmesan cheese over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven 30 minutes. Let stand 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ETHELMERTZ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6834929992630805,
            "ratingCount": 2714,
            "itemReviewed": "American Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "663.6 calories",
            "carbohydrateContent": "48.3 g",
            "cholesterolContent": "168.4 mg",
            "fatContent": "29.5 g",
            "fiberContent": "4.2 g",
            "proteinContent": "50.9 g",
            "saturatedFatContent": "15.2 g",
            "servingSize": null,
            "sodiumContent": "1899.7 mg",
            "sugarContent": "13.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-04T09:20:02.06Z",
                "reviewBody": "Ok here's the scoop on any revision you might want to make!  I've been making this lasagna for over a year and it is excellent... \r\n \r\n**You do need more sauce!  Just add an extra 14 oz can of crushed or diced tomatoes and increase garlic, onions and other spices by a small amount as well.\r\n\r\n**2 Tbs of brown sugar is just right.  \r\n\r\n**1&1/2 pound of hamburger is an awful lot, I've decreased it to 1/2 pound and that was plenty for this non-meat loving family!\r\n\r\n**I use 9x13 cake pan, and 12 lasagna noodles would fill it to overflowing!  I've found 9 noodles (3 layers of 3 noodles each) to be enough.\r\n\r\n**30 minutes is no where near long enough to cook this thing!  20 minutes uncovered just to get it started, then 1 hour loosely covered with foil, then remove from oven and let sit for 10 minutes is more like it!\r\n\r\nThis recipe is very forgiving, and judging by all the comments, very flexible as well.  Hope my comments help someone one else...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayne M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/419272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-25T04:48:54.983Z",
                "reviewBody": "I have found my staple lasagna recipe! I used Italian sausage instead of ground beef, but I only used a pound, next time I will double it because I like lots of meat. I took the advice of another reviewer, and used 1/3 of the ricotta mixture on the top layer to keep the noodles from drying out, it worked beautifully. I used two 15 oz. containers of ricotta, and doubled the sauce as suggested by others. I doubled the garlic and added fresh ground pepper to the sauce, used a mixture of shredded mozzarella and shredded parmesan, and I only needed to use 9 lasagna noodles. I put it together the night before, baked it covered for 1 hour and uncovered for 20 minutes. If you do cover it during baking, make sure to use nonstick cooking spray on the foil, or the cheese will stick. It sliced perfectly, too. My husband said it was just as good as the lasagna his Italian stepfather makes, and he's been cooking for more than 50 years with recipes older than that! That was the best compliment I could have ever gotten! The next time we have people over, this is the dish I'm going to make. I served it with cheesy garlic bread, I only wish I'd had caesar salad to go along with it. I will make this again and again. Thank you, Rosemary!\n\nPS: A disposable pan will be your best friend in this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanna Stevens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-18T17:04:45.92Z",
                "reviewBody": "WARNING... I made the receipe a day ahead as suggested.  Although I thought it was odd, I saw the cook time was 30 min and followed directions without looking back at the cook and prep times listed at the top of the web page (when I hit PRINT, those didn't print out, just the actual receipe!).  I should have known better.  There must be a typeo at the bottom of the receipe, it does NOT cook in 30 min, but an hour and 30 like it says at the top!  It was easy to figure out my mistake, and I should have prob known better, but in a rush I followed the receipe and planned for 30 min.  Now we'll have to wait another 60 to eat.  Oops.  I hope it's as wonderful as everyone says, it smells fabulous!  And DO add some extra tomato sauce and water to the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AHAUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T16:45:43.247Z",
                "reviewBody": "I believe this is a great basic recipe. I made several modifications to fit my tastes (adding mushooms, increasing spices, using turkey instead of beef), but that versitility only increases the value of the recipe in my mind.\r\n\r\nOthers have commented on the dryness and that concerned me a bit. I didn't find it dry at all and have a couple of observations that I didn't see in other reviews.\r\n\r\nFirst, the recipe isn't clear whether the tomatoes should be drained or not. Do NOT drain them, use the juice in the sauce.\r\n\r\nSecond, use cooked noodles. Uncooked dry or fresh noodles (I used fresh) will absorb water from the sauce and make the finished product drier. I suspect the same is true of the oven ready product I have never used.\r\n\r\nThird, I did end up adding a half-cup of water to be sure, but this will depend on how you simmer and personal tastes. I think adding about this much red wine as some others suggest could add flavor and the needed moisture.\r\n\r\nI gave it only four stars because of the discrepancy on cooking times (it needs 1 1/2 hours, not 30 min) and not being clear on retaining the juice in the diced tomatoes. Otherwise, I think it's a great and very adaptable recipe.\r\n\r\nThanks, Rosemary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CELYNCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/750485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T05:34:05.25Z",
                "reviewBody": "This is now going to be the lasagna recipe I use from now on.  The only change I made was I used a mixture of half ricotta cheese and half cottage cheese instead of all ricotta.  I refrigerated it overnight before baking it as the recipe author suggests and added 15 minutes to the baking time indicated in the recipe however I found that the edges were starting to burn before the center was done.  If you're refrigerating the lasagna overnight before baking it I suggest covering it with aluminum foil for the first 20 minutes of baking and baking it at 350 rather than 375.  That way the center can heat up without the edges burning first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVID S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-11T19:42:36.51Z",
                "reviewBody": "Wow!! Wonderful flavor! Be sure and simmer the sauce the maximum amount of time. Making the lasagna a day ahead and refrigerating is definitely key to having outstanding flavor! I made this a second time and used Italian-seasoned turkey sausage ground in my food processor. What a difference it made - will definitely do that again!! Also note that 1 tsp. dried basil works if you don't have fresh basil on hand and lowfat ricotta is just fine as well. I bake mine covered with aluminum foil for 20 minutes (then 10 minutes without) to prevent it from drying out. I have made this lasagna several times and like others I thought it could use more sauce. I now add an extra 14.5 oz. can of Italian-style diced tomatoes and increase the spices a bit. PERFECT! Thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-22T20:36:35.437Z",
                "reviewBody": "This is a great recipe but better with some modifications. I followed several suggestions from other reviews. Mainly this lasagna would be way too dry and bland without more sauce and spices. I added the equivalent of 1 1/2 28 oz cans of pre-seasoned sauce. To the sauce I also added lots of xtra garlic and fresh oregano plus I used half ground beef and half hot italian sausage instead of all beef (next time I might even go with all sausage because that added a lot of good flavor). I was going to add some crushed red pepper flakes but forgot so I will add a little next time. To the filling I added a few xtra ounces of ricotta a few xtra ounces of mozzarella (I used part skim) and 4 ounces of cream cheese. I also used xtra parmesan on the top. I cut the brown sugar in half and also used a little less salt. I don't know if I needed to but I sprayed the pan with Pam and also spread a little sauce on top of that and clean up was a snap. I had modified the recipe for 12 servings and used a bigger pan and I cooked it for about 1 hr 40 minutes. Clearly the 30 minute cook time at the bottom of the recipe is a misprint and should read the 1 1/2 hrs that it states at the top. Also I covered with foil for half of the cooking time which helped keep it moist on top. I served this to 10 girlfriends and they all thought it was terrific!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNEOKIRBY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/741881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-07T14:44:56.113Z",
                "reviewBody": "My family of 6, consisting of 5 finicky men all loved this lasagna, just when they thought I couldn't improve on my own I try this and they were flabergasted! Only two things I changed. One was I subed italian sausage for 1/2 the hamburger and second WAY TOO MUCH SALT! I cut the salt out completely and nobody noticed! There is plenty of salt in the cheeses and the diced tomatoes to suit our tastes. Stopped by to correct my spelling...and to tell you all we still love this and I make only this recipe now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JSTWINKLE5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jstwinkle5/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T20:28:41.063Z",
                "reviewBody": "Yummy!! Like other posts I realized I was going to need more sauce halfway through the recipe. Luckily I had another can of diced tomatoes in the pantry. So I added more to my sauce. Plus I cooked mine 20 minutes uncovered and an hour covered and it turned out perfectly.:-) The best lasgna I've ever had! Who needs the Olive Garden?:-) Notice the cook time at the top of the recipe...1.5 hours. THIS is the correct time not the specifed 30 minutes! Allrecipes really should change this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-13T22:46:04.607Z",
                "reviewBody": "DO NOT MAKE THIS RECIPE! How can anyone give this more than one star, let alone 5! Such a dry recipe, tasted burned because they had you simmer tomato paste which is already dry! Not even water helped this recipe. If you want a kick butt lasagna, search for WHITE CHEESE CHICKEN LASAGNA.... Wow, what a good meal that was, everyone raved over it! It's not your red, dried out lasagna, it's a moist, cheesy white chicken lasagna. Please mark this review as helpful, so others may see it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Purefusion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/907328/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "American Lasagna",
            "description": "See how to make a top-rated beefy lasagna.",
            "uploadDate": "2012-08-23T23:24:25.954Z",
            "duration": "PT8M20.375S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fdcdd5d14-7cfa-46e8-8b4b-5b161afa84dd%2F00211e4f-8726-477f-ac8b-fb9cf677a15a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1801376367001"
        }
    }
]