[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15596/side-dish/sauces-and-condiments/sauces/dessert-sauces/",
                    "name": "Dessert Sauce Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18041/stabilized-whipped-cream-icing/",
        "name": "Stabilized Whipped Cream Icing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8616407.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-03-04T01:51:34.000Z",
        "description": "This cream holds up longer on pies because it doesn't separate. Gelatin stiffens whipped cream and makes the texture seem fuller and slightly spongy. May be used to top a pie or frost a cake.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H3M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "2 cups",
        "recipeIngredient": [
            "¼ cup cold water",
            "1 teaspoon unflavored gelatin",
            "1 cup heavy whipping cream",
            "1 tablespoon white sugar",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Chill mixing bowl and beaters for at least 15 minutes before using. Place water in a small microwave-safe bowl. Sprinkle gelatin over water and allow to soften 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve gelatin by microwaving for 3 minutes, stirring after every minute. Remove from microwave and let stand at room temperature for 10 minutes; gelatin must be liquid but not warm when added to cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove bowl and beaters from refrigerator and pour in cream, sugar, and vanilla extract. Beat together just until beater marks begin to show distinctly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add gelatin mixture to cream, pouring in a steady stream while beating constantly. Beat until stiff peaks form. Use immediately.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Dessert Sauce Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ETHELMERTZ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.101910828025478,
            "ratingCount": 157,
            "itemReviewed": "Stabilized Whipped Cream Icing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "55.2 calories",
            "carbohydrateContent": "1.2 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "5.5 g",
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "6.1 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-15T00:07:05.18Z",
                "reviewBody": "I used this variaton and it was perfect!!! ~2 teaspoons gelatin, 4 teaspoons cold water, 1 cup heavy whipping cream, 1/4 cup confectioners' sugar, 1 teaspoon vanilla extract.... Combine gelatin and cold water. Whip the cream, and add confectioner's sugar. Add gelatin mixture and vanilla extract. Continue whipping until the gelatin is incorporated. Lovely firm texture and beautifully spreadable. I stuck it in the freezer for a short time to firm the icing a little more. It came out splendidly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HeatherLovesBudgies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T12:20:37.39Z",
                "reviewBody": "I've made this icing several times now and it's excellent.  Holds up very well.  Can even be piped through a bag for decorating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill McLaughlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T04:26:47.09Z",
                "reviewBody": "This recipe was a bit tricky for a complete novice using an electric beater... It tastes good (like whipped cream), but cooking the gelatin for 3 mins. and leaving it out for 10 was too long and it solidified a bit leaving some scattered gel-balls throughout. Next time, I'll know to heat the gelatin for slightly shorter and leave it out for a little less time as well. I'm going to keep playing with this as it seems like it has potential for good decorating (I made stars, leafs, and writing with it).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "EMILY_IN_AZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/241317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-27T19:44:03.437Z",
                "reviewBody": "I had to tweak this A LOT to get it to work. There isn't enough sugar or gelatin. Here's what I did instead: 2 teaspoons gelatin 4 teaspoons cold water 1 cup heavy whipping cream 1/4 cup confectioners' sugar 1 teaspoon vanilla extract.... Combine gelatin and cold water. Whip the cream and add confectioner's sugar. Add gelatin mixture and vanilla extract. Continue whipping until the gelatin is incorporated. Heating gelatin in the microwave never works for me so I heat mine on the stovetop. Less mess more consistent result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T05:39:05.983Z",
                "reviewBody": "I tried this 3 times. But i didnt put the gelatin in the microwave for 3 min. because it bubbled up after 30 seconds and made a mess. So what i did was just watch it until it started to bubble and then i let it cool for about 10 min. and that worked fine the first and third time but the second time i tried it i didnt wait long enough for it to cool and the cream got all lumpy and seperated so i think the key is just to make sure the gelatin is cool enough. If anyone can explain why its important to leave the gelatin in the microwave for the full 3 min I'd thank you very much bc if it makes a big difference i will have to try it again in a bowl big enough so that it doesnt spill over when it boils. OH! and anybody who is gonna make this should know that it is only enough for a small one layer cake. I iced a 2 layer cake and one cup of cream was only enough to ice the sides, that is why i had to make the extra batches. Good luck everyone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cristy Ferguson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-01T18:56:29.813Z",
                "reviewBody": "I made a double batch of this cream and it was plenty to 'ice' a triple layer 8\" and a sqaure 8x8. You must definitely keep this cream very cold otherwise it will just fall apart on your cake. It definitely needs more sugar. I doubled the amount called for and it still tasted more like a cream I would put on berries or pie rather than what I would decorate a cake with. Probably more flovring wouldn't hurt either. It's still not stiff enough to decorate with. I'm a cake decorator and the whipped icing I use is at least double the consistency of this cream at its softest. This is a great cream for berries and pies good fresh taste but just not what I was expecting based on the description....UPDATE 9/1/10...This is way off the base of the recipe here but I discovered a great way to stabilize the whipped 'just enough' so that it could be piped at least into rosettes for decorating a pie or the side of a bundt. I took 1 cup of the whipping cream and added 1 cup of a non-dairy liquid icing called Rich's Bettercream (if you've ever had an ice cream cake from Dairy Queen this is the whipped icing that is used) and simply poured them together into my Kitchen Aid and blended until I could see the stiff peaks from the whipping cream. This turned out great! The flavor was perfect since there is lots of sugar and vanilla in the Rich's already. And by using half whipping cream plain the flavors balanced out nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-26T21:52:41.95Z",
                "reviewBody": "The 3 stars for this recipe is for the method written.  For 5 stars I made the following changes on the second batch I made:  Skip the water and use about 1/4 cup of cream to soften the gelatin.  Placed in the micro for 15 seconds is plenty to warm and dissolve the gelatin.  Do this while the remaining cream is whipping in the mixer -SLOWLY.  Once the cream has thickened and begins to form \"waves\" add your sugar slowly (I used 1/2 cup powdered sugar - makes for a much smoother, non gritty, texture than  the granulated sugar gives) and beat until it forms firm peaks.  Then stream in the cooled gelatin but on low speed.  Once blended stop mixing.  Chill for 30 minutes then frost away!  This can now be piped, spread or used between layers.  I used on top of an ice cream cake and it froze perfectly.  I also piped a decorative border on pumpkin pie. Wonderful fresh taste.  Great presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T12:21:38.95Z",
                "reviewBody": "Really good if you prefer whipped cream over frostings that are too sweet. Can be flavored with instant coffee chocolate or peanut butter or use your own stir-ins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RONJA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/518437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-29T23:19:26.343Z",
                "reviewBody": "Very easy held up extemely well! I used confectioner's sugar and added about 4 times what the recipe called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474975/"
                }
            }
        ]
    }
]