[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13171/jade-garden-soup/",
        "name": "Jade Garden Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F386951.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-03-09T03:48:12.000Z",
        "description": "This is a very savory cold soup! Garnish with dill weed, sour cream and paprika.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P1DT1H10M",
        "recipeYield": "6 to 8 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 onion, chopped",
            "1 carrot, sliced",
            "2 stalks celery, sliced",
            "6 cups chicken stock",
            "⅓ cup uncooked white rice",
            "1 ⅓ cups fresh spinach, washed and chopped",
            "1 ⅓ cups butter lettuce - rinsed, and torn into small pieces",
            "1 ⅓ cups chopped fresh parsley",
            "salt to taste",
            "ground black pepper to taste",
            "1 pinch cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large saucepan over medium heat. Stir in onion, carrot, and celery; cook and stir until the onion has softened and turned translucent and the vegetables are tender, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in chicken stock and rice; bring to a boil. Cover, reduce heat to low, and simmer for 35 minutes or until rice is soft.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in spinach, lettuce, and parsley; cook just until wilted. Season with salt, black pepper and cayenne pepper. Use an immersion blender (or blend in batches in a blender) until smooth. The soup may be thinned with more broth, if desired. Refrigerate overnight before serving. Garnish as desired.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CORWYNN DARKHOLME"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 13,
            "itemReviewed": "Jade Garden Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "102.9 calories",
            "carbohydrateContent": "13.9 g",
            "cholesterolContent": "0.6 mg",
            "fatContent": "4.7 g",
            "fiberContent": "1.9 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "629.9 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-08T23:17:39.32Z",
                "reviewBody": "Admittedly I was bit skeptical but delivered a bunch of butter lettuce that I didn't know what to do with so I found this recipe. I am glad I tried it this recipe is awesome. The flavor is amazing and this recipe is extremely flexible. I made this even though I was missing a few components: parsley cayenne pepper and celery. I used only 2 cans of broth and about the same amount of spinach and butter lettuce as required by the 7 servings recipe. I added about 1 tbs butter thyme and oregano spices and otherwise followed the recipe as indicated. No doubt this would be even BETTER with the celery and parsley as the recipe states. I wonder what this would taste like with brown rice instead of white (for a different texture nuttier flavor). IMPORTANT: PLEASE BE CAREFUL WHILE BLENDING HOT ITEMS. The pressure will cause the hot soup to shoot through the blender top AND the peephole cap even if fully secure. You may want to let this cool some before blending (not sure if this will affect the recipe) or put a towel over the top and cap. I got a pretty nasty burn on my hand and was fortunate that it didn't shoot into my face.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tonya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3085905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-29T15:25:41.78Z",
                "reviewBody": "This is a great recipe if your fridge is out of control! I used the recipe as a base and made a few changes because of what I needed to use up. I started by using 8 cups of low-sodium chicken broth 1/2 cup of rice (this is the thickener). I didn't have onions so I used scapes (flowering tops of garlic) I tripled the carrots and used at least 2 cups each of lettuce and spinach. I also added lovage (about 1/4 cup). I needed to use the lovage and it has a natural salt flavor so I didn't need to add any salt to the recipe. I used a giant pot so I did not have to wilt the lettuce and spinach separately I just added it in at the end and covered for approx 2 minutes. I ended up pureeing only 3/4 of the soup. I thought that a little texture would suit my family. I put the sour cream in a plastic bag and cut off the end to squeeze and swirl on top of this soup. My ENTIRE family loved it(even my kids ages 3 & 5). It is a very fresh tasting perfect for summer soup! Serve hot or cold! Thank you so much for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAYNIE13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1354172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-09T15:18:34.95Z",
                "reviewBody": "This soup is really good although I thought it tasted better hot. It was easy to make though and it's very pretty too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sugar Lotus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-15T19:20:15.5Z",
                "reviewBody": "I chose to only blend the lettuce spinach and parsley because I like a more chunky soup. It had a good flavor but next time I think I will replace some of the parsley with cilantro for a different twist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-21T18:58:14.28Z",
                "reviewBody": "I started making this recipe intending to do as it says and blend the soup. Then realized that I didn't have a blender available!! (cooking at my boyfriend's condo) So I threw a little more rice in and we ate it without blending it. It was delicious and filling just like that. That being said I will definitely try this again when I actually have a blender!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gigi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2435732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-10T22:35:40.7Z",
                "reviewBody": "When I saw the title of the recipe I thought it may have an Asian/Oriental twist but then it didn't seem like it upon reading the ingredients. So given what was in my fridge I thought I'd give it a try. I used shallots in place of onion finely chopped lemon grass and red chile in place of the celery. I sauteed the veggies and chillies first then added 1/2 cup jasmine rice then the stock. I cut the cooking time in half give or take. Then I turned off the heat and stirred in spinach/arugula/mizuna lettuce mix and chopped chinese cabbage and a good handful of parsley (all I had). Blitzed it in the blender with a bit of water returned it to the pan and reheated adding soy sauce at the end - about 1/4 cup. Fab! Really flavourful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "paminwales",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4306774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-22T22:59:56.493Z",
                "reviewBody": "O M Gosh! The beauty of this soup is surpassed only by its unexpected layers of delicious flavors. The green is shattering and when I added the dollop of sour cream and the paprika I was stunned by what I had produced! And so easily!!!! And it's ridiculously healthy! Everybody loves it. I add a little bit (1/2 teaspoon) of cayenne pepper in place of the black pepper. Any leftover veg I have gets thrown in too. I cannot recommend this delicious recipe highly enough. And it's quick! I make it more affordable by using a bag of spring garden mix in place of the butter lettuce and 1 lb frozen spinach. Go forth and cook this amazing soup strengthen your friends' bodies and your own reputation as a good cook. It's good hot or cold but really it's much better hot. And at Christmas what a beautiful starter with that jewel green blob of white sour cream and the fabulous dark red of the paprika sprinkled (heavily) over the top. My my. I'm gonna make some right now...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WatsCookin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8867182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-09T00:33:31.943Z",
                "reviewBody": "This soup was delicious! My boys especially loved it and gobbled it up! I had a ton of butter lettuce and parsley from our CSA that I needed to use up and this was the perfect recipe to use them. I used veggie broth and brown rice instead of the white and it turned out great. Like other reviewers I just added the lettuce spinach and parsley to the soup pot and let it wilt up. I also just used an immersion blender to blend it up but I think it would be good chunky too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ouradventure",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3119626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-09T23:58:52.207Z",
                "reviewBody": "Delicious; just wilted the greens into the stock and then blended in the pot with a hand blender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2205065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-11T20:47:53.007Z",
                "reviewBody": "I came across this recipe to use up a bunch of produce I had around. In general I like that it's quite a healthy recipe but overall it just tasted rather bland and felt like it was missing something. I really wanted to like this one but it was just rather unappealing- even the color once I blended it with my immersion blender. If I were to make this again I think I would change it up- like another reviewer said- maybe cilantro instead of parsley and with some soy sauce and garlic. Also I would think just blending the greens would result in a nicer looking soup as well with some nice texture to it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "emrstl1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12008012/"
                }
            }
        ]
    }
]