[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13125/chinese-sizzling-rice-soup/",
        "name": "Chinese Sizzling Rice Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5476778.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1999-03-16T14:23:48.000Z",
        "description": "Chinese is one of my favorite cuisines to cook as well as eat. By cooking the rice before it is added to the soup, you will enjoy the crunchy texture with the other flavors in this delicious soup.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 ounces baby shrimp",
            "3 ounces skinless, boneless chicken pieces cut into chunks",
            "1 egg",
            "4 tablespoons cornstarch",
            "4 cups vegetable oil for frying",
            "3 cups chicken broth",
            "1 ounce mushrooms, chopped",
            "2 tablespoons chopped water chestnuts",
            "⅛ cup diced bamboo shoots",
            "⅓ cup fresh green beans, cut into 1 inch pieces",
            "½ teaspoon salt",
            "1 tablespoon sherry",
            "⅔ cup uncooked white rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together the shrimp, chicken, egg, and cornstarch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3 cups of the oil in wok. When it is hot, add shrimp and chicken mixture. Cook for 1/2 minute and drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place above mixture in pot with the broth, mushroom, water chestnuts, bamboo shoots, and green beans. Bring to a boil. Add salt and sherry. Return to a boil. Reduce heat and allow to simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat the remaining 1 cup of oil until it is hot. Add rice and brown quickly. Drain and add to soup. Serve and enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.571428571428571,
            "ratingCount": 28,
            "itemReviewed": "Chinese Sizzling Rice Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "294.5 calories",
            "carbohydrateContent": "24 g",
            "cholesterolContent": "60.2 mg",
            "fatContent": "17 g",
            "fiberContent": "0.7 g",
            "proteinContent": "10.6 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "641.3 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:48:17.28Z",
                "reviewBody": "Thanks for this recipe!-it's very similar to our favorite soup at our favorite Chinese restaurant.  However, after trying the recipe \"as is\" and then trying it again, I would recommend the following changes (sorry, Holly!):  1.use snow peas instead of green beens 2.instead of frying the chicken mixture, mix the chicken and shrimp with only one tsp. cornstarch, and 1 tbsp. sherry, let sit 10 min., then add to boiling broth.  Let simmer, then add vegetables. 3.leave the bamboo shoots and water chestnuts sliced (do not chop).  I used about 1/2 of a can each.\r\n4.For the rice-by not cooking the rice before frying it and adding to the soup, it browns too quickly, and ends up tasting almost burned, and is still really hard.  Cook the rice first, as directed on the pkg. (about 2 cups), then spread it in a thin layer on a baking sheet.  Bake for approx. one hour at 300 degrees, turning the rice layer over after 30 min. (you may need to bake a little longer, to get it \"crispy\") Break rice apart, then fry and add to the soup as directed. (if desired, you can freeze half the prepared rice to use at a later time) Make sure the rice and soup are very hot in order to get that \"sizzle\".  The first time I made this it was pretty good, the second time (with the changes) it was fantastic!  Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/285454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-19T02:55:16.56Z",
                "reviewBody": "We loved this soup! It was so easy and flavorful it will definitely be a regular dish for us. I made a few changes but nothing to dramatically change the original dish. I used a 4oz can of tiny shrimp. I browned the chicken in the pot in a small amount of vegetable and sesame oil omitting the deep frying step and the egg. I used 4 cups of broth 2 of chicken and 2 of vegetable and even with all of the liquid from the can of shrimp I wanted more broth. If you used canned shrimp either do not drain them (and skip frying them) or reserve the liquid because it adds SO much flavor. I used half a can of bamboo shoots diced water chestnuts and bean sprouts. Instead of green beans I used snow peas. I used a handful of fresh shitake mushrooms sliced. I also added in a handful of shredded napa cabbage right at the end of cooking. I can't purchase sherry or rice wine so I substituted a healthy splash of rice vinegar. Even though it probably changes the flavor considerably the results were tasty so I dont mind the switch. I tried some others' advice about the frying of the uncooked rice which to me sounded greasy and unappetizing. I steamed 1/3c. of white rice to get about 2/3 cooked. I put the rice in a bowl and poured on about a tsp each of vegetable and sesame oil and stirred to coat. I spread the rice out on a cookie sheet and put it in the oven at about 400. It took 15 minutes to get to a desired crispiness. Just check it often to make sure it doesn't burn =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1510260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-20T23:21:12.873Z",
                "reviewBody": "It's a good recipe although I didn't follow the measurements given in the recipe. I omitted the mushrooms egg and substituted the green beans with frozen peas. I would recommend using less than half a can of bamboo shoots. The taste overpowered the soup. For the rice I sprayed a baking sheet with cooking spray layered a thin sheet of steamed rice then sprayed cooking spray over it and then put it under the boiler. It took about 5 10 minutes and remember to watch it. I burned my second batch. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cocooned",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-29T00:03:12.457Z",
                "reviewBody": "This recipe is great with a few tweaks ( i know, i know, i hate when people alter the recipe's to the point where they are different, but this one needs the changes). First - too much oil! I cube the chicken and cook on the stove with a touch of sesame oil, soy sauce, and ginger. Also, cook the rice beforehand (just use the 5 min rice), and then spread on a cookie sheet and bake until golden brown). I personally prefer snow peas over green beans, and I added some shredded bok choy the last few minutes of simmering (can also use cabbage). With the reduction in oil, this recipe has a fresher more veggie taste to it and the broth just tastes so much better. I also ended up needing more liquid for all the veggies i added, so i used water and added chicken bullion. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Jordan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2081542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-07T18:06:13.683Z",
                "reviewBody": "In addition to the constructive criticism/suggestions on here I would like to add one more thing concerning the rice. Bake the rice on a cookie sheet like others have said then cut the rice in squares and dip them into hot oil for a few seconds. Place the squares in the hot soup immediately and serve. That will give the soup the sizzling sound. My husband and I learned that trick after talking to a waitress in an outstanding chinese restaurant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Janice Laughton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1068470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:48:18.873Z",
                "reviewBody": "This was surprisingly VERY GOOD very easy but it's definitely not a dish you can save for the next day. Once you put in the sizzling rice you really need to eat it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AHN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/413121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-20T18:54:02.327Z",
                "reviewBody": "Good as is but I changed a few things and it was better. I omitted the bamboo shoots I used pea pods instead of green beans and added thin sliced carrots. I didn't chop the chestnuts just put them in sliced. Next time I will not use the egg by using the egg it looked more like egg drop soup which really didn't matter to me I like egg drop but I will try it next time without. I also didn't fry the rice just added baked cooked rice like the other reviewer suggested.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Rebecca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1051602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-11T00:28:17.903Z",
                "reviewBody": "it was good but too much stuff and not enough broth. I would use cooked rice next time then uncooked when frying up to place in soup. The uncooked rice sank to the bottom and did not enhanse the flavor like I have had at restaurants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kmajors",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2599920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T20:25:42.197Z",
                "reviewBody": "This recipe is always delicious! When I make it at home I use seitan instead of chicken and shrimp. I made it the other day with chicken and shrimp but I didn't do the cornstarch and egg thing. I've done it both ways and they are both delicious. I never use anywhere near the amount of oil in the recipe nor do I ever add mushrooms. I use baby corns instead and snow peas instead of green beans. It's tasty every time and every way I do it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MASCHRAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770582/"
                }
            }
        ]
    }
]