[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8175/caramel-frosting-v/",
        "name": "Caramel Frosting V",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3672659.jpg",
            "width": 2604,
            "height": 2129
        },
        "datePublished": "1999-03-16T17:53:29.000Z",
        "description": "This is my mother-in-laws recipe. She was a fantastic country cook!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "1 pound light brown sugar",
            "1 cup heavy whipping cream",
            "½ teaspoon baking soda",
            "½ cup butter",
            "¼ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium, heavy saucepan, bring the brown sugar and cream to a rolling boil; boil 1 minute. Add baking soda; boil 1 more minute. Remove from heat. Add butter, but do not stir yet. Let the mixture cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat well. Stir in pecans if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.280254777070064,
            "ratingCount": 157,
            "itemReviewed": "Caramel Frosting V",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "295.7 calories",
            "carbohydrateContent": "38 g",
            "cholesterolContent": "47.5 mg",
            "fatContent": "16.6 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "125 mg",
            "sugarContent": "36.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-12-25T20:27:52.45Z",
                "reviewBody": "I have made this frosting several times, and it is very good. However, there is a secret to making this frosting creamy, light, and\n fluffy. I experimented, just a little bit and it came out PERFECT. First, set aside 2-3 tbs. heavy whipping cream for later. Next, make sure you let the mixture cool COMPLETELY (refrigerate as others suggested) DO NOT STIR. After about 1-1 1/2 hrs in the refrigerator the mixture should be ready. It will look like a thick, gooey, paste. Remove from fridge, and mix with mixer. Add the 2-3 tbs reserved heavy whipping cream alternately with powdered sugar until desired consistency. MMmmm GOOD!!! (as a suggestion if the frosting is to sweet for your taste try using a store brand POWDERED SUGAR, and cut down on the brown sugar; really cuts down on sweetness) ***UPDATE***  I recommend making this frosting before you make the cake. For maximum results, (for those struggling with this frosting) I suggest leaving in fridge for at least 4 hours. When you begin mixing frosting it is *VERY IMPORTANT* you add powdered sugar for a fluffy consistency. Without the powdered sugar your results will be a caramel glaze instead of a frosting. Hope this helps. Good Luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teresa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2156247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-14T08:36:58.013Z",
                "reviewBody": "what a wonderful flavour.  For those who had problems acheiving the right texture, you really have to be patient with this one and cool it properly.  If you don't you end up with a caramel glaze and not the creamy delicious frosting you should have.  If you have to, after its cooled on counter top put it in the fridge for approx 15mins or until you see it forming a very light skin on th top then start mixing.  10/10",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ilham778",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1739282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T07:30:54.903Z",
                "reviewBody": "EXCELLENT frosting. While making it I had some doubts about consistency and color but it turned out to be such a hit and everyone LOVED it and could not stop commenting. I used it on \"Apple Bundt Cake\". Some hints- do not overcook. Follow the 1 min timing exactly. Also beat after the entire bowl has cooled down it helps to put it in the fridge. Once it is completely cool and you start beating it the color will lighten up a lot and it will become fluffy and have frosting consistency so don't worry about it! The flavor is perfect this is definetly a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ILEAN811",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T18:54:05.5Z",
                "reviewBody": "OMG! I have tried so many caramel frosting recipes and they never worked.  This one is the best ever!  The key to getting the right consistency is to let it sit for at least 1 1/2 in the refridgerator, without stirring, after you add the butter.  *UPDATE*- If you dont need the frosting right away, make it a night, put a lid on the pot and let it sit over night.  When you get up in the morning, the frosting has the perfect consistency.  I use my hand held mixer to whip the frosting right up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "buchana5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2310721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T17:57:35.6Z",
                "reviewBody": "This recipe is magical.  I used store-brand brown sugar, whipping cream and butter.  I used 2 cups of firmly-packed brown sugar and followed the recipe instructions exactly.  I did let the caramel cool in the fridge for about 1 hour and then moved it to the freezer for about 30 minutes to speed up the cooling process.  It was completely chilled and cold, which must be the key to this recipe.  (Thanks previous reviewers!)  I followed the recipe and didn't stir the mixture after I put the butter in, and it left a film or \"skin\" of beautiful, buttery fat on top when I took it out of the freezer.  I scooped it out of my saucepan (it was a very thick \"paste\", but still fairly easy to get out of the pan) and put it into my Kitchenaid mixer.  The color began to lighten almost instantly upon beating with the paddle attachment.  I started the mixer on medium for about 1 minute to get it going and then beat for another 4-5 minutes (max) on high.  The consistency is silky smooth and the taste is REAL homemade caramel.  I piped it onto mini caramel apple cupcakes and it piped like a dream.  Thank you Carol for sharing this classic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jboyeskie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/91951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T15:47:34.67Z",
                "reviewBody": "This is the best frosting I have tasted! Creamy and not sugary...with a good caramel flavor. Easy to make. Use a bigger pan than you think you will need because of the volume when boiling and beating. After dropping cold butter pieces into the mix, I put the pan in the fridge til quite cool. It beat up like a dream! Thanks for the wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESBESQUET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-07T02:11:09.967Z",
                "reviewBody": "First, I would like to say phenomenal flavor!  Second, great flavor!  Third, it takes forever for the lighter, fluffier frosting (like a decade) but it is well worth the wait.  I did this frosting twice and didn't let it completely cool, so it was more like a glaze.  I read other reviews and new that I had to be really patient.  All in all great flavor and texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luvbakin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1932385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T23:37:54.47Z",
                "reviewBody": "Absolutely Excellent! The consistency is creamy and the flavour is wonderful. I was a little hesitant not to stir it after I added the butter but I resisted the temptation and just let the mixture cool in a cold bath for about 30 minutes and then in the fridge for another 30 minutes. I whipped it on its own and then I added 3 tbs of whipping cream (set aside from the 1/2 cup) and about 2-3 tbs of icing sugar alternatively with the cream (as suggested by another reviewer). It's a keeper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoeyAngel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2321861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T16:54:37.187Z",
                "reviewBody": "I tried this recipe increasing it by 50% since I needed more icing to decorate a fairly elaborate cake. Note I also live at altitude (recent move - not a lot of experience in adjusting recipes yet). Well what I had after refrigerating the mixture for 2 hours was lovely caramel sauce for ice cream (after beating - unless I was supposed to be using an electric mixer to incorporate air?). So iwth guests coming in 90 minutes I had to punt. I added 4.5 cups of confectioners sugar (so for the regular recipe that would be 3 cups) a cup at a time beating constantly after each addition. THEN I had caramel frosting I could decorate a cake with. Everyone LOVED the frosting. I don't know if it was increasing the recipe altitude or what that caused my problems. I did boil it for 90 seconds instead of 60 each time BTW.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JANER01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653159/"
                }
            }
        ]
    }
]