[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8182/cannoli-cake-roll/",
        "name": "Cannoli Cake Roll",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F771379.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "1999-03-17T03:36:09.000Z",
        "description": "A decadent and rich jelly-roll style cake. Makes a wonderful showcase, well worth the effort!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -15 inch cake roll",
        "recipeIngredient": [
            "5 eggs, separated",
            "1 teaspoon vanilla extract",
            "½ cup white sugar, divided",
            "¼ teaspoon cream of tartar",
            "¼ teaspoon salt",
            "¾ cup cake flour",
            "2 tablespoons orange liqueur ",
            "1 tablespoon water",
            "1 tablespoon white sugar",
            "confectioners' sugar for dusting",
            "1 ¼ cups ricotta cheese",
            "4 ounces cream cheese",
            "½ cup confectioners' sugar",
            "½ teaspoon vanilla extract",
            "¼ teaspoon ground cinnamon",
            "¼ cup mini semi-sweet chocolate chips",
            "¾ cup heavy whipping cream",
            "3 tablespoons confectioners' sugar",
            "2 tablespoons orange liqueur ",
            "½ teaspoon vanilla extract",
            "¼ cup chopped pistachio nuts",
            "1 tablespoon white sugar",
            "1 tablespoon mini semi-sweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease one 15 1/2 x 10 1/2 inch jelly-roll pan and line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the eggs. In small bowl, with mixer at high speed, beat egg yolks, vanilla, and 1/4 cup granulated sugar until very thick and lemon colored, about 5 minutes. Set beaten yolk mixture aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl, with clean beaters and with mixer at high speed, beat egg whites, cream of tartar, and salt until soft peaks for. Beating at high speed, gradually sprinkle in 1/4 cup granulated sugar until sugar dissolves and whites stand in stiff peaks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer beaten egg yolks to another large bowl. With rubber spatula, gently fold beaten egg whites into beaten egg yolks, one-third at a time. Sift and fold flour, one-third at a time, into egg mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With metal spatula, spread batter evenly in pan. Bake at 375 degrees F (190 degrees C) for 10 minutes or until top of cake springs back when lightly touched with finger.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a cup, mix 2 tablespoons orange liqueur with 1 tablespoon water and 1 tablespoon sugar until sugar dissolves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle clean cloth towel with confectioners' sugar.  When cake is done, immediately invert hot cake onto towel. Carefully peel off parchment paper and discard. Brush cake with orange-liqueur mixture.  Starting from a long side, roll cake with towel jelly-roll fashion. Cool cake roll, seam side down, on wire rack until completely cool, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Ricotta Filling:  In food processor, with knife blade attached, blend the ricotta cheese, cream cheese, 1/2 cup confectioners' sugar, 1/2 teaspoon vanilla and cinnamon. until smooth. Transfer filling to bowl and stir in 1/4 cup of the chocolate pieces. Cover and refrigerate filling while cake cools.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Assemble Cake:  Gently unroll cooled cake.  With metal spatula, spread filling over cake almost to edges.  Starting from same long side, roll cake without towel.  Place rolled cake, seam side down, on platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting:  In small bowl, with mixer at medium speed, beat whipping cream and 3 tablespoons confectioners' sugar until soft peaks form. With rubber spatula, fold in 2 tablespoons orange liqueur and 1/2 teaspoon vanilla. With metal spatula, spread whipped-cream frosting over cake. Refrigerate cake at least 2 hours before serving. Sprinkle top of cake with chopped pistachios and chocolate pieces just before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "shirleyo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 90,
            "itemReviewed": "Cannoli Cake Roll",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "200.5 calories",
            "carbohydrateContent": "25 g",
            "cholesterolContent": "24.6 mg",
            "fatContent": "9.2 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.8 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "102.9 mg",
            "sugarContent": "17.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-03T19:00:15.523Z",
                "reviewBody": "For dessert recipes that use ricotta, I have found that it's essential to have two things: 1)the very best quality ricotta, and 2)all excess moisture drained, using cheesecloth and a strainer. This will give your cannoli cream the texture you want. Just put cheesecloth, a few layers thick, into a strainer or colander, put your ricotta into it (make sure you have it in a bowl to catch the water), and let it drain for an hour or so in the fridge. You should get a nice, dense consistency to the ricotta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1705627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-14T13:40:32.623Z",
                "reviewBody": "This is a very impressive cake to serve to our friends who love the real cannoli!! Everyone was quite impressed with the flavor and appearance. I too found the filling to be a bit too runny so I sprinkled some white chocolate pudding (instant) into the mixture until it thickened to a spreadable consistancy. This also gave it another dimension of flavor. (I did the pudding \"trick\" the second time I made the cake. The first time I increased the amount of cream cheese to 8oz which also helped--but the pudding \"trick\" works the best!!) I'll definitely make this again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "M.A.H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-17T21:41:51.75Z",
                "reviewBody": "This cake is absolutely wonderful. Everyone loves it and it makes a great presentation for special events. It is time consuming to put it together but it's not difficult and it's worth the effort. Although it's not a quick recipe, the directions are easy to follow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEANINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/96954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-05T19:57:46.3Z",
                "reviewBody": "good instructions. recipe turned out just fine. use metal utensils where requested. do not stir in whites and flour fold just until combined. cake batter should look like yellow marshmallow cream. try not to spend too much time spreading batter into jellyroll pan. its ok if it is not perfect. bake 10 mins and no more. your dish towel should be more like pillow case material and not like a towel. Brush the flavored sugar and liquor mixture lightly. just enough to cover the cake. you may have some juice left over. not too tight on rolling it up. i rolled mine up from the short side. (end zone of a football field) ricotta should be full fat and not part skim. you should strain the cheese by placing it in a small strainer then hover it over a bowl and cover the top with paper towel and place in fridge for as long as you can. i prepped the cake with the cheese and left it in the fridge (rolled up) until the next day. then added the whipped cream before serving. (the cake takes up a lot of room in the fridge) it was a fab desert. thanks so much",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THOMJANICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-09T01:01:43.53Z",
                "reviewBody": "I made this for a birthday at work. It got oohs and ahhs! In order to avoid the cake sticking problem other reviewers experienced; I didn't brush the liquor syrup on until AFTER the rolled cake had cooled and I unrolled it. I also substituted cherry liquor for the orange liquor in the recipe and almond extract for the vanilla. I also did not experience my filling being too thin as others did. This will be a regular on my \"special event\" dessert menu.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKYKAMP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/622586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-24T14:09:27.367Z",
                "reviewBody": "One word for this. IMPRESSIVE PRESENTATION! I sold the whole thing to one person JUST because of the way it looked! She said it tasted AWESOME! WELL WORTH THE EFFORT! Thanks for sharing such a great recipe!:-))))))) A",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REBEKAH39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/659974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T18:53:58.537Z",
                "reviewBody": "I would like to say that when I decided to made this cake I was very excited. I had a feeling that it would turn out perfect after reading all the great reviews about it. But instead I'm very disappointed. After I wrapped the cake in the towel and waited for it to cool for exactly 1 hour I gently unrolled it and the middle of the cake stuck to the towel which then made a hole in the cake. I did use confectioners sugar before inverting it onto the towel so I don't know what the problem was with the cake sticking. And another thing was that the cannoli filling was not at all thick enough from sitting in the refrigerator by the time the cake had cooled for an hour. It should have sat in the fridge for at least a couple of hours. But in the end even when the cake did come out looking bad I ripped the cake apart and put the pieces in dessert bowls and poured the liquid cannoli filling on top. It did taste good so that's why i gave it one star.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETIE79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/831392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-18T23:52:13.357Z",
                "reviewBody": "I actually enjoyed the cake. It was not easy to make but I thought the end product looked great! I was disappointed when no one at the party seemed to enjoy it. I followed the recipe very carefully but I would recommend making sure that the crowd you serve it to enjoys cannolis or they might not be too impressed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "WISHME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-23T23:40:18.193Z",
                "reviewBody": "I made this cake a week before Easter and froze it without the whipped cream frosting. Instead of using cream cheese I used 4 oz.(1/2c)of mascarpone cheese. I also chopped up 1/4c of shelled pistachio nuts and added them when I folded in the mini-chocolate chips to the filling.When I sweetened the whipped cream I also added 1/2 tsp of grated orange zest. I thawed the frozen cake the day before Easter in the Refrigerator and then frosted and garnished the cake on Easter morning. It sat in a cooled garage covered for three hours before serving and it was a big hit. My Son-in-Law said it was \"absolutely delicious\". I will make this again and maybe add drained paper-towel dried and chopped-up maraschino cherries to the filling also then it will really taste like my Grandma's Cannoli filling. Thanks for the great recipe! P.S. They have asked me to make it again when Family comes into town at the end of April. I know this will be a crowd favorite for years to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen Bancroft Ziegler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763036/"
                }
            }
        ]
    }
]