[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7119/mediterranean-black-olive-bread/",
        "name": "Mediterranean Black Olive Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9334349.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-03-19T18:06:56.000Z",
        "description": "You can vary the flavor of this bread with your choice of olive - Kalamata, Amfisa, Arbequina, Niscoise ... ... ....",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - round loaf",
        "recipeIngredient": [
            "3 cups bread flour",
            "2 teaspoons active dry yeast",
            "2 tablespoons white sugar",
            "1 teaspoon salt",
            "½ cup chopped black olives",
            "3 tablespoons olive oil",
            "1 ¼ cups warm water (110 degrees F/45 degrees C)",
            "1 tablespoon cornmeal"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together flour, yeast, sugar, salt, black olives, olive oil, and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn out dough onto a floured board.  Knead until smooth and elastic, 5 to 10 minutes.  Set aside, and let rise about 45 minutes, until it doubles in size.  Punch down.  Knead well again, for about 5 to 10 minutes. Let rise for about 30 minutes, until it doubles in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Round the dough on kneading board.  Place upside down in a bowl lined with a lint-free, well floured towel.  Let rise until double in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the bread is rising for the third time, put a pan of water in the bottom of the oven.  Preheat oven to 500 degrees F (260 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently turn loaf out onto a sheet pan that has been lightly oiled and dusted with cornmeal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake loaf at 500 degrees F (260 degrees C) for 15 minutes.  Reduce heat to 375 degrees F (190 degrees C).  Bake for 30 more minutes, or until done.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638418079096045,
            "ratingCount": 177,
            "itemReviewed": "Mediterranean Black Olive Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "138.4 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": null,
            "fatContent": "3.7 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "197.3 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-21T01:47:10.433Z",
                "reviewBody": "TAKE NOTICE BEFORE FOLLOWING THE DIRECTIONS VERBATIM:  15 minutes on the bottom rack at 500 degrees blackened (ie. *burned*) the top of this bread.  After all the work and time I invested in preparing this loaf, I was very disappointed to have it ruined by the author's cooking instructions.  Reading some of the other comments, I would have to agree that 450 degrees instead of 500 is the way to go.  The original author must be in a high-altitude environment or something.  \n\nThe inside of the bread was extremely delicious and I will be baking this one again soon (at 450/375).  Thank you for the recipe, I'm sure you didn't mean to burn my bread. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "manwithabook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405274/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-29T21:35:36.64Z",
                "reviewBody": "this is off the chart!  Thanks so much for a wonderful recipe!  Proofed the yeast first w/1tbsp sugar then added all but the salt.  added that w/2nd cup of flour so as not to kill the yeast.  I did have to use more flour but used A-P.  It rose beautifully each time.  Added 1 1/2 tsp. garlic powder, and 1 tsp. italian seasoning.  Used both black and Tunisian green olives from the family orchard.  Makes for a beautiful presentation.  Left the olives in larger pieces. Very rustic looking.  Baked at 475 for the first 15 min. then down to 400 for the remainder.  The steamed oven made for a beautiful crispy crust but the bread itself was so soft and tender.  The addition of spices and garlic only added to the loaf but did not detract from the olives.  Use good olives from a specialty store or olive bar at the local supermarket.  I'm afraid canned olives would not fair too well in this recipe other than lending eye-appeal. Don't be afraid to try this recipe.  Just prepare the rest of your meal in between risings.  The most tedious part was getting all the olive away from the pits!  Thanks again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-22T01:05:14.233Z",
                "reviewBody": "I have made this for several parties.  Each time I do a little something different.  My favorite variation of this recipe is substituting whole wheat for 1/2 of the white flour and adding rosemary, basil, oregano, and garlic to the dough. I doubled the olives too!  Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DLBYRNES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/506122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-17T03:50:07.223Z",
                "reviewBody": "This is such a GREAT bread! I proofed the yeast separately in the warm water & 1T of the sugar.  I subbed 3T of the flour for 3T of vital wheat gluten flour for better rising results.  Once the yeast was well-bloomed, I put it in the bowl of my stand mixer with the remaining ingredients to mix & knead it. I used kalamata olives and then copied reviewer, Tunisianswife, and added 1.5 tsp garlic powder & 1tsp Italian seasoning to the dough. These additions sent the bread over the top!  Along with the pan of water in the oven, I also misted the loaf and the oven with water every three minutes for the first 10 minutes.  This bread is so fragrant with the olives & spices, tastes wonderful, & has a great texture.  Holly, thank you SO much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-30T15:36:05.983Z",
                "reviewBody": "Holly, thanks so much for sharing this wonderful recipe. I have made it four times and given it away to friends. It seems to be their favorite of all the breads I bake. Everyone loves the crispness of the crust combined with the tender inner bread. The last loaf I made with Kalamata olives rather than black and added 1 teaspoon garlic powder and 1/2 cup Parmesan cheese. Yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-24T21:40:39.577Z",
                "reviewBody": "I have had Olive bread several times at restuarants and I love it.  I was nervous to try making it though afraid it would be difficult.  It is very simply.  I didn't really change anything on the recipe other than completing the initial step with a mixer.  If you do this, I would recommend leaving the olives in very large pieces.  Mine were in tiny bits by the time I baked the bread.  I used Kalmata olives as that is what I have always had before, but I think I will try making with other types as Kalamata's are very expensive and difficult to find where I live.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-17T14:22:29.7Z",
                "reviewBody": "Hi all! Thx for this recipe Holly! I am in search of the \"secret recipe\" of bakery olive bread, which is so expensive!\r\nFor a \"first-time\" bread-baker, this was a great recipe! Did all mixing/kneading by hand. I used whole-wheat flour, which may have contributed to the \"heaviness\", but I did not see \"bread flour\" in store. I used Kalamata olives (unrinsed). I, like others, found that it darkened too quickly at the high oven temp. suggested, so I will start at 400F for 15 min. and 325-350F for remainder of time, next time I make one round loaf. I will try making a  donut-shaped loaf with further temp. adjustments, to facilitate even cooking and give me more crust!(Mine was a bit moist inside when crust was over-done!) The texture/grain was perfect! Taste was a bit \"yeasty\"-(Probably my fault-my pkg. of dry yeast was 2.25 tsp. instead of 2 tsp...Oops! So, make sure you check!) But, this was SO EASY to throw together with plenty of bench flour on hand; a good work-out, too! I will make this again with some more creativity. Just love the idea of putting half & half olives/sun-dried tomatoes! A few herbs too! I am also anxious to use this dough for home-made, gourmet pizza! Will be AMAZING! ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Loraine D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1608521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-15T13:57:07.17Z",
                "reviewBody": "HI TO ALL. WOW. I JUST MADE THIS BREAD  AND IT IS THE ABSOLUTE BEST BREAD I HAVE MADE IN A LONG TIME. I DID ADD 1-2 TBLS. ITALIAN SEASONING AND USED HALF GREEN OLIVES AND HALF BLACK OLIVES. AND I MADE IT INTO TWO SMALLER LOAVES RATHER THAN ONE. THIS RECIPE MADE IT INTO MY FAVORITES BOOK. I WILL BE MAKING THIS OFTEN. I AM SENDING A LOAF TO ONE OF MY GOOD FRIENDS WHO LOVES OLIVES. I THINK SHE WILL REALLY ENJOY THIS BREAD. THANK YOU FOR THE GREAT RECIPE!! IT IS VERY EASY TO MAKE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEEBLER11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1287157/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T22:11:42.76Z",
                "reviewBody": "Awesome, but even awesomerer with a tsp or two of chopped FRESH rosemary. YES!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "darlenejoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/darlenejoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T18:46:13.937Z",
                "reviewBody": "Disappointed in this.  I was hoping to replicate the delicious homemade olive bread we were served everywhere in Beirut for breakfast.  I followed the directions to a \"T\", including all three rises.  I used excellent quality kalamata olives (the ones that go for $8.99 a pound in the deli).  Unfortunately, I felt the bread lacked any depth, and was, of all things, a bit sweet!  I tried warm from the oven, cold, and even toasted and failed to really enjoy it in any way.  I brought about 2/3 of the loaf to a family party and everyone tried one piece since it's homemade bread, but not a single person went back for seconds, and I had leftovers to take home.  Of homemade bread!!  (It's not a \"bad\" recipe, it was just uninspiring to the taste buds.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "dishanddelish.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dishanddelish/"
                }
            }
        ]
    }
]