[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7110/quick-and-easy-monkey-bread/",
        "name": "Quick and Easy Monkey Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3026392.jpg",
            "width": 2253,
            "height": 2253
        },
        "datePublished": "1999-03-22T18:48:44.000Z",
        "description": "This is a very easy bread to make.  Monkey bread also has been called Bubble Bread and Pull Apart Bread.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 - 9 or 10 inch tube pan",
        "recipeIngredient": [
            "24 ounces frozen dinner roll dough",
            "1 cup packed brown sugar",
            "1 (3.4 ounce) package instant butterscotch pudding mix",
            "¼ cup white sugar",
            "2 teaspoons ground cinnamon",
            "½ cup chopped walnuts",
            "½ cup melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "The night or several hours before, grease and flour a 9 or 10 inch tube pan. Mix brown sugar and pudding mix together.  Mix white sugar and cinnamon together. Place frozen dinner rolls in pan a layer at a time.  Sprinkle brown sugar and pudding mix over first layer of rolls. Sprinkle sugar and cinnamon mixture over the brown sugar and  pudding mixture.  Spread half the nuts and melted butter over first layer.  Repeat with the next layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place on counter over night. Do not cover. Next morning bake in a preheated 350 degrees F (175 degrees C) oven for 30 minutes. Let stand a few minutes and turn pan over onto serving platter.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.490974729241877,
            "ratingCount": 277,
            "itemReviewed": "Quick and Easy Monkey Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388.6 calories",
            "carbohydrateContent": "59.6 g",
            "cholesterolContent": "22.6 mg",
            "fatContent": "14.5 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "483.7 mg",
            "sugarContent": "30.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-03T03:42:28.733Z",
                "reviewBody": "I think my brother-in-law would refuse to celebrate Christmas if I didn't bring this for Christmas morning! He always asks me \"are you going to bring that cinnamon thing?\" I have found that I have more success making this in a tall sided 9x13 pan than in a tube pan. For some reason when in a bundt pan I can't get the center completely cooked. One secret I have discovered to getting the center done without overcooking the edges is to cover the pan with foil after 15 minutes of cooking. It comes out perfectly that way. I let my rolls thaw enough to cut each of them into 3 or 4 pieces before assembly so I get a better distribution of cinnamon mixture throughout the dough. I also discovered that it works better to use non-instant pudding and combine it with the sugar and melted butter in a saucepan then sprinkle each layer of rolls with cinnamon and pour the sugar/pudding/butter mixture over the top. I think this is really at its best when served warm or on the same day it is baked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T18:21:52.72Z",
                "reviewBody": "I read through some of the reviews and decided to mix a few things up. I used cooking pudding, cinnamon, brown sugar, butter & pecans. I let the rolls soften up enough to cut them in halves. I melted the butter (1 1/2 sticks plus 1 c brown sugar) added the BS and the cinnamon and gently warmed until it came together. Then I added the pudding. I sprayed the bundt pan with Pam, sprinkled a few nuts & brown sugar on the bottom and then layered in about 1/2 of the rolls. I covered this with about 1/2 of the butter mixture and a few more nuts. Then the last layer of rolls, butter mixture and just a tiny bit of nuts. Let it sit out overnight (it was pretty high the next morning). Put it into a 350 degree oven and baked for 15 minutes then put foil on and baked for about 20 more minutes since it was pretty full. Then I turned off the oven and let it sit for about 10 minutes before I turned it out. Wonderful! No sticking to our pan (a pampered chef bundt pan) and it was baked all the way through!! The family could not get enough of it! Not gummy or dry in any areas. I think we will have to do this one again for Christmas morning although it might be a hard choice between this and our traditional orange ring! This was much easier to make since you do it the night before! I would definitely suggest melting the sugar/butter/cinnamon together and then when a bit cooled add the pudding in and mix very well. It was awesome! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1849963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T18:16:25.443Z",
                "reviewBody": "Excellent. Like a previous reviewer, I didn't think it was going to work because the mixture looks so dry but I'm a believer now! I found this to be very gooey and delicious. I cut each roll into 4 pieces with kitchen shears which allowed more edges to be coated with the mixture.  I will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BDEGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-18T21:36:16.217Z",
                "reviewBody": "I have made this every Christmas and New Year's eve for more years than I care to admit! It has always been a favorite of the family to have these hot dribbling rolls on Christmas morning and open our \"Santa\" presents. I use 1 pkg. Bridgford frozen rolls, 3/4 white sugar, (but will try brown sugar next time), 2 TABLESPOONS Cinnamon. I also use COOK NOT instant butterscotch pudding and pecans instead of walnuts.  They are easy and truly delicious!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KANDALCA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-04T19:26:52.653Z",
                "reviewBody": "I am only giving this recipe 4 stars due to the fact that I too did not like the clumps of brown sugar/butter. I prefer a more gooey bread and have had it that way in the past. Every time I have tried to make Monkey Bread I have not had much success but this was closer than any other I have tried. I didn't have time to read all the reviews before I made the recipe but I too agree that cutting the rolls into 4 pieces and dipping them in butter would work out better than pouring the butter over the mixture in between layers. I even double the amount of butter because I thought the mixture looked dry before I baked it and it still turned out clumpy and crunchy. I think there is too much of the brown sugar/butterscotch mixture also. But I can't wait to try the recipe again as it did have an excellent flavor and will get better each time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KJGRABILL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/628583/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-17T23:57:26.89Z",
                "reviewBody": "This was soo delicious!! It was very simple to make. Frozen bread dough works so much better than the refrigerated biscuts and not as time consuming as the yeast rolls!! I will have this in my recipe box for a long time!! Kerri- IA",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WINTER123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680311/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:33:32.92Z",
                "reviewBody": "Not sure how to rate this. My kids liked it. I didn't care for the chunks of hard buttery sugar. I have a similiar recipe which calls for the pudding mix and brown sugar to be dissolved in the melted butter along with 2 tablespoons of milk. If I make it again I will also cut each roll in half as they grow quite large overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HARMONYRN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-06T19:34:36.507Z",
                "reviewBody": "I've been making Monkey Bread for years using almost this exact recipe (mine does not call for any white sugar & only a 1/2 cup of brown), but the major difference is that I've always used cook & serve butterscotch pudding.  I've been having trouble finding it, so I thought I'd give this one a try.  Next time I find cook & serve in the store I will stock up because it is soooooo much better.  Much more ooeey gooey.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bkjanke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2399871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:33:31.56Z",
                "reviewBody": "Wow..this stuff is just like Cinnabon.. it is great. Be sure to use the correct BIG pan or you will have a mess. It makes a huge amount so maybe cutting it in half so you dont have a bunch left over and can make fresh each morning would be good. IT is A MUST. Sweet sticky and a real comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Traci Quebbeman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709597/"
                }
            }
        ]
    }
]