[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17021/meat-and-poultry/pork/ground/",
                    "name": "Ground Pork Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11876/three-meat-cannelloni-bake/",
        "name": "Three Meat Cannelloni Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8239846.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-03-24T16:14:58.000Z",
        "description": "This dish is best made with fresh noodles. You can substitute one pound of cannelloni pasta cooked according to package directions, then proceed as directed.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup minced onion",
            "½ cup minced celery",
            "⅓ cup minced carrot",
            "2 tablespoons olive oil",
            "2 cloves garlic, minced",
            "12 ounces ground veal",
            "12 ounces ground pork",
            "12 ounces lean ground beef",
            "½ cup white wine",
            "1 cup beef broth",
            "2 teaspoons chopped fresh rosemary",
            "1 teaspoon Italian seasoning",
            "1 bay leaf",
            "salt to taste",
            "ground black pepper to taste",
            "2 egg yolks",
            "2 tablespoons butter",
            "2 tablespoons all-purpose flour",
            "1 cup milk",
            "¼ teaspoon freshly ground nutmeg",
            "¾ cup grated Parmesan cheese",
            "¼ cup chopped parsley",
            "4 cups tomato sauce",
            "½ cup heavy whipping cream",
            "1 pound fresh pasta sheets"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a deep skillet.  Add onion, celery, and carrot, and cook over moderate heat until softened. Add the garlic, and cook 1 minute.  Add veal, pork, and beef.  Cook, stirring occasionally, until meat is no longer pink.  Add wine, and reduce for 1 minute.  Stir in broth.  Add herbs, bay leaf, and salt and pepper.  Bring the mixture to a boil.  Reduce heat, cover, and simmer for 15 minutes.  Uncover, and reduce until almost dry.  Discard bay leaf.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt the butter or margarine in a saucepan set over moderately low heat.  Whisk in flour for approximately 2 minutes.  Whisk in milk, grated nutmeg, and salt and pepper.  Simmer, stirring occasionally, for 5 minutes or until thickened.  Stir in parsley and 1/2 cup Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the cooled meat mixture to a large bowl.  Mix in egg yolks.  Mix in the cheese and parsley sauce.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the tomato sauce and cream, set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the pasta sheets crosswise into 5 inch lengths.  In a pot of boiling salted water, cook the noodles a few at a time until al dente.  This should take only a minute or two with fresh pasta. Transfer to a bowl of cold water.  Spread the noodles in one layer on paper towels to drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon 1/4 cup of the filling down the center of one noodle, and roll the noodle to enclose the filing. Transfer the cannelloni, seam side down, to a well buttered gratin dish. Repeat with the remaining noodles and filling, arranging in single layer. Ladle the tomato sauce over the cannelloni, and sprinkle with the remaining Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (205 degrees C) for 10 minutes, or until bubbling.  Run under the broiler about 4 inches from the heat for 2 minutes, or until golden.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Ground Pork Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.675925925925926,
            "ratingCount": 108,
            "itemReviewed": "Three Meat Cannelloni Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "861.1 calories",
            "carbohydrateContent": "51.4 g",
            "cholesterolContent": "250.3 mg",
            "fatContent": "50.3 g",
            "fiberContent": "4.5 g",
            "proteinContent": "47.2 g",
            "saturatedFatContent": "21.9 g",
            "servingSize": null,
            "sodiumContent": "1338.9 mg",
            "sugarContent": "11 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-14T16:45:42.827Z",
                "reviewBody": "Another reviewer put it very aptly...this is heaven on a plate! I doubled the garlic and the rosemary added spinach and chopped mushrooms to the meat mixture accidentally added the Bechamel Sauce in with the Tomato Sauce (to which I also added fresh basil more wine ( a Pinot Grigio) and so I had to prepare a bit more of a roux... added that into the meat mixture along with the egg yolks and more parsley. I used alot more Locatelli Romano cheese in all places... and topped the dish with shredded Mozzarella before baking for 20 minutes. Holly this is an exceptional recipe! I would encourage anyone with a bit of time on their hands to try it. It will not disappoint. I ended up turning my sauce for this dish into a Parma Rosa type of thing and it was excellent. I also used the Manicotti Shell recipe from this site... and pulsed the meat mixture in my food processor for the type of cannelloni meat texture that I am accustomed to. What a deliciously light and rich (at the same time) dish we enjoyed! This was even better the next day! My family says I outdid myself here. Served with a 1986 Robert Mondavi Gamay Rose a Caesar Salad and toasted Italian Bread smothered with Garlic Butter also from Allrecipes. THANK YOU!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~TAYLOR~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-29T22:24:12.75Z",
                "reviewBody": "this is so delicious! Thank you Holly. some changes I've made: it didn't seem right to me to cook vegetables first before adding meats. so I cooked them separately and then mixed together. Instead of celery I added mushrooms( we're not big fans of cooked celery). I also used mozzarella cheese instead of parmesean which suits our tastes better. One other change I would make next time is use a little less of the tomato and whipping cream sauce over cannelloni since the meat mixture is soooooo good and the sauce overpowers it a little. otherwise so wonderful. thank you so so much HOlly. My husband really liked it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "marinushka24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-27T11:10:10.083Z",
                "reviewBody": "This was heaven on a plate! Took forever to make but it was worth it. I followed the recipe almost exactly except I used equal amounts of beef and pork and skipped the veal. I also added some extra garlic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Always Cooking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/87592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-01T21:42:57.92Z",
                "reviewBody": "This was fabulous. This is the first cannelloni I have made (tried a manacotti from this site...which was great). I did not use the celery (not a fan of) and used a little bit of spinach. This was so good when my husband took some leftovers to work...his co-workers asked for the recipe from the smell of it. Thanks for the post...definately will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T23:58:20.747Z",
                "reviewBody": "Making this dish wasn't quick or easy but the recipe was a breeze to follow! Thank you Holly! Over time I've made some changes to suit my tastes. I drain the meat after it's been browned increase the parsley-cheese sauce by about 50% make my own pasta (using a pasta machine - level 3 - boil for 4-5 min) and use Classico tomato-basil sauce and light alfredo sauce instead of the tomato cream sauce. It's best to heat the alfredo separately and pour on just before serving. If you make your own pasta you may want to do it a day ahead of time - this dish takes a few hours to prepare. It's worth every minute of it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEATHERG3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554718/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-14T16:39:35.747Z",
                "reviewBody": "I have never taken such a long time to prep a dinner. But this was well worth all that time. I did follow the directions almost exactly. The only difference was I used turkey in place of veal and I doubled the Parm sauce and put half in my jazzd up tomato sauce. I also used a stick blender to really break up the meat after it was cooked. I think that made the texture fantastic. The flavor was also fantastic. I had never made or even had cannelloni before. But this is definately a first of many. next time I may try my hand at rolling out the dough myself. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookinme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1741728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-24T19:53:38.577Z",
                "reviewBody": "Terrific filling. I agree with HeatherG3 - drain the meat mixture before adding the wine. I too added a little frozen spinach to the meat mixture once you set it aside to cool. (Thaw and completely sqeeze the frozen spinach to remove the excess moisture.) I used large won ton wrappers instead of making the cannelloni crepes. Makes rolling the cannelloni a breeze. I also followed HeatherG3's advise and mixed a jar of spaghetti sauce with alfredo sauce to make a \"pink\" sauce. I used the dry Knorr Alfredo Sauce packaged mix followed the directions and added the spaghetti sauce at the end. I made the cannelloni a day ahead and stored the rolls in a plastic bag which I had sprayed the inside lightly with PAM. The next day I removed the rolls covered with the sauce and baked (covered)until bubbly. I finished off as recommended by Holly. One trick I wished I had done was to placed the cooled meat mixture in a food processor to make the filling extra smooth. I don't have a processor big enough to hold all the mixture and didn't want to do it in batches. A smoot meat mixture just adds a touch of extra creaminess to the dish. Awesome dish and my family raved about how delicious it was. Thanks Holly!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jensenly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jensenly/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-18T13:45:15.953Z",
                "reviewBody": "My first real Italian cooking attempt and it was worth every minute it took to do it. I followed the recipe exactly except I made my own pasta because I couldn't find fresh pasta sheets and I did add some grated cheddar & mozzarella on top during the last 5 minutes of baking. I would definitely use all the vegetables; they are diced so you don't crunch down on anything and I think it is essential to the base flavor. Do cook the meat and vegetable mixture until nearly dry. I definitely will not use as much meat next time; I won't use a total of more than a pound. My family raved and we all loved the flavor of this dish. The recipe is well-written and easy to follow and if you follow the instructions you will not be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYLOOHOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-13T18:52:12.827Z",
                "reviewBody": "Step 1 I used spinach instead of celery. I cooked the vegetables separately from the meat & set aside. I used 1 lb of beef & 1 lb of pork. When the meat was done cooking I drained it. The meat mixture took much longer than 15 mins for the liquid to be reduced. It took forever to cool. Step 2 C parsley sounded like alot. I didn t have that much anyways so I only added about 2 T. Step 3 I followed exactly. Step 4 right before I was about to serve the meal I put 1 C tomato sauce with 2 T half & half in a saucepan & heated it up. I don t like sauce so that was just for my husband to spoon onto his food. Step 5 is where I messed up. I couldn t find cannelloni my husband who told me manicotti is the same thing. I think I boiled the manicotti too long because it fell apart. Step 6 the manicotti that didn t break was stuffed with the filling & 1 13x9in pan was filled in a single layer. We used all the broken noodles to make lasagna in a second pan. No sauce. Step 7 I baked it according to the directions & added freshly grated cheese before I put it under the boiler. I think I d skip the boiler part next time & add more cheese. So a day ahead it took me 2 hr to do steps 1-3. I refrigerated the meat mixture. The next day I did steps 5-7 it took about an hr. I don t know where I went wrong with the noodles. I think I might just boil some penne & mix in the meat mixture & serve it like that with sauce on the side. This was very delicious & we loved it. Thanks Holly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snowflake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1279509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T18:08:25.08Z",
                "reviewBody": "The directions for this recipe are difficult to follow and I had to read them 3 and 4 times to ensure I was following the accurately. This recipe should be split into sections: How to prepare the meat and how to prepare the sauce. Even having read the directions before I started I found them confusing the and amount of time given from start to finish must be if you already have the recipe memorized. I will say this given all my negative comments \"It is good food but the directions are random and inconsistent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Adrian Massi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6553144/"
                }
            }
        ]
    }
]