[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15075/french-pastry-pie-crust/",
        "name": "French Pastry Pie Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F117975.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-03-25T02:35:59.000Z",
        "description": "My mom found this recipe several years ago, and I still use it today.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 pie crusts",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 ½ teaspoons salt",
            "3 tablespoons white sugar",
            "1 cup shortening",
            "1 egg",
            "1 teaspoon distilled white vinegar",
            "5 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine flour, salt, and sugar. Mix well, then cut in shortening until mixture resembles coarse meal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine egg, vinegar, and 4 tablespoons of water. Whisk together, then add gradually to flour mixture, stirring with a fork. Mix until dough forms a ball. Add one more tablespoon of water if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Allow dough to rest in refrigerator 10 minutes before rolling out.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.774238227146815,
            "ratingCount": 722,
            "itemReviewed": "French Pastry Pie Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "212.1 calories",
            "carbohydrateContent": "20.3 g",
            "cholesterolContent": "11.6 mg",
            "fatContent": "13.4 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "223 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-22T23:55:52.14Z",
                "reviewBody": "This crust was great! Great flavor even though it doesn't have any butter in it.(I'm a true butter lover) And it has a great texture, tender and flaky. The key is to not over work it. When I added the liquids and stirred with a fork to get everything somewhat mixed, I then dumped the dough onto a piece of cling wrap where I used it to lightly squeeze it together until it formed a nice ball. If you knead this dough too much it flatten all the shortening pieces. Therefore you won't have anymore flaky, just tough. The cling wrap trick also helps in not adding extra flour as you do when you knead, and that can also make a tough dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LFLOWER75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T11:58:20.06Z",
                "reviewBody": "THIS IS THE FIRST TIME I HAVE EVER THOUGHT ABOUT REVIEWING A RECIPE (AND BELIEVE ME I HAVE USED QUITE A FEW GOOD ONES), BUT THIS ONE WAS WORTH THE TIME AND EFFORT.  YOU MUST UNDERSTAND THAT USUALLY I WOULD NOT BOTHER TO REVIEW A PRODUCT IF I HAVE TO BECOME A MEMBER, BUT AGAIN I PUT THAT ASIDE BECAUSE I WAS SO ANXIOUS TO REVIEW THIS CRUST.  I HAVE NEVER BAKED A PIE CRUST BEFORE AND FRANKLY I WAS SCARED TO DEATH TO TRY, BUT I READ THIS ONE AND DECIDED TO TRY IT; THAT WAS THE BEST CHOICE I COULD HAVE MADE.  THIS CRUST WAS LIGHT AND VERY FLAVORFUL.  I MUST ADMIT I DID USE CHILLED BUTTER INSTEAD OF SHORTENING.  REGARDLESS, THIS CRUST IS SUPERB AND EVERYONE WHO HAS TRIED THIS CRUST RAVES ABOUT IT.  THANK YOU TO WHOMEVER SUBMITTED THIS RECIPE BECAUSE IT IS A KEEPER THAT I PLAN ON PASSING DOWN TO MY LUCKY CHILDREN.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKER1026",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-30T06:08:57.357Z",
                "reviewBody": "excellent!  Used my food processor.  Added flour, sugar, salt and butter and pulsed until bread crumb consistancy.  Added liquid down the funnel.  Took less than 2 minutes!  Baked it as an apple pie.  Beautiful flaky pastry with next to no effort.  A have to try recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T23:33:54.31Z",
                "reviewBody": "I use this pie crust for every sweet pie that I make. I love it because it compliments the filling perfectly! For easy cleanup and rolling, I place the dough in a huge gallon ziplock bag, place it in the freezer to chill for 15 minutes, and cut the ziplock bag on two sides. So, the pie crust dough is in between the two layers of plastic and its wayy easier to roll out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1504541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T17:24:27.083Z",
                "reviewBody": "Outstanding recipe. It's amazing what the addition of an egg and a little vinegar do to an ordinary pie crust. Easily the best dessert pie crust I've ever made or eaten. This is the ultimate crust for \"Grandma Ople's Apple Pie\" (available on AllRecipes).  Also, through a successful experiment, I discovered that if one follows this recipe, but reduces the sugar to only one tablespoon (instead of three), the result is an incomparable crust for chicken pot pie. Print this recipe and DO NOT LOSE IT!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UNCLEBEN1980",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/794663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T12:16:13.7Z",
                "reviewBody": "I discovered this recipe a few months ago while looking for a blueberry pie recipe. The reviews suggested using this crust. I am so thankful!\r\n\r\nHaving never made pie crust before I had a backup plan; a store bought crust to use when I screwed this up. \r\n\r\nTo my delight, the store bought remains in my freezer. \r\n\r\nThis is the most delicious pie crust. I have made probably 30 pies in the past 2 months and every one has been consistent. \r\n\r\nI always use 5 tablespoons of ice water and just mix till everything is combined. I try not to overwork. Sometimes the dough appears crumbly in the bowl, but I just push it together, roll it and the results are a perfect, flaky crust every time. Everyone comments on how delicious the crust is!  \r\n\r\nThank you TJ, I will never forget you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Randi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/642710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-02T17:53:33.327Z",
                "reviewBody": "my late cousin used to make a similar crust with the vinegar and egg.  This is a wonderful recipe.  I used the butter flavor crisco, as it gives crusts a beautiful golden color as well as add flavor.  This baked up so beautifully; was used for a lemon meringue pie.  I prodded the bottom with fork and for the first time ever I've not had a crust shrink away from the sides!....just wonderful and this is what I will use from now on.  I used other reviewers' suggestions of: #1.  toss the wet and dry with 2 forks, as it limits the handling of the dough (works wonders!)  #2.  put dough in a ziplock bag, sealed it, and rolled it out with rolling pin and put in fridge.  I just cut the one side of the ziplock bag and placed in a pan...that's another great tip!  thanks for the best recipe and thanks to the others for great tips!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-08T01:23:35.467Z",
                "reviewBody": "This pie crust was quick and not too difficult to make! i thought that it'd be a lot harder, since i've tried and failed with other recipes at making pie crusts from scratch.\n\nI substituted 50ml of the shortening for 50ml of butter for colour and flavour. Also, I brushed an egg wash over top of the crust before I popped it into the oven.\n\nThe suggestion to wrap foil over the edge of the crust is a good suggestion, but unecessary. I followed the suggestion and wrapped foil over the edge of the pie crust I made, but when I put it into the oven, half of the foil fell off. I am a very lazy person so I decided not to fix the foil. When the pie was done baking, I found that the side of the pie where the foil remained wrapped.. was very pale and not very nice in colour; however, the side where the foil fell off was beautifully goldened! It's up to you~ but the next time I make this crust, I'm not going to wrap the foil around the edge of the crust.\n\nOOH! Almost forgot! Do not be alarmed if the dough doesn't \"form a ball\". When I did it, I used all 5 tablespoons of water, but it still didn't come together to \"form a ball\". After you refrigerate it, it will be \"easy as pie\" (pardon the pun) to roll out.\n\nOH! and I rolled out the dough between 2 pieces of wax paper too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:26:33.543Z",
                "reviewBody": "After reading reviews I used half butter and half shortening. The crust tends to brown quickly so I suggest covering edges with foil. I found it a bit too salty so I cut the salt in half also. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-05T00:34:51.540Z",
                "reviewBody": "Welll..\nA few tips for beginners.\nI wouldn't say this is the best pie crust recipe I've ever used, but it worked well enough and got the job done.\nFirst of all, this looks like a giant crumbly mess in the bowl. Which is intimidating. Get it together, dump it out onto some Cling wrap, and roll into a ball like that. \nKeep it in the fridge for about 15 minutes. The cold helped mine with the moisture problem.\nRoll it out the best that you can. I found mine to work much better just putting the dough into the pan and spreading it out that way.\nIt comes out beautifully, although in my case, it took some work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyndsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1913363/"
                }
            }
        ]
    }
]