[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7128/malasadas/",
        "name": "Malasadas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2925669.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "1999-04-04T21:51:51.000Z",
        "description": "Aloha! Here in Hawaii, malasadas are the ONLY donuts we have! They are sold at fundraisers and are very popular. There are many Portuguese descendants in the islands.  Onolicious!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "7 dozen",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 teaspoon white sugar",
            "¼ cup warm water (110 degrees F/45 degrees C)",
            "6 eggs",
            "6 cups all-purpose flour",
            "½ cup white sugar",
            "¼ cup butter, melted",
            "1 cup evaporated milk",
            "1 cup water",
            "1 teaspoon salt",
            "2 quarts vegetable oil for frying",
            "2 cups white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast and 1 teaspoon sugar in 1/4 cup warm water; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In small bowl, beat eggs until thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put flour in large bowl, making a well in the center. Into the well add yeast, eggs, 1/2 cup sugar, melted butter, milk, 1 cup water, and salt.  Beat thoroughly to form a soft, smooth dough. Cover, let dough rise until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil to 375 degrees F (190 degrees C). Drop dough by big teaspoonfuls into oil, fry until golden brown. Drain on paper towels, shake in a bag of sugar to coat, and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "IDAJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.317647058823529,
            "ratingCount": 85,
            "itemReviewed": "Malasadas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "88.5 calories",
            "carbohydrateContent": "13.2 g",
            "cholesterolContent": "15.6 mg",
            "fatContent": "3.3 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "40 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-24T14:52:07.127Z",
                "reviewBody": "I am Portuguese and grew up on these homemade malasadas.  I am very excited to try this recipe as my mom's recipe died with her.  In reference to the earlier reviewer asking for more directions, after years of helping my mom with these, I can tell you this.  The dough should be of a light and fluffy consistency (similar to pretzel dough)with a good deal of gluten for stretching and you should dip your hands in a bowl of milk prior to working with each ball of dough.  This prevents any sticking and makes the dough more manageable. When starting, it's best to start with a ball of dough slightly smaller than a tennis ball.  Holding the ball in your fingertips, thumbs on top, start stretching the dough with your middle finger tips from the underside center out.  You should end up with piece of dough that is roughly the size and shape of a large slice of bread and almost see through in the middle with a thicker edge all along the sides.  This outer rim/edge will fry to a golden brown and the inner thin piece will stay a pale color.  This is the classic look of the Azorean malasadas.  When turning them over in the oil, be careful not to pierce the dough or the oil will seep in and ruin the flavor and texture.  I am giving this recipe 5 stars on nostalgia alone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/281586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-21T04:39:44.467Z",
                "reviewBody": "I use to live in Hawaii, on the Island of Oahu. I can personally tell you these Malasadas are outrageously DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLUEYZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-02T01:15:40.1Z",
                "reviewBody": "I give this on 5 stars for flavor. I did add quite a bit more flour to make a rollable dough.  After the dough had risen once, I punched it down and divided it into two pieces.  Each half I rolled into a rectagle about 1/4 inch thick.  I cut each rectangle into squares, places them on parchment lined pans and let them rise again before frying.  They were wonderful.  We just got back from Hawaii and I was very pleased with the flavor of these.  Thanks for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyn Schiebel Evans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660268/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-09T21:45:18.763Z",
                "reviewBody": "NO..No..No!!! Those of you who said to either throw the malasdas out if not eaten the day of baking or to save the dough PLEASE don't do this!!! I'm from the Azores and both of my grandmothers make malasadas on a monthly bases. The dough does not keep well in the fridge. If you have extra try this instead. Malasadas (once made) freeze well, this is why my grandmothers make them on a monthly bases. Second if they're a day old or older pop them in the micorwave for a couple of seconds this freshes them up but don't do it to long or wait long after you take it out to eat...if you do it becomes too chewy or even to hard to eat.  If you want to try a little something extra when they're old add a little butter and sugar before microwaving, my sisters and I used to do this all the time for breakfast(ps. a good scoop of vanilla ice cream instead of sugar when they first come out of the frier is a great treat, too).\r\nTo the one who wanted more dirctions, I undersatand how you feel most Portuguese girls learn all this stuff by watching the mothers and grandmothers, and there's no measuring with cups and spoons, it's a little of this or that. If your dough was watery add about 1/2c of flour to it(kneading in betwean each addition) until it becomes more like a  sticky bread dough and it's better to use your hands then a mixer. Make sure you have a small bowl of water (for your fingers) and two forks(for exra spreading and flipping) handy when you start.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azoresmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7167635/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-29T17:52:22.977Z",
                "reviewBody": "...I tried these last night and did not care for this recipe! I believe they would taste absolutely wonderful if someone would explain the procedure better. Exactly what consistancy in the batter are we looking for? What kind of blade on the mixer hook or paddle? Mine was a little thicker then pancake batter and they were oil soaked. I'd love to try them again if someone would share their knowledge and tips like the reader who added more flour and rolled it out...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "pieman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2570272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-07T07:54:04.95Z",
                "reviewBody": "This was a great recipe--I hadn't tried to make these for over 20 years and I'm glad I finally did! My husband loved them. We used to get them at Leonard's Bakery in Hawaii but I think these are better! I guess I'll be making them more often since we haven't lived in Hawaii for over 30 years!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KK_NAGATA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/332111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T18:32:16.73Z",
                "reviewBody": "I made these and they were excellent. I read all of the reviews and used some of the tips posted. Most important is DO NOT expect this to be like bread dough; it will be very sticky and does not form into a ball easily. Only changes I made to recipe were to use RapidRise Yeast and I added an additional 1/4 cup sugar. I did not try rolling out the dough; I left it in the bowl and scooped up small teaspoonfuls and dropped them into my Fry Daddy; it worked great. I then filled a small brown paper bag with a cinnamon/sugar mixture and shook each one in the bag to cover. This makes ALOT of dough; I just kept it in the fridge and I got 3 days worth of malasadas out of it.  Worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azbelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6255485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-21T05:02:01.14Z",
                "reviewBody": "These remind me of my youth in Honolulu. My mom used to make these all the time but when we moved she lost it. Now thanks to the Internet I am able to make these yummy donuts for my daughter; she just loves them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AERYNSAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/181407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-05T11:18:50.187Z",
                "reviewBody": "These were good. I never had the traditional ones before. I would also halve the recipe. We ate on them for several days. I would reccommend keeping batter in refrigerator till you are ready to cook. And then only cook what you will eat that day. After the 3rd day they became hard. I made them small so they would cook thoroughly. On some of the bigger ones the center was still a little doughy. The boys did not seem to mind. They said they liked them that way. Thanks for the recipe. I will probably make this recipe again because our boys did like them alot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn Scott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/150126/"
                }
            }
        ]
    }
]