[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
                    "name": "Fudge Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17151/desserts/candy/fudge/chocolate/",
                    "name": "Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9420/old-fashioned-chocolate-fudge/",
        "name": "Old-Fashioned Chocolate Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F09%2F20%2F6170-old-fashioned-chocolate-fudge-beth-j.jpeg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-04-12T03:24:45.000Z",
        "description": "This fudge is easy to make and very delicious. Enjoy this with your loved ones. For best results be sure to use a candy thermometer.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "60 squares",
        "recipeIngredient": [
            "2 cups white sugar",
            "½ cup cocoa",
            "1 cup milk",
            "4 tablespoons butter",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease an 8x8 inch square baking pan. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine sugar, cocoa and milk in a medium  saucepan. Stir to blend, then bring to a boil, stirring constantly. Reduce heat and simmer. Do not stir again.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place candy thermometer in pan and cook until temperature reaches 238 degrees F(114 degrees C). If you are not using a thermometer, then cook until a drop of this mixture in a cup of cold water forms a soft ball. Feel the ball with your fingers to make sure it is the right consistency. It should flatten when pressed between your fingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat. Add butter or margarine and vanilla extract. Beat with a wooden spoon until the fudge loses its sheen. Do not under beat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into prepared pan and let cool. Cut into about 60 squares.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Fudge Recipes",
            "Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BOOK_WORM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2542857142857144,
            "ratingCount": 700,
            "itemReviewed": "Old-Fashioned Chocolate Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "36.5 calories",
            "carbohydrateContent": "7.3 g",
            "cholesterolContent": "2.4 mg",
            "fatContent": "0.9 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "7.3 mg",
            "sugarContent": "6.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-21T02:45:55.347Z",
                "reviewBody": "This is a great recipe but I think that people that aren't familiar with sugar cooking need to know that it is very difficult to make a recipe like this on an electric stove and they need to understand more about sugar crystalization. One sugar crystal in the pot after it is cooked will ruin the candy. I always make sure that I take a wet paper towel and wipe down the sides of the pot after the mixture comes to a boil to remove any undissolved sugar; I never put a spoon into the mixture after it comes to a boil (it might have sugar crystals on it) and I never stir or move the fudge after it is cooked (do not stir the butter and vanilla into it) until it is cooled to at least 115 degrees. Then, and only then, beat like mad until it loses it's gloss and then pour it quickly into your pan. It shouldn't take a long time to reach the desired temperature if the size of the pot is large enough and if it's heavy enough it will not burn. It takes about 10-15 minutes from beginning to end of cooking for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAILSELAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/294627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-24T22:39:39.987Z",
                "reviewBody": "Very difficult to make properly. I butter sides of pot after sugar is poured in so it lessens the chance of crystallization. I recommend reading further (top) reviews to ensure you follows steps properly",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cindy3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-08T17:21:13.6Z",
                "reviewBody": "Best fudge ever…hands down. Every time I make this, people say it's better than in the specialty fudge shops. I use Ghirardelli cocoa and I add a couple dashes of salt to cut the sweetness a bit. I never use a candy thermometer. Depending on the quality, they can be unreliable. I keep a shallow dish of ice water near the pan and test it periodically. I think a lot of people have failed results, because they aren't sure what exactly \"soft ball\" stage is. When you dribble the chocolate mixture in the water, it should not cloud, and will immediately form a semi-solid mass. Think of it as the consistency of a tootsie roll you've been keeping in your pocket all day. When you squeeze it, it should be soft, but you don't want it to run. Once it's reached this stage, beat the hell out of it with a wooden spoon and Voila! Gourmet fudge. It's worth the sore elbow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StephanieM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-09T10:06:16.473Z",
                "reviewBody": "I have the original Hershey tin can the recipe is on and it is a little different from this one.\n\n2/3 Cup Hershey's Cocoa\n3 Cups sugar\n1/8 teas. Salt\n1 1/2 Cups milk\n1/4 Cup Butter (1/2 stick)\n1 teaspoon Vanilla\nAnd follow her recipe when cooking it.\n\nI have made this fudge for many years.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2197921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-11T19:55:11.123Z",
                "reviewBody": "Excellent recipe. At the end, I was left with a lot of very hard, crusty remains in the pot. I was going to soak it and hope for the best but then I came up with a better idea. To clean the pot, add some milk and reheat it, while swirling it around and scraping the sides. It will all come off and you will end up with the best mug of chocolate you’ve ever had. And an utterly clean pot. I recently had a $5 mug of hot chocolate a local luxury chocolatier, and it was indistinguishable from the one I made last night with all the leftovers in the pot. Why soak it with soapy water  when you can make yourself a free mug of utterly decadent hot chocolate?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wert23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4860226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-22T02:18:13.227Z",
                "reviewBody": "I've made it twice-loved it both times! I used to watch my grandmother make fudge when I was little. I've ruined a few batches on my own.  There is nothing wrong with this recipe. You just have to be careful. Fudge can be frustrating to make. Thanks for all of your helpful tips.\n1st batch came out just as I remember it. Firm, but not rock hard, and not sugary either. I was concerned, because it was snowing at the time I made it.\n2nd batch: Snowing again. And this time I wanted it to be JUST a hair softer than before, so I took it off of the heat sooner. Too soon. It took forever to set. Both times I took it off of the heat and immediately added the butter, mixed it in, and then added the vanilla. The first time it didn't take too long to beat the sheen off of it. The second time it wasn't done, but I'm SO glad I didn't give up and throw it out! I got out my hand mixer and just mixed and mixed it...I'm guessing I mixed it for at least 20 minutes until it lost it's sheen! I kept going because I could tell that as it cooled it was thickening. The second time was much softer, and not as good as the first at all. But still worth the effort.\nI make mine on an electric flat top stove with a thermometer and the cold water test-no stirring after it comes to a boil. \nI just wanted to list both of my experiences in case somebody was tempted to throw out your fudge if it didn't seem to be setting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "erin mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2257940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T19:53:40.617Z",
                "reviewBody": "This is the same as the old world french fudge recipe that's been in my family for generations.  It does take precise timing, strong arms for the beating stage, and even a little practice.  But even the failures are delicious, testing the gooey soft-balls is fun in itself, and scraping out the pan is one of my favorite childhood memories.  This is a different world of fudge than the marshmallow creme/chocolate chip concoctions so popular now, and has a much more RICH, deep cocoa flavor.  Growing up with this fudge, I've never understood the appeal of the 'quick & easy' recipes, as fudge for us was a tradition.  I wouldn't recommend doubling the recipe in the same pan, as it's hard to beat as it is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANICASB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-22T21:58:10.803Z",
                "reviewBody": "I've been making almost exactly this recipe for 25 years using 3 cups of sugar instead of two and 1/2 cup of butter divided. It always turns out perfectly. I always add 1/4 cup of butter to the pot in the beginning and a TBSP of corn syrup once it reaches a boil. Sifting the cocoa with the sugar blends it well and helps avoid cocoa balls. I've never bothered to let it cool after reaching the desired temp, just remove it from the heat and plop in the butter and vanilla and start stirring.\nFor reference, I never use the softball method, too arbitrary. Get a good candy thermometer, and if you are new to this, cook it to 240 F.. You'll have to stir it for quite a while after removing it from the heat. If you want to shorten the stirring time a little, cook it to 242 F. but wait to do this until after you've made it a few times. No higher temperature than this though, otherwise you'll be making a rock. \nWhen to stop stirring? A lot of recipes will tell you to pour when the shine comes off but I find that's a little late. \nFor the record, the stirring is absolutely necessary. The stirring forms long crystals of sugar. The longer and more plentiful they are, the finer the grain of your fudge.\nLastly, this recipe claims to make 60 pieces...um, nope, more like 18 to 24.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Randy Schultz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2434451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T15:12:39.03Z",
                "reviewBody": "This recipe was on the Herschey's cocoa can for many years and I made it back in the 50's when I was a young girl. The marshmallow, chocolate chip recipe came out in the early 60's. I like it too, but to me it's not true chocolate fudge.As others have stated, you must leave it to cool to 110 degrees before adding butter and vanilla and then beating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARMAQUENCES2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729066/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Old-Fashioned Chocolate Fudge",
            "description": "See how to make simple old-style chocolate fudge.",
            "uploadDate": "2014-01-30T00:26:17.142Z",
            "duration": "PT2M5.958S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8cec7beb-db0d-4529-97d8-c937b08ff8a5%2F41f5e9e1-6d44-465c-b06d-2871263cc2b6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3123785661001"
        }
    }
]