[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11364/crunch-bar/",
        "name": "Crunch Bar",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F702793.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-04-14T08:06:34.000Z",
        "description": "Easy to make and tastes like a Heath Bar.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -10x15 inch baking sheet",
        "recipeIngredient": [
            "4 ounces saltine crackers",
            "1 cup butter",
            "1 cup packed brown sugar",
            "2 cups semisweet chocolate chips",
            "2 cups chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange crackers in a single layer on the bottom of a 10x15 inch pan that has sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Boil the butter and the brown sugar together for 3 minutes. Pour evenly over the crackers. Be careful it's extremely hot and sticky.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 375 degrees F (190 degrees C) for 7 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from oven and immediately sprinkle chocolate chips over hot mixture. Wait a few minutes for them to melt, then spread evenly with the back of a spoon. While still hot spread finely chopped walnuts over the top. Break or cut into desired size pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LMDINCO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.696078431372549,
            "ratingCount": 102,
            "itemReviewed": "Crunch Bar",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "253.4 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": "20.3 mg",
            "fatContent": "18.8 g",
            "fiberContent": "1.6 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "108.8 mg",
            "sugarContent": "16.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-07T23:44:12.26Z",
                "reviewBody": "Well, I LOVE this recipe. I did have to make some changes in the proportions though, which is why I didn't rate it 5 stars.  It takes at least 1.5 sleeves (6+ oz) of saltines to fill up that pan size. Definitely use foil and spray it liberally with non-stick spray.  To get the appropriate coverage, you HAVE to use 1.5 cups butter and 1.5 cups brown sugar.  I've tried it with less, and you end up with crackers with very little toffee on them.  I used a whole bag of semi-sweet chocolate chips and probably 1/2 cup milk chocolate chips, and also found that a little over a cup of finely chopped nuts was perfect.  I can't imagine using more.  So yes, I changed the proportions on everything....and the end result is perfection, in my mind.   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "REBEKAHMO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1116341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-09T14:23:52.753Z",
                "reviewBody": "I make this recipe every year and while it's simple and delicious here are a few precautions: 1. Line the tray with foil to make it easier to remove the toffee 2. Don't use those chocolate chips that have been sitting around opened for months! They will not melt as well as ones that are \"fresh\" out of the bag! 3. Up proportions to 1.5butter:1.5sugar to make sure all crackers are properly covered!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cinnybear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2095850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-06T02:38:25.233Z",
                "reviewBody": "I make these on a regular basis, but call them 'Skor Bars'.  These are always a huge hit.  One thing that is not mentioned is that your pan MUST be sprayed/greased very well, or else it all sticks.  I always use the unsalted crackers and milk choco chips (gives it more of a choco bar taste), and on occasion will use the peanut butter chips, but they don't melt as well...But still taste great!!!  Put into the freezer as soon as the chocolate is spread.  Speeds up the breaking and tasting process.  Can be kept frozen for a long time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WILDWOMAN71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/561319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-08T18:15:12.417Z",
                "reviewBody": "For starters this taste wonderful. My whole family enjoyed the taste. I did change a few things after reading all the reviews though. I lined my pan with no-stick foil it stuck. That was the first time EVER that I had anything stick to no-stick foil. Next time and I will be making it again I will use the no-stick foil and I will be spraying it with Pam first. I also used Club crackers instead of Saltines. I just thought being a \"toffee\" taste Club would work better. I also increased the sugar and butter by 1/2 cup each like some suggested. Well maybe it needed to cook a little longer because of that? There are parts of it that are pretty sticky even after spending all day and night in the fridge. I think next time I will stick with the original 1 cup of each and see how that works. Also I didn't have any problems getting the chopped pecans (I'm not a walnut fan) to stick to the top. I used milk chocolate chips and only had to let them sit for a couple of minutes before I easily spread them over the top. Then after I sprinkled the chopped pecans over the top I just used my hand to press the pecans down into the chocolate a little worked just fine. Over all this is a great recipe and it has a wonderful taste. I will be trying it again with Club crackers milk chocolate and pecans but I will be sticking to the original 1 cup each of butter and sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey Walker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/inkedtexaslady/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-25T22:36:20.047Z",
                "reviewBody": "This is an awesome quick and EASY treat to make anytime!! Everyone who tried them asked for the recipe. I will probably make a little more of the brown sugar/butter mixture(1/2 cup extra of both) to put over the top so it's more evenly covered next time. I use 1 1/2 sleeves of crackers too. Also put them in the fridge for an hour before breaking them apart. I used crushed pecans instead of walnuts. Thank you for this great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris M. Wausau, WI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1123820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-28T14:28:47.92Z",
                "reviewBody": "Wow...my husband loves toffee and he loved this. I had a box of crackers that had been crunched so I sprinkled broken crackers over the pan instead of using whole ones. It worked great. Don't use parchment because the toffee part can go under and then you have paper in your candy. Really great and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEGT2865",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ptaylor/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-15T18:51:18.39Z",
                "reviewBody": "This is fabulous!!! It is so easy to make and people can't believe what the ingredients are. I melted the butter and sugar in the microwave and I omitted the nuts but sprinkled on little colorful Christmas trees. It was a huge hit!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHANIE ROSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-07T21:24:00.313Z",
                "reviewBody": "I could not believe how super easy this recipe is. I enjoy making candy from scratch and when I saw this recipe thought I'd give it a try. Wow...yummy! I used pecans on the top. For those that do not want most of their nuts to fall off the top once the stove top cooking is done (of the toffee mixture) stir in half of your chopped nuts at this point prior to pouring on the crackers and bake it up including them. Save the remainder for topping the chocolate. It's not very heart smart but my tongue and family sure are happy! Will try it again with almonds and see if it tastes like almond roca.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "catholic soup queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1824915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-21T00:07:00.137Z",
                "reviewBody": "These are good but I think I'll add 1/2 c. of sugar and butter next time or else use a smaller pan. We left the crackers whole and cut them out into squares and dipped in chocolate. I will make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Candy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2382369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-16T01:00:59.327Z",
                "reviewBody": "I thought these sounded really good and I followed the recipe exactly (although I used pecans rather than walnuts). The crackers ended up soggy from the carmel/toffee and even though I really sprayed the pan well they were really hard to get out of the pan. These will end up in the garbage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sadie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4090469/"
                }
            }
        ]
    }
]