[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8619/baked-bar-be-que-chicken/",
        "name": "Baked Bar-be-Que Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F700228.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-04-23T12:08:13.000Z",
        "description": "This is a simple yet wonderful dish that's full of flavor. The meat is very moist and falls off the bone. We love to serve this dish in our home with rice and fresh corn on the cob.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (2 to 3 pound) whole chicken, cut into pieces",
            "2 teaspoons garlic powder",
            "1 ½ cups prepared barbecue sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken in a shallow baking dish and sprinkle with garlic powder. Cover and bake 1 hour at 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove baking dish from oven and drain any fat from dish. Pour the barbecue sauce evenly over the chicken and bake uncovered for 30 minutes at 350 degrees F (175 degrees C).  Remove and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.466905187835421,
            "ratingCount": 559,
            "itemReviewed": "Baked Bar-be-Que Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "503.5 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "141.9 mg",
            "fatContent": "28.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "35.3 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "832 mg",
            "sugarContent": "16.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-06-05T23:17:39.327Z",
                "reviewBody": "Omigod!  This is DELICIOUS!!!  I used 4 chicken dark meat quarters.  First I sprinkled them with garlic powder and chopped onion powder as well.  I preheated the oven to 350 and used a metal baking tray covered in foil.  I snapped the legs to break the bone so that I could place the chicken flatter and also, so that the spices would permeate the chicken better.  After 45 minutes I took the tray out and removed the foil.  I used chicken scissors to cut thru the skin because I knew that this way the barbeque sauce would penetrate inside the chicken better.  I used about 1 cup of barbeque sauce \"Tony Roma's Brand\".  After 15 minutes I turned off the oven...but I left the chicken inside for another 5 minutes.  Then I took it out and it tasted marvelous!  It was fall off the bone tender like the other people said.  A very sucussful recipe!  Next time I will line the bottom of the baking tray with a sheet of foil so that I dont have to scrub the tray so much during   \r\ndish washing.  This is an excellent template for just about any baked chicken recipe whether it be barbeque chiken or herb roasted chicken or pretty \r\nmuch any baked chicken recipe that does not  \r\nrequire you to de-bone the chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRAKLORD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1105724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-07T12:44:07.243Z",
                "reviewBody": "This was really good! I followed alot of people's advice...I rubbed salt, pepper and garlic powder under the skin of split breasts and baked for 45 minutes. Then I removed the skin, covered in BBQ sauce, and baked for another 15-20 minutes. It was perfect and juicy! Thanks for the recipe and thank you to everybody who reviewed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kelly1097",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2069076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T13:42:25.92Z",
                "reviewBody": "Absolutely wonderful!!  This chicken is fantastic!  So moist and flavorful....my kids ask for this often.  It's so easy too.  Also works with boneless chicken breasts (just cut the baking time in half).  Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GSPEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-31T07:52:49.097Z",
                "reviewBody": "This was pretty good. I used a pyrex baking dish and sprayed it with non-stick spray in anticipation of difficulty in cleaning as reported by a previous review. I used only chx drumsticks as that's all I had on hand 6 of them to be exact so maybe less meat than a whole chicken. I did not scale back on the BBQ sauce as I love sauce! I just eyeballed it so I think I may have used more like 2 cups......There was actually a good deal of liquid in the dish after 60 min. (I turned the chicken over at 30 min) so I had no problem with clean up. I poured off most the liquid before brushing with the sauce then continued for another 30 min. as the recipe calls for. The meat was already pulling back from the bone after the 1st hour so I turned the oven down to 245 degrees for the 30 min. with sauce. I was afraid it would be too dry but since I was cooking for myself and left overs I went ahead with the recipe's cooking time to test it out. The meat was juicy and flavorful and not the least bit dry. I did end up pulling the skin off before eating so I think I'd just do away with it in the beginning next time. Other than that I'd happily cook this for a crowd any night!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheli Morrison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-21T20:59:14.99Z",
                "reviewBody": "No snowstorm (thankfully) but we still enjoyed this.  It's pretty basic - as another reviewer pointed out, it'll be exactly as tasty as the sauce you use - but as a cooking method, it works nicely.  I used boneless, skinless chicken breasts, baked them covered for 30 minutes and uncovered for another 15.  Also, I messed up and added the barbecue sauce in the beginning; it still turned out okay, but next time I'd like to try it as written, and see how it turns out.  I used pre-made grilled chicken seasoning, garlic powder and a little cayenne, as well as salt and pepper, to flavor the chicken.  On a side note:  nonstick aluminum foil is the best invention since slow-cooker liners.  Seriously.  Buy it.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZeldaSayre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T21:12:49.077Z",
                "reviewBody": "I've made this 2 times in 5 days. My husband actually \"requested\" this for dinner tonight and I was amazed. He loved it and said it was the best BBQ chicken he has ever had...although he isn't a picky eater his least favorite food is BBQ but not anymore!! So simple too I used a whole chicken the first time and the second time I cut it directly in half down the breast bone and found it cooked better and more flavorful the second time but I attribute that to the wonderful Easy BBQ sauce I found here by Debi K....it was AWESOME. Can't ask for an easier meal and if you use foil in the pan it makes really easy clean up too!! Thanks for making my dinner menus more diverse!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHOGAN80",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/509977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T23:51:51.46Z",
                "reviewBody": "I have four picky eaters. Three of them loved this chicken the last one thought it was okay. Since I liked it too and am the cook she's going to be eating it again. Super simple to make. I took the advice of others and lined my pan with foil. I used boneless skinless chicken breasts that I cleaned and then pounded flat. I seasoned both sides with sea salt black pepper onion powder and garlic powder. I cooked it at 400F for 10 minutes pulled it out coated it with BBQ sauce put it in for another 10 pulled it out flipped them over covered the other side with BBQ sauce and gave them 8 more minutes in the oven. They were super tender and had lots of flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amberfyre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3354692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-26T04:16:56.59Z",
                "reviewBody": "This is just a good recipe for taste- but a great recipe for ease and effort. I served with Baked French Fries I and it was just what was needed for a busy mom on a weeknight. I used legs and thighs - followed others suggestions - took skin off at 1 hour and basted BBQ every 10 min for 30 min. Lined with foil for easy clean up. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jbundles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1847403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-25T12:21:19.607Z",
                "reviewBody": "I used a cut up whole chicken and was NOT impressed for some reason. I followed the recipe exactly. It was just kind of bland...especially inside the chicken. The chicken did NOT fall off the bone with tenderness like I was hoping. I won't make again. There are much better BBQ chicken recipes out there. Sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            }
        ]
    }
]