[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
                    "name": "Noodle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8656/fresh-asparagus-and-chicken-casserole/",
        "name": "Fresh Asparagus and Chicken Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2305941.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "1999-04-23T17:52:58.000Z",
        "description": "Great in the spring when asparagus first comes in and you can get it fresh.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (8 ounce) package egg noodles",
            "1 ⅓ tablespoons olive oil",
            "1 onion, chopped",
            "1 cup chopped, cooked chicken meat",
            "1 red bell pepper, chopped",
            "2 stalks celery, chopped",
            "1 cup chicken stock",
            "1 ½ cups sour cream",
            "½ teaspoon dried oregano",
            "1 pound fresh asparagus, trimmed and cut into 2 inch pieces",
            "8 tablespoons grated Parmesan cheese, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 1 1/2 quart casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook noodles in a large pot of boiling water for 5 minutes, or until almost tender. Drain, and rinse under cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a heavy skillet over medium heat. Cook onion for 4 to 5 minutes, stirring frequently. Add chicken, red bell pepper, celery, and chicken stock. Bring to a boil, and simmer for 5 minutes. Stir in sour cream and oregano.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread half of the chicken mixture into the prepared dish. Arrange the asparagus over the chicken, spread cooked noodles evenly over the asparagus, and top with 5 tablespoons of Parmesan cheese. Cover with the remaining chicken mixture. Sprinkle with the reserved Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 30 minutes in the preheated oven, until lightly brown.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Noodle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KMSMOKEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8438818565400843,
            "ratingCount": 237,
            "itemReviewed": "Fresh Asparagus and Chicken Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.4 calories",
            "carbohydrateContent": "32.7 g",
            "cholesterolContent": "76.6 mg",
            "fatContent": "20.1 g",
            "fiberContent": "3.6 g",
            "proteinContent": "17.3 g",
            "saturatedFatContent": "9.8 g",
            "servingSize": null,
            "sodiumContent": "322.8 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-06-02T23:17:14.717Z",
                "reviewBody": "This is a great meal when slightly altered, even my picky hubby liked it.  I boiled the chicken to cook it, and added 2 boulion cubes.  I used that as my chicken stock.  I also boiled the asparagus for a few minutes in the stock, before adding it to  the mix.  I sauted the celery with the onion and added 2 cloves of garlic.  I also added salt, pepper and basil along with the oregeno.  My biggest diversion from the recipe was the addition of cream of mushroom.  When I added the sour cream, it became very grainy and watery, so the cream of mushroom definitely helped.  I think any cream of would do.  I mixed everything together, and didn't layer it as described.  finally, I topped it with a fancy shredded parm and romano.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-22T22:51:15.123Z",
                "reviewBody": "I thought this was a great recipe except I made a few changes to what I had on hand and what we prefer.\r\nI omitted the peppers and celery since I didn't have any and replaced with chopped onion, sundried tomatoes and mushroom. sauteed all veggies in olive oil (including the asparagus) and fresh chopped garlic, red pepper flakes before adding to sr.cream mixture. substituted 1/4 cooking wine & 3/4 cup broth. added can of cream of chicken soup with sour cream to give more sauce, I didn't think the sour cream would be enough and would dry up while cooking. I also substituted 1/2 cup basil (or cilantro) for oregano because those spices are our favorites and oregano is pretty bland. I also added some monterey jack and some crushed french fried onions to the top after putting it all together in the pan, I used a 9x13 casserole dish.  This was one of the best dishes I've ever made and will certainly make it many times in the future. My husband also loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JFREDWOOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-04T00:11:30.453Z",
                "reviewBody": "Everyone loved this dish.  It does take quite a bit time to prep the dish but well worth it.  I made it a little easier by just mixing the sauce with the noodles and pouring it into the casserole dish.  I then just cut up the asparagus and stuck the pieces into the casserole.  This is a yummy casserole!!!  I used fat reduced sourcream and wholegrain egg noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBERLYSAINT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1001908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-21T01:21:11.283Z",
                "reviewBody": "I almost feel guilty reviewing this recipe because I changed it up so much! But the basics were there - chicken, asparagus, sour cream, parmesan and noodles. What I changed was in response to the reviews as to it being runny. Instead of using chicken stock, I used a can of cream of mushroom soup. I also sauteed the asparagus along with the onions and added garlic and mushrooms, omitted the red pepper (yuck!). Then instead of putting it in a casserole, I dumped it all in a crock pot and cooked it on low for 5-6 hours. Turned out great - flavor wasn't bland at all and it was saucy instead of soupy. I'd make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOONNOODLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/522319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T22:16:31.7Z",
                "reviewBody": "Very Good... I used 1 cup sour cream and 1/2 cup mayonaise instead and thickened the sauce with flour & milk before assembling. I increased the noodles to 12 oz and assembled it in this order noodles chicken asparagus noodles and topped it off with the remaining chicken and cheese.. It was well liked... Thanks for a great find.. Cheryl",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Leiser Harding",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-03T03:51:36Z",
                "reviewBody": "This was a great recipe I will use again.  Can't wait to try it on hubby.  The only change I made was I simmered the asparagus with the chicken stock and saute' onions and celery together and added 2 cloves of garlic to the onions and celery this brought up the flavour quite a bit.  This is a keeper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOHNA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1340979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-29T18:05:13.497Z",
                "reviewBody": "Great recipe...by following other reviewer's suggestions and changing/adding a few other things on my own this is a keeper! For starters I used at least 10 oz's medium-width egg noodles 2 cups chicken and only 1 cup sour cream. Next time I'll try 1/2 cup sour cream and 1/2 cup cream of mushroom soup to cut down on the fat a little. Along with the onion I sauteed a small (1/2lb?) box of white mushrooms. I didn't have straight oregano so I substituted 1 tsp Italian herb mix along with white pepper red pepper flakes and seasoned salt to taste. Along with the simmering chicken mixture I added 1/2 cup canned corn and 1TBSP flour to thicken. Thanx to a great reviewer's tip to speed the recipe up a bit I did mix noodles chicken mixture and asparagus all together before adding to the casserole dish;I only added 1/2 lb or so of asparagus because I wasn't sure if my husband and I liked a whole 1lb.! I topped it all off with a Parmesan/Monterey Jack cheese combo and breadcrumbs. It barely fit in a 2 quart casserole dish but aluminum foil lightly folded around the top and edges helped! After cooking it for 30 minutes the asparagus was still quite crisp which some people love but I left it in for 5-10 more minutes...really tasty. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KSHARRELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1061783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-09T19:10:01.997Z",
                "reviewBody": "this dish created soooo much water!!! I used all fresh veggies so i should've known better. the sour cream got all clumpy and gross. i dont know if i will make it again- at least change some of the ingredients first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KAILASMITH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-23T05:48:56.53Z",
                "reviewBody": "Very dee-licious! I added yellow pepper also and used fresh asagio along with the fresh parmesan. I doubled the cheese amount. Some sweet basil and garlic powder were also added. Instead of layering in dish I just mixed it all together. Lots of flavor and texture. Will make often! Thanx kathy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lesaluvscookin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594546/"
                }
            }
        ]
    }
]