[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8980/coq-au-vin-alla-italiana/",
        "name": "Coq au Vin alla Italiana",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3252700.jpg",
            "width": 1944,
            "height": 2592
        },
        "datePublished": "1999-04-23T22:12:30.000Z",
        "description": "This is a real crowd pleaser. You can add your own favorite spices, herbs or veggies to this, to your taste. Serve with mashed potatoes and cooked greens if desired. Voila, a classic gourmet chicken dinner in under an hour! (Note: you can use white chicken meat, but be careful not to overcook it - 35 minutes tops, or it will dry out!)",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 pounds dark meat chicken pieces",
            "1 tablespoon vegetable oil",
            "5 cloves crushed garlic",
            "½ cup all-purpose flour",
            "1 teaspoon poultry seasoning",
            "3 (4 ounce) links sweet Italian sausage, sliced",
            "1 cup chopped onion",
            "3 carrots, sliced",
            "½ pound fresh mushrooms, sliced",
            "½ teaspoon dried rosemary",
            "1 cup red wine",
            "1 (14.5 ounce) can whole peeled tomatoes",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat oil. Add 1/2 of the garlic. Season flour with poultry seasoning. Dredge chicken parts in flour, then brown in the skillet for 4 or 5 minutes. Add the sausage, and saute for a few minutes. Add the onion, carrots, mushrooms, rosemary and the remaining garlic. Stir all together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the wine and tomatoes; stir. Cover and let simmer over low heat for 25 minutes. Season with salt and pepper to taste and let simmer for another 10 minutes. Let cool covered for 10 minutes, then serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Add  Lim"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551181102362205,
            "ratingCount": 254,
            "itemReviewed": "Coq au Vin alla Italiana",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "616.5 calories",
            "carbohydrateContent": "20.4 g",
            "cholesterolContent": "149.7 mg",
            "fatContent": "36.9 g",
            "fiberContent": "2.2 g",
            "proteinContent": "43.5 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "518.5 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-19T18:53:14.99Z",
                "reviewBody": "SCORE for Richard! This meal rocks and I am so glad I found it here! I used a 9 qt. coated cast iron pot which after reading the raters I knew it would need. I used a 4# bag of boneless skinless thighs so easy and less fat. I added all the 5 link pack of sweet Italian sausage just because I didn't want to freeze the two left over. I like lots of sauce so I added two cans of diced Italian tomatoes instead of one. I think it's very important to add that after you brown the chicken and the sausage when you add the liquids you need to scrape the browned bits off the bottom of the pot while you stir. I don't care for rosemary so added dried thyme in it's place. Also after simmering 25 minutes I uncovered skimmed off the fat and simmered another 30 minutes uncovered till the chicken was tender but not mush. I also doubled the mushrooms just because we all love mushrooms in my family. When it was done I added a slurry of 1 Tbl. cornstarch in 1/4 C. cold water and added while stirring the pot. This gave it a thick smooth consistency which stuck to the egg noodles very nicely. My husband and sons raved! I will be making this for company or family get togethers for sure. Thank you soooooooooo much on your very different but delicious twist on Coq au Vin!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janice Wielusz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T23:22:43.187Z",
                "reviewBody": "Superb dish! This should get more than five stars. Used chicken thighs and followed the recipe to the letter. My husband thought it was excellent and could not stop talking about it all night. Served in a bowl with some crusty French bread to mop up the sauce. The flavors were incredible. Recipe was easy to prepare. This was a perfect fall dish. Next time I am going to add more Italian sausage. (I used scissors to cut each link into slices). Left the skins on so there was a little bit of oiliness but my husband liked it that way and think the skin added to the rich flavor of the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T23:42:35.797Z",
                "reviewBody": "GREAT RECIPE!!! My 'twist' on it: I put 1 cup of wine in a saucepan and simmered until alcohol was evaporated. I did not flour and precook the chicken...I just added all raw ingredients plus the wine into my crockpot and turned on high for 3 hours. When the chicken was done I made a roux of flour and water and whisked it into the crockpot. Just prior to serving I mixed in 1/3 cup of parmesean cheese. Served over mashed potatoes. SO SO SO D-E-L-I-C-I-O-U-S!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly Bonita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2542413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T23:10:08.263Z",
                "reviewBody": "Super tasty great if you are looking for a nice dinner to impress with. I used boneless chicken breast not a dark meat fan. First time I left the breasts whole and served with garlic mashed potatoes. Second time I cut the chicken into bite size pieces and served it over pasta. Great both ways!! Does make a lot too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Bloodgood Sileo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/214388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-14T00:18:19.537Z",
                "reviewBody": "I have made this several times and my family absolutely loves it. The flavor is wonderful. My husband requests this several times a month. It is easy and if there were ever any left it would make great leftovers. I use boneless skinless chicken thighs and cook much longer than the recipe calls for probably another hour or so. That way the meat absolutely falls apart and the sauce really soaks into it. I usually omit the carrots to help lower the carbs. For my husband who doesn't have to watch his carbs I serve over rice. Great job richard Thanks for our family staple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pirategirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-04T17:57:34.077Z",
                "reviewBody": "This went over very well at dinner tonight. And I even made a little mistake while cooking this. I split this into 2 pans on the stove-top and used 1 can of tomatoes (which I used diced tomatoes opposed to the whole ones) to each pan but forget to double the already prepared ingredients (didn't know I was going to wind up using 2 cans). Next time when I make it this way I will leave the carrots out completely (personal preference) add extra mushrooms onion and garlic and add some sliced zuccini and maybe some sliced black olive for color. When the chicken was done I removed the chicken and sausage from the pan and added a little flour/water mixture to thicken the sauce up. Served this with pasta (smothered in the sauce from the chicken of course!) and stuffed artichokes! The whole family went crazy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GIGI9801",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1153821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:47:10.293Z",
                "reviewBody": "Delicious especially on this early fall night. I didn't have sausages so I threw in some sage and thyme. I also slow-cooked it for about an hour -- I like the meat falling off the bone -- and served it over pasta (like Italian goulash!) and more mushrooms. Do have bread on hand to mop up the sauce. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/318877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T13:25:33.45Z",
                "reviewBody": "This was excellent. I used boneless skinless chicken breast and diced Italian Style tomatoes because that is what I had on hand. I agree with other reviewers who said to be sure and use a big pan. I used a stock pot - better too big than too small! I served it with mashed potatos and a salad and it made a wonderful meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TexasBecky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/584495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T23:11:14.483Z",
                "reviewBody": "A great twist on the classic coq au vin made with bacon. I lightened it up by using well trimmed skinless boneless chicken breasts and turkey sausage. I also thickened the sauce a little with cornstarch. Great over whole wheat pasta!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MWILLSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T18:32:18.913Z",
                "reviewBody": "Pretty good. Prefer it with white wine and thyme as well as rosemary (just a little bit of each). With some nice crusty bread this makes for a hearty comforting meal. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            }
        ]
    }
]