[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8532/easy-cheesy-chicken-i/",
        "name": "Easy Cheesy Chicken I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F273204.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-04-24T02:31:51.000Z",
        "description": "Put this in a slow cooker in the morning, and dinner is easy and delicious. Serve over rice or noodles.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "salt and pepper to taste",
            "1 teaspoon garlic powder",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (11 ounce) can condensed cream of Cheddar cheese soup",
            "1 (8 ounce) container sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse chicken, and pat dry.  Sprinkle with salt, pepper and garlic powder.  Place in slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together cream of chicken soup, cream of mushroom soup and cream of Cheddar cheese soup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low for 6 to 8 hours. Stir in sour cream just before serving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Leslye Miyashiro"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.165501165501166,
            "ratingCount": 858,
            "itemReviewed": "Easy Cheesy Chicken I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "364.2 calories",
            "carbohydrateContent": "13.3 g",
            "cholesterolContent": "101.1 mg",
            "fatContent": "19.6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "32.7 g",
            "saturatedFatContent": "9.5 g",
            "servingSize": null,
            "sodiumContent": "1146.2 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-18T23:54:13.873Z",
                "reviewBody": "I've made a this recipe several times but I really combined it with another one we like.  My two kids don't agree on very many dishes (one doesn't like chicken the other doesn't like beef dishes) but this one, they both like.\r\n\r\nWe started adding a package of dry italian dressing mix to the seasoning for the chicken.  For all of you who wrote that this recipe is bland, try that.  \r\n\r\nAnd, by family preference we don't use cream of mushroom soup (my daughter can taste/smell that ingredient from a mile away).  We use a can of cream of celery or just 2 cans of cream of chicken.  \r\n\r\nAlso, we've used fat free soup and fat free sour cream too.  It doesn't seem to affect this recipe's taste to use fat free (that lets me add bacon to another recipe later :-}).  \r\n\r\nLove it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wannabechef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wannabechef1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-13T17:03:42.997Z",
                "reviewBody": "PERFECT FOR ENCHILADAS! I don't know if it's fair to give this recipe 5 stars since I've changed it so much (per another reviewer's comments) but this is so fantastic you can't pass it up! Changes to make killer enchiladas with lots of flavor: Preheat oven to 350 degrees; after the chicken is done cooking remove it from the crock pot & shred it; in a large bowl mix together the shredded chicken the cheese mixture it cooked in & the sour cream; spread the chicken mixture into large flour tortillas & roll into burritos; place burritos on a cookie sheet; pour 1 can enchilada sauce (adjust to your tastes & # of servings) over burritos; sprinkle shredded cheese & sliced black olives over burritos; cook enchiladas in oven for 10 min. or until cheese is melted. Remove and enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1817352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:39:43.123Z",
                "reviewBody": "Loved this EASY EASY recipe! Who would have thought??? I cooked mine on high for 3 hours and during the last hour of cooking, added a bag of frozen chopped broccoli and 1/2 cup fresh, sliced mushrooms. I forgot to add the sour cream but we didn't notice it.  I may try it next time just to see how it tastes. Served with rice and the meal was complete! This is a great \"end of a busy day\" meal.  Thanks Leslye!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22503515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-19T21:46:20.013Z",
                "reviewBody": "This recipe is AWESOME. I took the chicken breasts out of the slow cooker about an hour before we were going to eat. I then added minute rice to the sauce and put the chicken back in covered and let it cook for an hour. The rice turned out fantastic. Even my 3 year old LOVES it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicolle Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nicollejoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-11T22:34:50.663Z",
                "reviewBody": "Wonderful and extremely easy! I added a package of frozen stir fry vegetables and an 8 oz can of mushrooms during the last hour of cooking. Also I only cooked this for 4 hours on high. I wanted a lot of sauce and my chicken breast pieces were pretty large so I used 2 cans of celery soup 1 can of cream of chicken soup 1 can of mushroom soup and 1 can of the cheese soup. I tasted it before I added the sour cream (light) and it tasted great but even better after I added it. I also added some crushed red pepper to give it a zing. I served this over rice. After adding the extra ingredients it needed more salt so I added a bit more. I will definitely make this again. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHILLIE72",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/620211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-01T19:03:11.06Z",
                "reviewBody": "This was easy and cheesy! HEHE! I did add one can cream of chicken soup and two cans of cream of cheddar soup to make sure it was a great cheesy flavor. I boiled up some spiral pastas and tossed them in just before serving and the kids thought it was a great macaroni and cheese. Good easy dish. I cooked mine for 6 hours and that was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-30T13:31:21.03Z",
                "reviewBody": "I liked the ease of this one. Slow cookers are great tools for working moms. I definately reccommend using the breast called for as I used bone-in thighs and breasts that I had on hand. While tasty the meat of course fell off the bone and the bone/blood juices discolored the cheese sauce making it appear unappetizing. Definately use boneless breasts! Also I actually forgot to mix in the sour cream at the end and didn't realize it till the next day! Never missed it! Great taste. Wonderful over rice or noodles. Has alot of potential for adding personal favorites - like broccoli mushrooms peas etc! Easy for a novice cook too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/349119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-17T21:12:49.483Z",
                "reviewBody": "This was very good. I could not find cheddar cheese soup so I added 4 oz. low fat Velveeta; also used low fat/low sodium soups and sour cream; added 1/4 c. white wine. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-13T03:55:27.357Z",
                "reviewBody": "You couldn't ask for an easier crockpot recipe than this. The chicken breasts were so tender you didn't even need a knife. I took the advice of other reviews and added one large bag of frozen broccoli and lots of sliced mushrooms. Next time I'll add sliced carrots as well. Definitely add veggies for more flavor - - I think it would have been quite bland with just the ingredients written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KOALAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-11T19:04:35.987Z",
                "reviewBody": "This was a fun and easy little recipe. I used cream of cheddar & chicken soup cream of mushroom soup and cream of cheddar soup to make it that much cheesier. I also added shredded cheddar cheese. To give it a little kick I stired in mild salsa (I would usually use spicy but since my son is only 2 I didn't want to make it too spicy!) I also added green & red bell peppers and onion to it. I think a jalapeno would be good too but again I didn't want to make it too spicy for my son. The salsa and bell peppers gave it a Mexican/spicy flavor which would be perfect for enchiladas as one person suggested or even just to put in hard or soft tacos. I just served ours over rice and my son LOVED it and so did I. I actually forgot the sour cream so I'm not sure how much better that makes it-will try it next time. The nice thing about this recipe is you could take it in different directions with what you add to it and what you serve it with. I may add some crumbled bacon to it next time. Thanks for the idea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TFinn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5615656/"
                }
            }
        ]
    }
]