[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17256/jos-rosemary-bread/",
        "name": "Jo's Rosemary Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F767275.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-04-24T17:33:52.000Z",
        "description": "This bread has a great flavor. It is moist, light and has a crispy crust.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 - 1 1/2 pound loaf",
        "recipeIngredient": [
            "1 cup water",
            "3 tablespoons olive oil",
            "1 ½ teaspoons white sugar",
            "1 ½ teaspoons salt",
            "¼ teaspoon Italian seasoning",
            "¼ teaspoon ground black pepper",
            "1 tablespoon dried rosemary",
            "2 ½ cups bread flour",
            "1 ½ teaspoons active dry yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select white bread cycle; press Start.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jo Lager"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.769876819708847,
            "ratingCount": 1786,
            "itemReviewed": "Jo's Rosemary Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "137.5 calories",
            "carbohydrateContent": "21.6 g",
            "cholesterolContent": null,
            "fatContent": "3.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "291.7 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-07-14T03:47:38.95Z",
                "reviewBody": "If you've ever been to Macaroni Grill, this bread is a duplicate. (Now there's no reason for me to go back...) Fabulous! I made this bread by hand, (1. yeast + 1/4 c. warm water, wait 10 min. 2. Add flour, salt, sugar, oil knead like heck. 3. Add the herbs & pepper [I used oregano insted of an italian blend, and rosemary from my own garden] and knead some more. 4. Let rise an hour or so in an oiled, covered bowl in a warm place. 5. Punch down, let rise another hour. 6. Bake at 375 until browned. 7. Remove from oven, brush with olive oil and sprinkle with coarse salt.)Serve with olive oil and fresh cracked pepper. YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TANG_29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/436558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-22T01:30:42.737Z",
                "reviewBody": "Amazing bread!  I made this by hand, so I started by proofing the yeast in the water for about 5 minutes, then added one cup of the flour, the sugar, salt, and oil and mixed in my stand mixer on pretty high speed until it was a thick creamy batter (looking almost like pancake batter), 3-4 minutes or so.  Then switched attachments to the bread hook and began adding flour gradually, along with the herbs and pepper.  Knead just until all dough pulls away from the bowl, then finish kneading by hand (about 5 minutes or so).  I make a lot of bread and bread flour is expensive, so I find it easier to buy powdered wheat gluten (which is the main extra is bread flour anyway) and add it according to the package directions (I think it is one tsp. for every cup of flour).  Also, if you are lucky enough to live near a Penzy's Spices or ever order from them online, their Tuscan Sunset Seasoning (Italian seasoning) is awesome in this!!!  I let this rise is a greased bowl for one hour, then punched down, formed into an oval loaf and let rise another hour.  I brushed with olive oil and coarse sea salt before baking, and I also spritzed this with water about 3 times during baking (it gives it that crunchy outer crust, but it still stays soft in the middle).  I baked this about 20 minutes at 375 then turned the heat up to 425 for about 10 more minutes.  Perfect, delicious bread.  My husband has already asked me to make it again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffinmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T10:13:56.147Z",
                "reviewBody": "This bread is awesome, just like Macaroni Grille!  The only change I made was using milk instead of water because it makes a more tender crust.  We dipped it in olive oil and cracked pepper and served it with lasagna.  Yummy.  It will make your whole house smell great, too!  Also makes a wonderful cheesy garlic bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TARA_BULL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T03:57:11.403Z",
                "reviewBody": "I let my bread machine mix and knead and baked it in the oven (375 degrees for 30 min.). It was great! Would be good to dip in olive oil with cracked black pepper like they do in the restaurants.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CODYSAYSHI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-23T17:45:39.107Z",
                "reviewBody": "I have no idea what Macaroni Grill's bread tastes like, but I do know THIS bread is just delicious.  It has one more tablespoon of oil than I'm used to using, but maybe that's what made this particularly moist and tender.  Using 2 tsp. of fresh, chopped rosemary, this had just the right balance of flavors. Beautiful, fragrant, and simply darn good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-09T06:25:43.17Z",
                "reviewBody": "this recipe is so easy and wonderful.  i used fresh rosemary instead of dried.  i had no italian seasoning so i added a little thyme and oregano.  i think course fresh ground pepper adds a great flavor.  do not use \"preground\" pepper if possible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LETTR6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/298900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T03:47:41.997Z",
                "reviewBody": "I probably would have given this bread five stars if there wasn't quite so much rosemary. A whole tablespoon gave it an almost medicinal taste. Next time I'll use just two teaspoons and I think it will be great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JAWANDMEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-08T20:53:30.187Z",
                "reviewBody": "UPDATE: THIS TASTES EVEN BETTER THAN MACARONI GRILL'S BREAD (I just ate there this past weekend!!!)!!!!! Wow Joe! This is darn good bread!!! I'm not sure if it tastes like Macaroni Grill's bread or not (haven't been to one in ages...), but I bet it does! Made this to go with warm bowls of Andrea's pasta fagioli (also on this site). The combination of the bread and soup was divine! My bf and I really enjoyed our dinner :) I did change things up a bit though.... I put all ingredients in my bread machine (in the order suggested by the manufacturer - wet, dry, yeast on top), turned on the dough cycle and selected the 1.5 lb. loaf setting (this took about 1.5 hours), then took the dough out, punched it down and put it in a greased (with Pam) bowl, turned to coat and covered for 10 minutes. After the dough had rested, I shaped it into a round loaf, covered, and let it rise until doubled in size (a half hour did the trick). Before placing in my 350 degree oven, I brushed the top of the loaf with EVOO and some more (crushed) rosemary and coarse sea salt to taste. The addition of the salt was deelicious and a must IMHO. One thing to note: allow your bread to cool a bit before slicing (we were too hungry to wait, but I wish we had...). Serve with a combination of EVOO, grated Parm cheese and a bit of cracked black pepper, all mixed together for dipping. I think next time I'll add about a tablespoon of Parm to the dough also... Excellent! Thanks for sharing :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-26T02:16:25.127Z",
                "reviewBody": "I am a regular bread baker and this is quite possibly the best bread recipe I have ever made.  I used fresh rosemary and did the whole thing by hand rather than using a bread machine.  The bread was delicious. It had a crisp crust and a fluffy interior. Note to beginners that are trying to make their loaves by hand:  before placing the dough in the bread pan, roll/stretch bread into a 16 by 8 in rectangle and then tightly roll it up from one of the smaller end.  Fold the ends of your roll under ensuring that the ends of the dough will still touch the ends of the pan (so that the dough has something to grip onto as it rises).  This procedure will give your bread a nice rounded shape as it rises and give you a wonderful spiraled texture on the inside.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nonsuchbaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T04:26:23.607Z",
                "reviewBody": "Very disappointing. Made this for a guest dinner and ended up apologizing for it. It is incredibly bland the crust turned out too hard and the inside was globulous to the point that I couldn't slice it decently. If you're looking for a recipe similar to this I highly recommend the Cheese Herb Bread also from this site which bakes up nicer and has a much better flavor. One of these days I'll learn to stick to ol' reliable recipes when company comes to eat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "oneposhmama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839341/"
                }
            }
        ]
    }
]