[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14723/soups-stews-and-chili/soup/chicken-soup/chicken-and-dumplings/",
                    "name": "Chicken and Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8940/lighter-chicken-and-dumplings/",
        "name": "Lighter Chicken and Dumplings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3854893.jpg",
            "width": 3245,
            "height": 3245
        },
        "datePublished": "1999-04-24T17:59:31.000Z",
        "description": "A lighter version of this classic down-home dish. One of the best comfort foods of all time!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (10.75 ounce) can  reduced fat cream of chicken soup",
            "1 (14.5 ounce) can low-fat, low sodium chicken broth",
            "½ cup milk",
            "1 tablespoon vegetable oil",
            "¼ cup chopped onion",
            "½ cup chopped celery",
            "3 skinless, boneless chicken breast halves - cut into strips",
            "1 teaspoon celery seed",
            "ground black pepper to taste",
            "1 cup sifted all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "½ cup milk",
            "2 tablespoons vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan or Dutch oven, stir together the cream of chicken soup, chicken broth, and milk. Bring to a simmer over medium heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon oil in a skillet over medium-high heat. Add chicken strips, onion and celery.  Sautee until chicken is cooked through, and onions are tender. Transfer the chicken mixture to the soup pot, and mix well. Reduce heat to low, and simmer for 30 to 45 minutes. Season with celery seed and black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Dumplings: In a medium bowl, stir together the flour, baking powder and salt. In a small bowl, mix together 1/2 cup of milk and 2 tablespoons of oil. Pour into the dry ingredients, stirring just until moistened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop tablespoonfuls of the dumpling mixture into simmering chicken stew. Cover pot tightly, and bring to a boil. Simmer for another 12 to 15 minutes - without peeking! Ladle into bowls, and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes",
            "Chicken and Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LINDAHU"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.565891472868217,
            "ratingCount": 516,
            "itemReviewed": "Lighter Chicken and Dumplings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "392.7 calories",
            "carbohydrateContent": "35.6 g",
            "cholesterolContent": "62.2 mg",
            "fatContent": "14.7 g",
            "fiberContent": "2.4 g",
            "proteinContent": "28.3 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "1275.9 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-18T15:53:00.983Z",
                "reviewBody": "Fabulous recipe, very easy, the broth is just perfect.  One thing I want to add, for people who are new to making dump;ings (most recipes for dumplings aren't newbie-friendly) is make sure your dumpling mixture is a wet-sticky dough.  If you make the dough too dry and pliable, your dumplings will come out too chewey,  A sticly-wet dough will make a soft, fluffy and delicious dumpling.  Unforunately I learned this through experimentation and not the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REBECCA70111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1244945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-16T00:44:01.467Z",
                "reviewBody": "Ok, let me begin by saying that I'm writing this review as this particular dish cools to an acceptable eating temperature.  However, I have had a few bites of it - practicing the \"reverse blow\" method - and let me tell you...it is good.  I modified the recipe only VERY slightly.  I substituded \"cream of chicken AND mushroom\" (Cambells - at Publix) for plain cream of chicken.  I didn't measure onions or celery - used 1 whole (medium) onion, and 2 1/2 stalks of celery.  I added approximately 1/3 package of sliced baby portobello mushrooms.  Can we tell I like 'shrooms?  I must admit, I did peek once after adding the dumplings, but I was afraid that if I didn't stir it at least once, something would burn.  I would suggest, you prepare the rounded dumplings while allowing the simmering process to take place.  After letting the dumplings cook, I did add a combination of 2 heaping teaspoonfuls of cornstarch + ~1/2 cup of extremely cold water = a thicker base.  Total cooking time, an hour and a half.  Then again - I was drinking bottles of Budweiser during the wait - so I didn't mind too much.  I fully intend on keeping this recipe around for a while.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAZZDOREN2K1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/479546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-14T01:07:53.437Z",
                "reviewBody": "Absolutely fantastic recipe.\n\nI'm not much of a cook; I'm the baker in the family and my husband cooks.  But he wasn't feeling well so I wanted to make him something easy and delicious and comforting.  I've never made a dish similar to this, and I expected it to be difficult, but it was very easy to make, and an absolute hit.  I omitted the celery seed; otherwise I followed the recipe as written.  The whole family loved it.\n\nMy one criticism: I would double the soup for a family of  four.  There were enough dumplings but we needed more liquid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Fisher Walters",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16592730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-06T20:41:24.69Z",
                "reviewBody": "This is one of my favorite recipes from this site. I would rate it a 4.5 if i could the only reason its not five is because I had to make a number of changes to make it really perfect. I usually add some extra veggie celery onion carrots peppers. whatever I have on hand. I also add some garlic a bay leaf and poultry seasoning. I add some fresh herbs (parsley or dill) to the dumplings. With these change the recipe is DEFINATELY a fice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1536589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T18:07:53.367Z",
                "reviewBody": "great recipe...here's a piece of dumpling technique for you...before you dip the spoon in the sticky dough to make a dumpling, stuck it in the hot broth...the dumpling will slide off the spoon like nobody's business...you're welcome...smiles",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ORVILLE76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/389544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-22T07:09:40.67Z",
                "reviewBody": "This is a definate keeper with a couple moderations. I added 2 cans of cream of chicken soup instead of 1. Instead of using chicken broth (it's so expensive in the store for just a small can) I cooked my chicken by boiling it in salted water with 4 chicken bouillon cubes. In addition to celery seed I added a pinch of sage (or about 1/4 tsp.) a pinch of garlic powder a dash (or about 1 tsp.) of basil a dash of thyme. I would omit the onion the next time. It ended up stuck to the bottom of the stew when I steamed the dumplings. In my opinion it doesn't need them. This makes a wonderful chicken stew. It's thicker than my mom used to make but frankly it's better that way! The dumplings are just like Mom made too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OHIOMOM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/922638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T23:54:33.877Z",
                "reviewBody": "Fantastic recipe! As other reviewers have done I did tweak the base to my taste but the dumplings were absolutely perfection just as written. In the end the dumplings are what make or break this recipe. I made a double recipe to feed 8 so I used a Dutch oven. Also I seared the chicken and veggies first in the Dutch oven so none of the flavor was lost removed them made the soup and added the veggies and chicken back at the point the recipe says to do it. I added sliced mushrooms to the onion and celery mix. I also added thawed frozen peas just before dropping the dumplings in. With a single recipe a large sauce pan would be fine but doubling the recipe I was glad to have the surface area of the Dutch oven for the dumplings. Finally after reading reviews I went low sodium with every ingredient and the result was not too salty at all. On a comfort food scale of 1-10 this was an 11.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lordst2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1491415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-20T22:34:17.517Z",
                "reviewBody": "Great recipe. I added 1/2 cup chopped carrots and sauted them with the celery onions and chicken. I also added an extra can of chicken broth and cream of chicken soup. This made for more broth. I added two diced and peeled potatos to the broth when I added the chicken mixture. A little parsley in the dumplings made them a little prettier. I just loved this recipe and my boys did too! I will definatly make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-14T00:29:41.723Z",
                "reviewBody": "Scrumptous! This made an excellent dinner that needed no side dishes! You have your meat vegies and bread all in one stew-like dish. This was the first time I made dumplings and it went quite well. I could have cooked them a tad longer but it was still very good. The changes I made were very minimal. Used Olive oil instead of vegie oil to cook the chicken onions and celery added rosemary to the dumplings and did not sift the flour. The next time I make this (and trust me there will be a next time!) I will double the recipe for the broth mixture (cream of chicken chicken broth and milk) because it could of used more of that and I will season the chicken breast's. I'm not quite sure with what yet but chicken is such a bland meat. It was very moist and tender in this dish though! This was also my husbands first time having chicken and dumplings (weird!) and he liked it. THe only complaint from him was also that it could've used more of the broth mixture. But anyway FABULOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tonna Jacobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7334589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-20T23:37:35.26Z",
                "reviewBody": "UPDATE! My orignal review was a five but I just made it again and realized the first time I'd forgotten to add the spices before dropping the dumplings. I wished I'd done it again this time 'cause there is WAY TOO MUCH CELERY SEED. It is completely overpowering. Don't add it at all or add only 1/4 tsp or so. Here is my review the first time around when I didn't add the celery seed: This is a really delicious easy recipe. I doubled the sauce mixture (to 2 cans of soup 29 oz of broth and 1 c. of milk) as did want more veggies in this dish and needed more liquid. So I cubed potatoes and carrots (about 1.5 cups each) boiled them for 10 minutes and then added them to the chicken soup mixture with a cup of peas (canned) just before dropping the dumplings. I also added black pepper and parsley to the dry ingredients of the dumplings for color and taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Burdett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nicoleburdett/"
                }
            }
        ]
    }
]