[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1982/meat-and-poultry/chicken/chicken-breasts/skillet/",
                    "name": "Skillet",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8546/apple-stuffed-chicken-breast/",
        "name": "Apple Stuffed Chicken Breast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1533241.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-04-26T16:31:09.000Z",
        "description": "This is a great dish for the fall.  Golden Delicious, Granny Smith, Newtown Pippin, Rome Beauty and/or Winesap apples may be used.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 skinless, boneless chicken breasts",
            "½ cup chopped apple",
            "2 tablespoons shredded Cheddar cheese",
            "1 tablespoon Italian-style dried bread crumbs",
            "1 tablespoon butter",
            "¼ cup dry white wine",
            "¼ cup water",
            "1 tablespoon water",
            "1 ½ teaspoons cornstarch",
            "1 tablespoon chopped fresh parsley, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine apple, cheese, and bread crumbs. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Flatten chicken breasts between sheets of waxed paper to 1/4 inch thickness.  Divide apple mixture between chicken breasts, and roll up each breast.  Secure with toothpicks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter or margarine in a 7 inch skillet over medium heat.  Brown stuffed chicken breasts.  Add wine and 1/4 cup water.  Cover.  Simmer for 15 to 20 minutes, or until chicken is no longer pink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer chicken to a serving platter. Combine 1 tablespoon water and cornstarch; stir into juices in pan. Cook and stir until thickened.  Pour gravy over chicken, and garnish with parsley. Serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Skillet"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Behr"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.158974358974359,
            "ratingCount": 780,
            "itemReviewed": "Apple Stuffed Chicken Breast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "139.4 calories",
            "carbohydrateContent": "4.9 g",
            "cholesterolContent": "46.2 mg",
            "fatContent": "5.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "15 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "119.6 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-07-03T04:03:45.17Z",
                "reviewBody": "It's a good base recipe, but after reading the reviews, I knew it needed kicking up a notch. So I did the following: For the stuffing, I used red delicious apples, about 3/4 C, 3 T crumbs, and 1/4 C sharp cheddar, shredded. It smelled bland. So I added about 3-4 T brown sugar, and somewhere around 1 t cinnamon. Then, I added a few dashes of my personal spice blend (which is seasoned salt, garlic powder, onion powder, pepper, oregano, basil and a dash of thyme), and it STILL needed something. McCormick Curry Powder! A couple of dashes and it was exactly what I wanted. The smell can only be described as odd and complex. I browned them in olive oil instead of butter. Doubled liquids, I used herbed chicken bouillion in place of water, and the wine was Turning Leaf Chardonnay, 2003 Reserve. I had a handful of apple chunks and slices left over, so in the last 10 minutes of simmering, I threw these into the sauce to cook, and added a couple T of brown sugar. I removed the chicken to plates when it was done, placed the cooked apple slices on top, stirred the sauce over high heat, adding a bit more brown sugar, and the sugar began to carmelize, thickening it nicely without the need for flour. I served with baby carrots and garlic bread. The sauce was an EXCELLENT complement to the carrots, and the chicken was the perfect balance of sweet and savory. If you try this method, make SURE to use McCormick curry powder! I will definitely be making this again ... MY way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SIMPLYRAINAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1417220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-17T05:37:50.03Z",
                "reviewBody": "A nice little elegant meal. The other reviewers are right make sure to brown your chicken well and there will be no issues with weird purple chicken and it will taste better. Choose tart apples that will hold their shape like a granny smith. Butterfly and pound your chicken to allow more surface area for more yummy filling. The cheese is more of a 'glue' for the stuffing and I would recomend playing with the spices such as some pepper sage savory thyme and a dash of allspice to compliment the apples. The gravy bennifits from stock instead of water and any leftover stuffing with some apple chunks. Also an alternative to serving it as a big chicken lump on a plate cut it into slices to show off the filling and pour gravy over top. Bon Appetite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETNOTHINGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-06T01:59:39.077Z",
                "reviewBody": "OUTSTANDING recipe! I made it a second time with slight variations. Added to stuffing about 2 T. shredded carrot for color and about 2 T. chopped pecans for texture. I also couldn't watch it on the stove so after browning the breasts I removed them and deglazed the pan with the wine and then added the chicken stock and corn starch brought it to a boil returned the breasts to the pan covered it and put the whole pan in a 325 oven for an hour. EASY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DGW314",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T11:55:36.483Z",
                "reviewBody": "I'm a bachelor, my girlfriend loved it. It was quick and easy. Next time, more cheese, bigger breast, and chicken broth instead of water. I presented it on a bed of rice with steamed broccali around the plate and the sause drizzled on top of the chicken. It was a hit...I am THE MAN.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JSHARPE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-07T02:08:15.983Z",
                "reviewBody": "This is a wonderful recipe! The combination of flavors and textures are so complimentary and its even easy to make. I made it for my in-laws tonight and it got rave reviews from all six of us. I made a few alterations: I added 2 tbl. chopped walnuts 2 tbl. chopped parsley and 1 tbl. of melted butter to the stuffing; I sauteed the stuffed breasts in a hot skillet until golden on each side and then baked in the wine/butter sauce in a 9X13 glass pan for 20-30 minutes at 450 degrees. Thank you for the recipe; its lovely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chouli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2336648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-15T16:43:19.72Z",
                "reviewBody": "Fabuous recipe with a wonderful combination of flavors! I swear you could put just about anything rolled up inside a chicken breast and it's bound to be good. The combination of sweet apple and sharp cheddar was definitely an indicator that this was going to be tasty so I had to give this a try and boy am I glad I did! However, I did make a couple of changes... After I pounded my chicken breasts down thin I used bread cubes vs. Italian bread crumbs for the stuffing.  I combined the dried bread cubes with the apple and some curry powder, brown sugar and a little salt.  I moistened the stuffing with some apple juice.  I used sliced sharp cheddar cheese then place the stuffing over top and rolled it together securing with toothpicks.  Half I did with the apple stuffing and cheese the other half I did with apple stuffing, cheese and of course - bacon! I dipped the chicken in egg and then plain bread crumbs to form a light coating. I then drizzled it with a little melted butter and baked at 375 for 35 - 40 mintues. For the sauce I used apple juice vs. water and a mild white wine.  I added a little poultry seasoning for flavor and added a splash of cream. The result was a very moist and flavorful chicken bursting with a delicious apple stuffing and cheese filling!  You could easily do without the sauce and it was hard to tell which we liked the ones with bacon or the ones without...either way this recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-06T22:25:46.873Z",
                "reviewBody": "EXCELLENT! I needed something a little different for chicken breasts last night and I had a couple of apples left over from a pie and instead of cheddar I used brie since that is what I had in the fridge. I rarely measure ingredients and I know I used more apple cheese. More wine and chicken broth also to make more sauce. This is a real keeper. My husband and I both just LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lee Wagar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/55309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-15T13:37:28.42Z",
                "reviewBody": "Came out very tender and seemed more difficult than it was! The only tricky part is the physical stuffing of the chicken we found that pinning each piece with the same number of toothpicks whether it needs it or not ensures you know how many you are taking out before serving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/239706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:50:02.427Z",
                "reviewBody": "The chicken was very tender but there wasn't much taste. Next time I will use chicken broth instead of water and maybe add some more spices or brown sugar. It did look impressive on the serving platter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "NJSS2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/52769/"
                }
            }
        ]
    }
]