[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17019/desserts/cookies/macaroons/",
                    "name": "Macaroon Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10344/coconut-macaroons-ii/",
        "name": "Coconut Macaroons II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4336370.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1997-12-29T16:42:52.000Z",
        "description": "This is a very simple coconut macaroon recipe that uses only 4 ingredients.  Condensed milk gives it a richer flavor than most.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "5 ½ cups flaked coconut",
            "1 (14 ounce) can sweetened condensed milk",
            "2 teaspoons vanilla extract",
            "1 ½ teaspoons almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large mixing bowl, combine coconut, sweetened condensed milk and extracts; mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop by rounded teaspoonfuls onto aluminum foil-lined and generously greased baking sheets.  Bake 8 to 10 minutes or until lightly browned around the edges.  Immediately remove from baking sheets.  Store loosely covered at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Macaroon Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Robin J."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.049689440993789,
            "ratingCount": 161,
            "itemReviewed": "Coconut Macaroons II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "131.6 calories",
            "carbohydrateContent": "17.7 g",
            "cholesterolContent": "5.6 mg",
            "fatContent": "6.2 g",
            "fiberContent": "1.7 g",
            "proteinContent": "1.8 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "69.1 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-13T14:26:42.17Z",
                "reviewBody": "I've found the PERFECT combination for this recipe.  I use 2 (14 oz) bags of Baker's brand coconut then the sweetened condensed milk and the extracts.  I chill my mixture for two hours so it's easier to work with.  I roll a teaspoon of the mixture between my palms lightly to form a ball and drop on the cookie sheets.  I bake them for 12 min at 325 degrees.  They're easier to remove from the tray if you let them set-up on the tray for 2 min. after removing from the oven.  I allow them to cool on wax paper, then dip the bottoms in melted semi-sweet chocolate and put on a wax paper lined cookie sheet in the frige.  They are incredible and look so pretty with my holiday cookies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SmilingRedhead",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1198286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T15:42:41.043Z",
                "reviewBody": "I hope those of you that had a bad first experience will try again.  I have used this recipe for my boyfriend and his father for several years and they really love them. Even though I am not a macaroon fan, they are really good.  There are a few suggestions I have to make them easier for those that complained they are too gooey.  1 - use parchment instead of foil... still grease it!  2 - use an ice cream scoop to dish the coconut mixture onto pan and press hard to firmly pack it.  3 - reduce oven temp by about 25 degrees to cook them slower... this prevents them from spreading out all over the pan.  You know they are done when the edges get nice and brown.  My boyfriend likes them even more done so that they almost look like coffee on the edges.  If I ever lose the recipe, I always come back to search for this exact one.  For special occasions, I even add food coloring to the condensed milk before stirring into the coconut!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLYDFULLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/622760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-27T18:46:31.373Z",
                "reviewBody": "I noticed that it didn't say \"firmly packed\" under the coconut amount. I have found that when I am measuring coconut I press it down in the measuring cup - that seems to give you a real amount and makes it less messy. Also you MUST lightly coat the sheet with non stick cooking spray. Those two things really add to it. You can also add some additional flour to thicken up the batter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/227703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T02:04:34.2Z",
                "reviewBody": "Delicious! This is the same recipe my mom made when we were kids. And it turns out that this is the recipe that brought me to this website for the first time. Craving \"mom's\" macaroons (but not remembering the exact recipe) I ran a query for \"coconut macaroons\" \"condensed milk\" on Yahoo and \"Shazam\" here I am! I just made a batch and they came out perfect. I used a baking stone rather than a standard cookie sheet though. The result was flawless - - no trouble whatsoever with them falling apart or sticking. I also tested \"teaspoon drops\" vs. \"rolled balls\" and both came out great. The looser drop versions come out a little crispier and the individual flakes of coconut browned rather pretty. The rolled ball version comes out a little more juicy with a more finished all-over browning affect; and a little less crispy because the flakes of coconut are pressed into the balls. If you're a coconut lover these are just to die for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EROSSI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/275271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T00:03:33.747Z",
                "reviewBody": "This is a great 4 ingredient recipe. However I have only one major complaint: Do not bake on aluminum foil. I had made these twice before right on a greased cookie sheet at the normal temperature and time and had NO problem. This weekend I tried baking them on aluminum and what a gooey mess! I had to scrape them off put them back in a bowl and make them again. I was not a happy camper but amazingly they still turned out good. N-joy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BEVALABEADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-08T06:27:28.547Z",
                "reviewBody": "With more instructions this recipe is great. Chill the batter. Use your hands to form balls and squeeze the daylights out of them to make them firm. And to avoid excess sweetness use unsweetened coconut. I like Bob's Red Mill Unsweetened Flaked Coconut. There are exactly 5.5 cups of coconut in the package so it works perfectly with a 14 oz. can of sweetened evaporated milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1889982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T07:29:16.42Z",
                "reviewBody": "The macaroons came out great! I followed the suggestions of chilling the mixture before baking. I threw it in the fridge overnight and baked them in the morning. I didn't use the easy release foil instead I greased the sheet generously. The suggestion of leaving the macaroons on the pan for two minutes does help in removing them. After removing them I placed the macaroons on a lined a sheet with wax paper and threw them in the fridge (it holds its shape better). I kept everything in the recipe the same except for the amount of coconut: I used three bags of the bakers brand flaked coconut. The batch made about 80 macaroons. I was skeptical at first but everyone who tasted it loved it...it's especially great if you dip them in chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PINEAPPLE738",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1126925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T23:24:33.107Z",
                "reviewBody": "I have been making this same recipe for myself for a number of years.  I live at an elevation of 7000 ft. so I add about 1/4 cup flour to the recipe and they hold together great!  I also sometimes dip one half the cookie in melted semi-sweet chocolate.  They really are more the consistency of a Mounds Bar.  I usually make them every year at Christmas and my family lives for them!  They really are fabulous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMIRAEJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/334151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-08T05:00:07.123Z",
                "reviewBody": "I thought this was a great recipe! I always love recipes that have few ingredients. I changed a couple things- I left out the almond extract just because I don't like the taste and I cooked for about 20 minutes at 325. These were fantastic I can't stop eating them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1974401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T19:14:28.937Z",
                "reviewBody": "sorry to go against the grain but...not a very good macaroon recipe. the only reason i gave it 2 stars is because it was so easy. the taste is not the same as the recipes with egg white. if you want a sweetened condensed milk flavor go with this recipe. however if you prefer a very coconut flavor find a recipe with whipped egg whites instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "celena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2138560/"
                }
            }
        ]
    }
]