[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8757/basil-cream-chicken/",
        "name": "Basil Cream Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4503130.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "1999-05-06T20:33:30.000Z",
        "description": "This is quick to make and tastes great. The sauce has a great Parmesan and basil flavor.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¼ cup milk",
            "¼ cup bread crumbs",
            "1 pound skinless, boneless chicken breast halves",
            "3 tablespoons butter",
            "½ cup chicken broth",
            "1 cup heavy whipping cream",
            "1 (4 ounce) jar sliced pimento peppers, drained",
            "½ cup grated Parmesan cheese",
            "¼ cup chopped fresh basil",
            "⅛ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place milk and breadcrumbs in separate shallow bowls. Dip chicken in the milk, then coat with breadcrumbs. In a skillet over medium heat, fry chicken in butter or margarine, on both sides, until the juices run clear. Remove from skillet and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the broth to the skillet; bring to a boil over medium heat. Stir to loosen browned bits from pan. Stir in the cream and pimentos; boil and stir for one minute. Reduce heat; add the Parmesan cheese, basil and black pepper. Simmer and stir until heated through. To serve, pour the sauce over the chicken.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JANETFORAUBURN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.607438016528926,
            "ratingCount": 242,
            "itemReviewed": "Basil Cream Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "493.5 calories",
            "carbohydrateContent": "9.3 g",
            "cholesterolContent": "181.1 mg",
            "fatContent": "35.8 g",
            "fiberContent": "0.9 g",
            "proteinContent": "33.3 g",
            "saturatedFatContent": "21.6 g",
            "servingSize": null,
            "sodiumContent": "515.9 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-03-15T00:56:56.183Z",
                "reviewBody": "You don’t know me, but you’ve gotta believe me -this is good.  I mean REAL good.   I modified it a tad, starting with using the standard breading method of flour, egg and (seasoned) bread crumbs.  I browned the chicken in a mixture of butter and olive oil to reduce the burning point temperature.  Once I browned it thoroughly I cut into it and noticed it was still a little pink on the inside – no problem, I just threw it in a 325 degree oven while I prepared the sauce and cooked some pasta.  While I only made two chicken breasts, I hated to waste the better portion of an 8 oz. carton of chicken broth and half a carton of cream, so I thought what the heck, I’ll use it all!  I added the chicken broth to the pan first, reduced it drastically, then added the entire carton of cream and let it go until the sauce had reduced to a thick and velvety smoothness.  I added the Parmesan and pimiento just before serving and topped the chicken with a basil chiffonade rather than stirring it into the sauce.  The chicken was tender and moist, the coating dry, golden and crispy (rather than mushy and soggy), complemented by the luxurious, rich sauce.  The pimiento was a nice touch, subtly enhancing the sauce.  I’m glad I had the extra sauce - it was perfect for some nice pasta!  Since this is a dinner a little on the rich side, I chose to serve it with just a few pattypan squash, lightly seasoned with butter, salt and pepper.  At the risk of sounding corny, this was a GLORIOUS dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T21:28:48.38Z",
                "reviewBody": "Very good, but I made a few changes: I pounded out the chicken a bit for quick even cooking: I dipped the chicken in egg instead of milk; I added chopped garlic while the chicken was cooking and to the sauce; I used half-n-half instead of heavy cream; and I used more chicken broth and less cream to cut some of the fat. I stuck with the original recipe for the most part - it is really very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STACIIII",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/455504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-27T13:51:17.107Z",
                "reviewBody": "I baked the chicken in the oven and doubled the sauce as another reviewer suggested so I'd have enough to go over angel hair pasta. This sauce was so heavy I should have done linguine! It was rich thick and very creamy. All I had to add to give it a little more flavor was 1 tsp. of minced garlic from the jar. My husband was looking for more of a tomato basil cream sauce so I added a 14.5 oz. can of italian sytle diced tomatoes to some of it and a little sugar and we had it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-15T03:22:45.28Z",
                "reviewBody": "This is really good. Unfortunately I made some changes to the recipe to suit our tastes (hence the 4 star rating). I pounded out the chicken breasts for even cooking and added some fresh garlic (like another reviewer suggested). I also omitted the pimentos (didn't have any). I added just a splash of dry white wine. Fabulous over some noodles. Will definately make again. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T21:29:13.117Z",
                "reviewBody": "Here are my modifications: I cut my chicken breasts into bite-sized chunks fried them in butter with 4 cloves of minced garlic. I also added broccoli and used whole pimentos from the mexican food section (much cheaper) sliced in strips. I substituted half and half for the heavy cream used 2 tsp dried basil doubled the sauce and added a little corn starch to thicken it. I served it over fettucini. Overall it was good...my family liked it a lot but personally I thought it was more work than I like (frying the chicken then setting it aside grating the parmesean etc.) I imagine it would be very good with fresh basil and maybe some fresh tomatoes (nice summer dish)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BETHANDBRIGGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-27T03:47:25.157Z",
                "reviewBody": "I'm on Atkins so this was perfect for me. I did add garlic to the butter as I cooked the chicken which I coated w/parmesan-not flour. And instead of pimentos (which I didn't have) I used chopped jalapenos. JUST RIGHT! (For me-if you don't like spicy food stick w/the pimentos.) Great recipe to build on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bestaimee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2410522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-21T15:40:23.637Z",
                "reviewBody": "No I didn't follow the recipe; but I learned a few things so you might want to read this anyway - even if you make faces at us who don't follow recipes to a \"T\":) I didn't make the chicken - at all. I thought I'd try the sauce first. The sauce - well I subbed half & half. I used 2c thinking it was going to be fabulous - & so I could have half with basil half without. I just melted a little butter added the half & half & heated. Added a cup of parmesan & almost 1/4t freshly ground black pepper. Stirred till melted which takes longer than I expected; but maybe I just added it too soon. I read in another review not from this recipe about using mozzarella as a thickener instead of cornstarch or flour. Hmmm I tried it. 'Didn't work on this one. I added a half cup of shreddded mozzarella & still had to thicken with 2T cornstarch. Maybe the mozzarella trick would be a trick for when your first choice didn't thicken enough. Sooo it was good then. Nice & thick & yum. I added a third cup or so fresh basil to a cup of the sauce. I love basil. I love it. I love it love it love it; but it just didn't do anything for me in this recipe. I wanted it too. What a great idea - creaminess of parmesan & fresh basil. 'Sounded great but notsomuch. Oh yeah I'll eat it; but prefer it without my precious basil.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKMARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bookmarker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:30:39.03Z",
                "reviewBody": "This was superbe - gourmet restaurant quality!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANONLINE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-27T20:55:54.107Z",
                "reviewBody": "Excellent! I didn't have pimentos so I diced half of a red bell pepper that I had added a package of fresh mushrooms that I had but other than that followed it exactly. It didn't need anything else but I had those 2 things that I needed to use. It was excellent!! I served it over orzo pasta. I mixed half the sauce with the pasta and then topped the pasta with the chicken and then poured the remaining sauce over the chicken. Was soooo good and did look and taste like a restaurant cooked it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baton Rouge Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:30:42.327Z",
                "reviewBody": "Since I'm not a fan of fried chicken I have to pass on the breading... but the sauce is great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Sita Chouinard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/760331/"
                }
            }
        ]
    }
]