[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8966/gerrys-chicken-enchiladas/",
        "name": "Gerry's Chicken Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4031892.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-05-07T07:06:10.000Z",
        "description": "This is my own recipe, and it's not the easiest dish I've ever made, but it's very good! Makes 6 awesome enchiladas!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 boneless, skinless chicken breast halves",
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "1 (10 ounce) can diced tomatoes with green chile peppers",
            "1 (14.5 ounce) can stewed tomatoes",
            "12 small chile peppers, diced ",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 (14.5 ounce) can chicken broth",
            "1 bunch green onions, chopped",
            "½ pint heavy cream",
            "6 (6 inch) corn tortillas",
            "3 cups shredded Cheddar cheese",
            "1 (10 ounce) can enchilada sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut chicken breasts into 1 inch strips. Place in a medium bowl with desired marinade, and marinate in the refrigerator for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Saute chicken and onions until chicken is evenly brown. Stir in diced tomatoes with green chile peppers, stewed tomatoes, chile peppers, soup and broth. Bring mixture to a boil. Reduce heat, cover skillet, and simmer for 20 to 30 minutes, or until chicken is no longer pink and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken from skillet, and shred when cool enough to handle. Meanwhile, allow skillet  mixture to simmer and reduce to about 2 1/4 cups. In a medium bowl, combine shredded chicken and about 1/4 cup skillet mixture (just enough to make a paste like mixture). Mix together with half the chopped green onions. Pour remaining 2 cups of skillet mixture into a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a second skillet, heat cream over low heat, being careful not to boil. Dip tortillas in the warm cream to soften and coat. Spoon about 1/3 cup chicken mixture onto each tortilla. Top chicken mixture with half the shredded cheese, and roll up tortillas. Place rolled tortillas in baking dish, seam side down, and drizzle with enchilada sauce. Cover with remaining shredded cheese, and sprinkle remaining chopped green onion over cheese. Bake uncovered in preheated oven for 25 minutes, or until cheese is melted and bubbling.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "GERRYG58"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.680851063829787,
            "ratingCount": 611,
            "itemReviewed": "Gerry's Chicken Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "718.2 calories",
            "carbohydrateContent": "38.1 g",
            "cholesterolContent": "181.9 mg",
            "fatContent": "46.8 g",
            "fiberContent": "5.8 g",
            "proteinContent": "40.2 g",
            "saturatedFatContent": "25.7 g",
            "servingSize": null,
            "sodiumContent": "1408.2 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-12T13:03:56.107Z",
                "reviewBody": "My husband and I thought these were outstanding.  As good if not better than any I've ever had at authentic Mexican restaurants - and I consider myself an enchilada connoisseur.  I used half of a large poblano chile pepper which are very mild in flavor and heat.  You will not need a full 1/2 pint of cream.  A lot of it went to waste.  I had much more than 2-1/2 cups of liquid in the end so I measured 2 cups for the bottom of the 9/13 pan and dumped the rest.  For me, the recipe made 9  enchiladas, stuffed to the hilt.  My husband called me at work today to tell me how good even the leftovers were and asked how soon could we make these again.  Thanks Gerry for a definite keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHADOWMERV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T17:54:05.607Z",
                "reviewBody": "This is one of the greatest Sunday night dinners; well worth the lengthy prep(easy though).  I marinated the chicken in a fajita sauce (powder packet), and it tasted great.  Spicy enough to satisfy the boyfriend, and mild enough so that I could eat it.  My boyfriend hates tomatoes, so I processed the tomato/chile mixture, and that worked out great.  What I do is boil the chicken for 15-20 minutes, then shred it with two forks, then I pour in the fajita seasoning with water, leave for several minutes, the pour out the excess.  Then I follow with the mixing (no cooking, just baking).  THANKS GERRY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARDUST_331",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stardust_331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:50:11.403Z",
                "reviewBody": "This is the best recipe for chicken enchiladas I have found so far.  Simmering the chicken in tomatoes, chile peppers and creamy soup adds so much flavor to the traditional chicken enchiladas.  My husband and I have had this twice so far and the second time I used hot enchilada sauce and it made it extra spicy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JASMINE828",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-14T20:45:27.98Z",
                "reviewBody": "Absolutely fabulous!  We love it!!  For the chicken marinade, I use the juice from two limes, 4 cloves garlic chopped and 1/2 t kosher salt.  I also used canned Ortega diced chiles in place of the 10 chiles.  Flour tortillas make a nice replacement to dipping the corn tortillas in cream and saves some time as well.  Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:50:26Z",
                "reviewBody": "This recipe is GREAT!!!! I did make a few changes though. I followed the recipe through step 2 minus the chicken broth. After removing the chicken I chopped it up and had plenty of the stewing liquid which I blended with my immersible blender and used this for the sauce.(It is just that good!)I did reduce it some. I also microwaved the tortillas so I didn't need the cream. I also left out the can of enchilada sauce and the chicken broth. With the few changes this recipe can be made often and in little time. This is definitely a favorite. Thanks for sharing Gerry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlicePRiley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/793030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:50:07.217Z",
                "reviewBody": "Yes a fantastic enchilada recipe. I made this as a special dinner for my girlfriend. She absolutely raved about how awesome they were. She proclaimed that these were the best chicken enchiladas she has ever tasted. They make rather large enchiladas so there were plenty of left over. I sent some over to my mother and she called back the next day saying they were great and that she had already ate them all up. I substitued a small can of mild green chiles instead of the optional fresh chiles and still got plenty of chile flavoring. A food processor would have helped with shredding up the chicken. These are truly Chicken Enchiladas of the Gods!! Thanks Gerry:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEFTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/587903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-04T01:36:04.887Z",
                "reviewBody": "I have made these enchaladas for a couple of years now and am told EVERYTIME that these are the best enchaladas in the world by everyone who tries them. I don't know what a \"small\" chili pepper is so I use 3 jalapenos. For the marinade I suggest Lawry's Havana Garlic Lime (I even pour the remainder of the marinade into the sauce) I also use verde enchalada sauce to top. Wonderful recipe! I want to give Gerry a HUGE hug.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Blind Guy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1764665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T15:06:38.64Z",
                "reviewBody": "Oh Wow...I made these for lunch today.  I was the only one eating on them since hubby is at work and my 4 year old wants pizza.  These were very good.  Tasted just like I ordered them from a Mexican restaurant.  I left out the chile peppers, but added a small can of chopped black olives.  I used flour tortillas and zapped them in the microwave instead of using the cream.  I topped them with cheddar and mozzarella.  These will definitely be made again.  Thanks Gerry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T02:12:28.623Z",
                "reviewBody": "I didn't have some of the ingredients so I had to do some substitutions and I think that's what made it taste not bad but not great either. Anyhow I don't get the part of cutting the chicken and then having to shred it afterwards. Next time if I make it I'd just marinate it whole (poking holes in the meat with forks) and then shred it after it's cooked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            }
        ]
    }
]