[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/338/bread/bread-machine/",
                    "name": "Bread Machine",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15232/ciabatta-bread/",
        "name": "Ciabatta Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F97098.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-05-12T00:28:49.000Z",
        "description": "This very simple recipe can be made in the bread machine using the dough cycle. I make it at least 3 times a week.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "1 ½ cups water",
            "1 ½ teaspoons salt",
            "1 teaspoon white sugar",
            "1 tablespoon olive oil",
            "3 ¼ cups bread flour",
            "1 ½ teaspoons bread machine yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place ingredients into the pan of the bread machine in the order suggested by the manufacturer. Select the Dough cycle, and Start. (See Editor's Note for stand mixer instructions.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dough will be quite sticky and wet once cycle is completed; resist the temptation to add more flour. Place dough on a generously floured board, cover with a large bowl or greased plastic wrap, and let rest for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly flour baking sheets or line them with parchment paper. Using a serrated knife, divide dough into 2 pieces, and form each into a 3x14-inch oval. Place loaves on prepared sheets and dust lightly with flour. Cover, and let rise in a draft-free place for approximately 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spritz loaves with water. Place loaves in the oven, positioned on the middle rack. Bake until golden brown, 25 to 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Bread Machine"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.554151624548736,
            "ratingCount": 554,
            "itemReviewed": "Ciabatta Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "73.4 calories",
            "carbohydrateContent": "13.7 g",
            "cholesterolContent": null,
            "fatContent": "0.9 g",
            "fiberContent": "0.5 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "146.3 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-09T22:48:50.607Z",
                "reviewBody": "Good results!\n\nAs a culinary student I've tried and failed with bread many times before getting some decent results.  Here's what I've found that may help:  \n1) Proof your yeast as directed (mixing water, yeast, & sugar)-- if it doesn't start bubbling or frothing after 10 min, throw it out.  Either the yeast is dead (check expiration date) Or you killed it with HOT tap water > 120 degrees F kills yeast.  Optimal temp is LUKE warm around 100F.   \n2) Mist the bread with water every 3 min for the first 10 min.  Why?  This does 3 things.  Prevents the crust from forming too fast thus restricting the rising process.  It moisens the crust just enough so it doesn't brown/burn at the end of the baking period - you get a golden brown instead of a dark heavy crust.  And it  finally makes the crust crispier.  This is a very important step.  It also helps if you have a bowl of water in the oven to increase the humidity percentage.  Professional ovens have adjustable humidity controls which add moisture in.  Why only 10 min?  You can mist for longer but you'll end up with a thin white crust instead of golden brown.  Once the bread has risen to its full potential (within the 1st 10 min or so depending on the size of the loaf), then you want  it to start becoming golden brown.\n\nBaking is regarded as being harder than cooking because of the exactness in ratios of the ingredients. \nHope some of my hard lessons learned helps you -- Best of luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rodney Dowdle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1851942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-15T22:06:54.063Z",
                "reviewBody": "This recipe was awesome! I skipped the bread machine business and made it by hand...the dough was sticky but it worked well  enough, just start the yeast in the warm water for a few minutes before throwing in the rest of the ingredients. Instead of loaves I made rolls and they turned out great. I also added 3 tablespoons of dried rosemary to the dough which made all the difference. They were a huge hit with my kids, my daughter told me they tasted just like the bread at our favorite Italian food place and she was right! Misting the dough during baking with a spray bottle is a MUST. Don't skip this step, it's what makes the crust so crispy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "maegan b.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2303611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T19:16:17.983Z",
                "reviewBody": "Wonderful recipe ~ so easy.  Everytime I make it I get rave reviews!!  \n\nEasy hint, use spatula to scrape out of breadmaker onto a heavily floured board.  Then use a metal scraper to scrape/scoop/lift the floured dough into a rectangle and then plop onto a silpat/greased cookie sheet.  This is a rustic bread so it will be chewy with large holes.  You really can't use your hands, they'll goo up and you won't be able to handle it.  Develop the lift and fold over technique with the scraper and it'll be a breeze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALSTONS4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T01:35:50.903Z",
                "reviewBody": "I was really nervous about this recipe after reading how runny it could be but I followed the directions exactly and it turned out fabulous. Yes it was runny, yes I had a real hard time getting a bowl around it cuz it just ran out on the wooden board I used. Yes it got stuck all over my fingers. And yes I put too much flour on the baking sheets. But it turned out to be the best ciabatta bread I have ever tasted.  WELL WORTH THE WORK.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MKSCHATZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1170950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-27T18:46:07.093Z",
                "reviewBody": "I've been looking for a good hamburger bun recipe and this is it. I dump it all in an oiled boil over a pan of boiling water in the oven for an hour after the initial 15 minute relax. With floured hands I form 5 flatten balls, roll them in sesame seeds, spray them to keep them moist and let them rest again while the oven heats (usually for 20 minutes). I spray them at three minutes and 6 minutes and leave the pan of water underneath while they bake. They are perfect, way better than anything you can buy! Thanks for sharing! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "swalker3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1586355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-14T16:19:26.28Z",
                "reviewBody": "I have made many many loaves of bread using the bread machine to start the dough. The first batch yielded 2 baguettes; I could not get 2 13x14 loaves out of the dough. The 2nd batchThat I made this evening yielded a pool of dough. Anyone know what I did wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Bakaitis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-14T20:13:50.063Z",
                "reviewBody": "I have baked about one to five loaves of bread a week for 40 years. This is a great loaf of bread. For those who had trouble with the dough being too runny, these suggestions: Use only bread flour as called for in the recipe; AP flour does not absorb as much water. Secondly, measuring flour for bread differs from measuring for cake or cookies (sifted or stirred & fluffed) because bread bakers \"feel\" the dough while they knead in the flour. Air humidity can also affect the moisture. Just lightly scoop the flour, but if the dough is truly runny, add flour a tablespoon at a time after the first five minutes of kneading until it no longer runny but is still quite wet. Keep in mindd the this bread is meant to spread out into a fairly flat loaf. It's other name is \"Italian Slipper Bread.\" Making bread is a sight & feel process, even in the bread machine. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jajam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1198645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-05T14:33:12.403Z",
                "reviewBody": "I made the dough in my bread machine. I poured the bread on to parchment paper and watched the dough run in every direction. I've been making bread for years and have never seen a recipe so far off base. And yes I measured every thing correctly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "spearit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1970150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T20:37:58.84Z",
                "reviewBody": "This is a great recipe - excellent bread. Instead of making two loaves I made one and buns out of the remainder of the dough. Only cooked the buns for 13 minutes. One of the best bread machine recipes I've seen. Certainly will make this a lot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THIN MAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/78404/"
                }
            }
        ]
    }
]