[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17966/refrigerator-rolls-i/",
        "name": "Refrigerator Rolls I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1013425.jpg",
            "width": 1940,
            "height": 1936
        },
        "datePublished": "1999-05-12T14:35:43.000Z",
        "description": "These rolls take a while to make but are certainly worth the effort. My maternal grandmother made a double batch of these at each major holiday, and they were almost always gone before anything else! They're very tender and lightly sweet.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT15H0M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "1 cup milk",
            "1 (.25 ounce) package active dry yeast",
            "1 ¼ cups warm water (110 degrees F/45 degrees C)",
            "½ cup shortening",
            "⅓ cup white sugar",
            "2 eggs, beaten",
            "6 cups self-rising flour",
            "2 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the shortening and sugar; stir until melted. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the cooled milk mixture and the yeast mixture. Stir in eggs and flour; beat well. Cover bowl with a damp cloth and let rise until doubled; about 1 hour. Stir batter to deflate. Cover bowl and refrigerate several hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter onto a lightly floured surface and roll out to 1/2 inch thickness. Cut rolls into desired shape and place on lightly greased baking sheet. Brush with melted butter and let rise until doubled; about 45 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 to 20 minutes, until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "D. W. Cabe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.7142857142857144,
            "ratingCount": 7,
            "itemReviewed": "Refrigerator Rolls I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "359 calories",
            "carbohydrateContent": "53.2 g",
            "cholesterolContent": "37.7 mg",
            "fatContent": "12.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "8.1 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "827.7 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-21T12:49:59.823Z",
                "reviewBody": "I made this recipe in my Kitchen Aid mixer. I let the yeast bloom with the warm liquids and sugar in the mixer bowl for ten minutes then added the other ingredients. I did use melted butter instead of shortening only because I am out of Crisco right now AND I added a teaspoon of salt. I added the flour a half cup at a time up to four cups then a quarter cup at a time until it was where it formed a solid ball without sticking to the bowl. I then kneaded it with the dough hook for five minutes. After the first rise I rolled the dough into heaping 1/3 cup balls and plopped them into the greased cast iron skillet then covered the with a dishtowel and let them rise until the doubled. I baked them at 400 for just about 17 minutes. These turned out absolutely wonderful. I was telling my husband these rolls reminded me of the \"church lady rolls\" I used to get at church dinner nights. They were light and fluffy and just wonderful. This absolutely was a success. Great dinner roll. MAKE SURE YOU ADD SALT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T16:47:17.867Z",
                "reviewBody": "I used this for Thanksgiving and every event since. I get phone calls requesting me to make bread!!!! I revised it just a little by doubling the sugar (my family like to extra sweet taste). This is a five star receipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CCHATTMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/237456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-10T10:44:17.64Z",
                "reviewBody": "Contrary to what the description says I found these rolls pretty easy to make. I did not have self-raising flour so used plain flour with added baking powder. I don't know whether it was due to this or the lack of kneading that the texture was more like cake than bread. The rolls were sweet and tender as specified but a bit too crumbly for me. There was nothing really wrong with them but I doubt I will make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RAZZMATAZZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-11T00:39:58.197Z",
                "reviewBody": "This recipe was easy to make; however I did not find them light. They were sweet but I came up with a heavy consistency. The way you have to roll them out and cut them I had a feeling of more like biscuits. I may have misunderstood the directions. They were ok just not what I was looking for when compared to the description.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "IAMASLP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/iamaslp/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-20T02:44:26.41Z",
                "reviewBody": "I have never used self rising flour and yeast together before.  I used butter in place of shortening.  That was my only ingredient change.  Rather than rolling out the dough and using a cutter, I simply divided the dough in twelve portions and allowed it to rise again in muffin tins.  Mine baked for about 18 minutes at 350.  I was surprised how dense, not heavy, but dense, they baked up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-22T02:12:31.77Z",
                "reviewBody": "I made these for Thanksgiving. I've always brought the rolls but everybody went on and on about these and asked for the recipe. I saw some of the reviews said their rolls came out heavy mine were light as thistle. I used my mixer to beat in the flour and I let it set overnight in the frig. (a full 9 hours)maybe that was the difference. I used butter instead of shortening and I made my own self-rising flour by adding 1 1/2 tsp of baking powder and 1/2 tsp of salt per cup of flour. I tripled the recipe and they were all gone! I thought the idea of melting the butter into the milk and warm water was a grand time saving idea. These rolls will be a staple at our family get-togethers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aunt Alice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10355885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-16T08:37:57.603Z",
                "reviewBody": "Ive never had much of luck with all things related to yeast (except pizza dough maybe) I tried these as I had a lot of self rising flour and yeast and wanted something savory. It came out more cake like and yellow (perhaps coz of the margarine) and I am unsure what when wrong. I kept it over night (almost 12 hours) covered and the top of the dough had a crust (due to the chill in the fridge). It had a soggy rather uncooked center and a dark browned crust on top. Would be great if someone told me how to do it right. Also i sprinkled yeast on hot (slightly cooled) water and it didn't bloom /bubble so I stirred it into the water and it got all cloudy. And my milk- margarine mixture was hot though i let it to cool a bit before adding to the flour and yeast-water. Of course I am no expert in bread making so my rating doesn't really count.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "starpleaides",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14087972/"
                }
            }
        ]
    }
]