[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9027/kung-pao-chicken/",
        "name": "Kung Pao Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F21%2F290890_original.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "1999-05-16T18:53:41.000Z",
        "description": "Spicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound skinless, boneless chicken breast halves - cut into chunks",
            "2 tablespoons white wine",
            "2 tablespoons soy sauce",
            "2 tablespoons sesame oil, divided",
            "2 tablespoons cornstarch, dissolved in 2 tablespoons water",
            "1 ounce hot chile paste",
            "1 teaspoon distilled white vinegar",
            "2 teaspoons brown sugar",
            "4 green onions, chopped",
            "1 tablespoon chopped garlic",
            "1 (8 ounce) can water chestnuts",
            "4 ounces chopped peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Arlena"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.285714285714286,
            "ratingCount": 1449,
            "itemReviewed": "Kung Pao Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "436.5 calories",
            "carbohydrateContent": "25.3 g",
            "cholesterolContent": "65.9 mg",
            "fatContent": "23.3 g",
            "fiberContent": "4.2 g",
            "proteinContent": "34.4 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "595.6 mg",
            "sugarContent": "6.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-04T03:41:41Z",
                "reviewBody": "It's not unusual for me to eat Chinese out two or three times per week, so I have a LOT of experience in eating Chinese food.  I've been to 90% of the Chinese restaurants in the metro area I live in.  And hey--this stuff passes the test.  It's the first time I've tried cooking Chinese and I can't believe how easy it was.  Further, it turned out fabulously.  It's as good or better than most Chinese restaurants.  Here's what I did:  1) used champagne instead of white wine; it's what I had available, 2) absolutely double, triple or quad the recipe; if you don't eat it now, you will eat it later ... the recipe doesn't make very much unless you eat like a bird, 3) for my family, the hot level was perfect ... it was certainly hot, but not too hot, 4) the sauce WAS a little thick--I will try decreasing the cornstarch next time ... as it was, adding water worked for me too, 5) if you can't find chile paste at your local grocery store, check out almost any Asian grocery store--they will likely have many choices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-30T04:00:50.077Z",
                "reviewBody": "I think this is my all time favorite recipe.  I have made it dozens of times and all my friends and family say it's the best thing I make!  I do make a few alterations though, which I find absolutely crucial:  Double the marinade and the sauce, add lots and lots of water as the mixture cooks - otherwise it gets really pasty.  I would say throughout the cooking process I end up adding at least a cup of water.  You want to make sure there's enough sauce to cover the noodles.  I also add several cups of chopped up veggies; usually red and green peppers, mushrooms and broccoli.  Thanks so much for this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1635435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:41:51.42Z",
                "reviewBody": "Yummy.  Restaurant quality.  Had to alter quite a bit.  Took the orginal recipe for marinade: used rice wine,1 clove of garlic and reduced the sesame oil to 1 tsp. Did not add cornstarch to marinade.  5X the recipe of soy sauce, rice wine, vinegar, brown sugar, and 1 clove of garlic, 2 tsp. of chile paste, and 1 tbsp of cornstarch with 2 tbsp of water.  Stir fried the chicken first and set aside. Then stir fried brocolli, mushrooms, carrots and green onions together.  Added sauce and then chicken. Couldn't add peanuts due to allergy.  Rave reviews from Dad and 2 kids. *****",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TORA.V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/785444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:47:32.49Z",
                "reviewBody": "This was a terrific dish and perfect for my spicey food loving family. I couldn't find chile paste in the grocery store so I subbed with a spicey szechuan sauce. I tripled the marinade and quadrupled the sauce even though I only used four chicken cutlets. Didn't have any peanuts so I used peanut butter which I often do in asian dishes. I added broccoli and baby corn to make a complete meal. Thanks Arlena it was great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-10T18:08:15.97Z",
                "reviewBody": "I followed this exactly as written (saw many favorable reviews that had made many changes). I love spicy food, but this did not have a good flavor hot and there was not enough sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMCE4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T22:26:24.817Z",
                "reviewBody": "Ok ya'll I have made this recipe so many times now, I kind of know what goes in it without looking at the recipe. This is a great base recipe, without a doubt and if you don't like spice at all, I would still to this recipe exactly. \n\nNow for all you REAL kung pao chicken lovers that want the SPICE. You have to add A LOT more sambal or chile paste to make this even remotely close to something you've tasted before. I think I used almost a fourth of my HUGE jar of sambal to make this work. I would also marinade the chicken in it as well so you just an extra layer of spicy. I think it's the vinegar, but it completely mellows out the spice of it, so you definitely have to over compensate. \n\nAlso, you don't really have to measure. Most of these things are one to one or two to one, so it's actually pretty easy to figure out. I have done these plenty of times without measuring it out exactly and plenty of times with measuring it out and it turns out virtually the same. \n\nFinally, you need to double the sauce part of this recipe. The original recipe actually needs a little more sauce then is written. The only things I wouldn't double are the peanuts and the water chestnuts. In the original recipe there are far too many of those things that the chicken kind of gets lost. \n\nHope this is helpful to you from someone who has had this a bunch! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2401577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-03T16:51:34.53Z",
                "reviewBody": "I didn't have chile paste so I threw in some red pepper. I tripled the sauce recipe because I added baby corn green bell pepper and thinly sliced carrots and it wouldn't have been enough once I added the chicken. The sauce got really thick though & had to add some water to thin it down a bit. You may have to adjust this one to your own taste. It's good but I needed to play around with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MIRANDA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/409350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-29T16:39:21.78Z",
                "reviewBody": "I lived in China for two years, and this recipe (with some important but minor changes) comes very close to the Kung Pao chicken that can be found in Beijing restaurants. \r\n\r\nWith regard to ingredients, I agree with other reviewers: cut the cornstarch in both the marinade and the sauce. (I used 1 teaspoon in the marinade and 2 teaspoons in the sauce.) A few extra notes: Use Chinese rice wine, like Shaoxing, and light (as opposed to dark) soy sauce, if you can find them. I also agree with some other reviewers that chili paste is probably better than chili sauce. Lastly, skip the water chestnuts and add a carrot, like they do in Beijing. The carrot provides a wonderful crunchiness and sweetness that balances nicely with the spice.\r\n\r\nTo solve the issue of there being too little sauce, don't cook the chicken separately; after the sauce has been warmed, throw the chicken and marinade in and stir constantly until it's cooked through.  \r\n\r\nTo make sure you've got enough food, try a few simple (and cheap!) Chinese sides like potatoes and green peppers (????? cù liu tu dòu si), eggs and tomatoes (?????? xi hóng shì chao ji dàn), eggs and wood ear mushrooms (????? mù er chao ji dàn), eggs and cucumber (????? huáng gua chao ji dàn)  egg drop soup, sweet corn soup, and broccoli with garlic (????? suàn róng xi lán hua). \r\n\r\nIf you want to finish off the meal like they do in Beijing, serve fresh fruit: Fuji apples, pineapple and kiwi.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ashleyadm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8718592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-19T19:31:55.28Z",
                "reviewBody": "Very delicious my dish was not quite PF Changs but great anyway. I found only hot chili sauce in the Asian Market so I used that the apartment smelled wonderful. Problems I encountered were: The cornstarch in the chicken marinade started to burn and stick when I browned it and the cornstarch in the marinade itself was too much so instead of a sauce I got a thick paste to which I kept adding water(suggestion: use a little less cornstarch). Finally the sugar was not enough for my liking so next time I will use a bit more...otherwise really really tasty. My husband and I ate every scrap. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRTS78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615420/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kung Pao Chicken",
            "description": "Make spicy kung pao chicken that rivals your favorite Chinese restaurant’s version.",
            "uploadDate": "2012-10-01T19:11:59.579Z",
            "duration": "PT5M15.065S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Faf954562-dc81-4c9d-9f7a-2dc0788b4717%2F03095c3b-6f1f-4e5d-a2db-d0729709dfd9%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1871285048001"
        }
    }
]