[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8736/jerk-chicken-and-pasta/",
        "name": "Jerk Chicken and Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3928912.jpg",
            "width": 1280,
            "height": 1280
        },
        "datePublished": "1999-05-21T23:57:49.000Z",
        "description": "Jerk Chicken and Pasta is a passionately spicy Jamaican-style dish that when tempered correctly will tantalize even the most fire-fearing palate!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "2 teaspoons jerk paste",
            "1 (12 ounce) package uncooked egg noodles",
            "1 tablespoon olive oil",
            "1 clove garlic, minced",
            "1 cup chicken stock",
            "1 tablespoon jerk paste",
            "½ cup dry white wine",
            "¼ cup chopped fresh cilantro",
            "2 limes, quartered",
            "salt and pepper to taste",
            "½ cup heavy whipping cream",
            "4 sprigs fresh cilantro, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rub each breast half with 1/2 teaspoon jerk paste, and place in a shallow dish. Cover, and refrigerate at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the grill for high heat. Bring a large pot of lightly salted water to a boil, cook the egg noodles 6 to 8 minutes, until al dente, and drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil the grill grate. Grill chicken 8 to 10 minutes on each side, until juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat the olive oil in a large saucepan over medium heat, and cook the garlic for one minute. Mix in the chicken stock, 1 tablespoon jerk paste, white wine, chopped cilantro, juice of 1 lime, salt, and pepper. Bring to a boil, reduce heat to low, and stir in the heavy cream. Cook and stir until mixture is thickened, about 5 minutes. Do not allow it to boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the cooked egg noodles into the saucepan, and toss with the cream sauce. Divide noodles onto 4 serving plates, and top with grilled chicken. Garnish each serving with a cilantro sprig and the juice of 1/4 lime.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Terry Coonan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.317460317460317,
            "ratingCount": 63,
            "itemReviewed": "Jerk Chicken and Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "595.2 calories",
            "carbohydrateContent": "59.6 g",
            "cholesterolContent": "168.9 mg",
            "fatContent": "25.2 g",
            "fiberContent": "3.6 g",
            "proteinContent": "37.3 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "205.2 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-06T05:09:29.997Z",
                "reviewBody": "Hi everyone!!! I just made this recipe and it was a smash hit.. I made a few modifications though. I totally suggest using the Island Pepper Company Island jerk seasoning as your jerk paste. It's the best paste you can buy and is superb. I like grilling my chicken but I chose not to. For the chicken I took two boneless chicken breasts with jerk seasoning (3-4 tablespoons rubbed in) cooked them in a skillet with a tablespoon of olive oil until almost cooked. After that I cut the chicken into strips and cooked until some browning occured. Then mixed all the pasta egg noodles into the sauce with the chicken to follow. Simmer in the pan for 5 minutes and you have yourself a treat. If you have ever eaten at Bahama Breeze this recipe mocks thier Jamaican Jerk Chicken. The key is the Jerk Paste... Try to find the Island Pepper Co. paste.. You will be totally satisfied. I blew myself away with the recipe. You should also try bowtie pasta for an awesome presentation..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVE77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1008694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:51:55.153Z",
                "reviewBody": "I used this recipe recently for a bridal shower.  The bride and groom were going to one of the islands and wanted to get into a festive mood.  The dish was a smash hit.  I did make a few changes -- I sauteed a small onion and a few strips of green pepper with the garlic.  To add body to the pasta sauce I made a simple white roux and added it to the sauce.\r\nThanks for the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BRAIDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:51:56.077Z",
                "reviewBody": "A little on the spicy side for kids. But it tastes great. The creamy pasta is a nice complement with the spicy chicken. This will become a regular at our house. It is definitely worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RKW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/125430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-10T06:24:47.857Z",
                "reviewBody": "this is truly a pasta dish that will knock the socks off of your family and guests! the corn starch is a definite must to thicken the sauce and i learned a neat trick to add it without leaving clumps in your sauce that don't blend in. take about a cup of the cooked sauce in a seperate bowl and add the corn starch to the cup of hot liquid and blend well. when it's blended dump the cup of sauce back into your pan with remaining sauce and it will thicken nicely without the unstirred corn starch clumps!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KTHNXBY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1306553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T19:53:16.64Z",
                "reviewBody": "YO!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BIGDPRENDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/636704/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T21:47:02.037Z",
                "reviewBody": "Great Recipe! I have a few modifications to make it even better!  I think it's best to double the sauce so that it covers all the pasta! I increased it to 2 c. chicken stock, 1 cup wine and 1 cup heavy cream.  In addition I used a jerk rub plus a simple jamaican marinade I found in the salad dressing aisle.  I prefer to bake the chicken so that it's nice and juicy (350 for approximately 25 minutes).  This was a crowd pleaser and the pasta was enough to easily feed 6-7 people, just use  more chicken.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Junny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2957649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:51:56.327Z",
                "reviewBody": "This was absolutely phenomenal! My finicky boyfriend was stunned by how incredible it was. He looked like he wanted to kiss me but was too afraid to put down his fork for fear the taste would end! The creaminess of the pasta blends perfectly with the spicy chicken and there is a tangy zip to it that I was pleasantly surprised by. Mild Enthusiasts Beware: This dish is spicy!...but so darn good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LFAYE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-11T16:50:51.703Z",
                "reviewBody": "This is a great change up for chicken. I love Jamaican and I have my own Jerk recipe so I use it not a commercial blend. I agree with whoever said that this is close to the recipe at Bahama Breeze. It's great. Even my picky eaters liked it. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPEARFISHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/670662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-07T16:40:48.64Z",
                "reviewBody": "I have been a fan of Jerk pasta since I was 15 working at a gourmet restaurant in my hometown Now that I am pregnant I have been craving it ALL the time but at over 10 an order I decided to make my own...I use only Walkerswoods Jerk Paste I can buy it from that restaurant for around 7 a jar--Im sure you can find it online or at your local store--I followed this recipe since It sounded just how we made it at the restaurant and it tasted EXACTLY like it was made there!!! I couldn't believe myself and Im not the most experienced cook around....The only thing I did was saute slices of raw chicken in the olive oil garlic and jerk paste until cooked...Took that out then added the ingredients minus the chicken stock and upped the lime juice since I feel Jerk can be to spicy lime juice tames it down. Let that cook together for a bit then added lots of cream but DID bring to a boil to thicken some added penne pasta the cooked chicken heated well and added a bit more lime juice and it was perfect!!!! I recommend making it extra saucy and serving with a really good french bread toasted with garlic butter spread GREAT for dipping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Cartwright",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3619279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-09T18:11:09.14Z",
                "reviewBody": "I fell in love with Jerk Chicken pasta when I was in the Carribbean last July and came home and scoured the net for a similiar recipe. I gave this one 3 stars because the taste was good but the sauce never thickened up as it should have done. It was very runny. I made it a second time and made the following modifications which helped: Use about 1/4 cup of the chicken stock increase cream to 1 full cup and leave out the lime juice altogether. Also used penne pasta rather than egg noodles. Also served with garlic bread (french bread with butter and minced garlic). Even at that I still had to thicken the sauce with a cornstarch paste. I cannot find the jerk paste so I made some with McCormicks Carribbean Seasoning add a little oil soy sauce and apple cider vinegar to the spice to make the paste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Zan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/62911/"
                }
            }
        ]
    }
]