[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19137/red-and-green-christmas-jalapeno-jelly/",
        "name": "Red and Green Christmas Jalapeno Jelly",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6100121.jpg",
            "width": 3505,
            "height": 1897
        },
        "datePublished": "1999-06-02T08:46:19.000Z",
        "description": "This is a beautiful jelly of red bell peppers and green jalapenos.  It's a perfect relish to many holiday favorites, or serve it with cream cheese on a cracker.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 jelly jars",
        "recipeIngredient": [
            "1 cup chopped red bell pepper",
            "½ cup chopped jalapeno pepper",
            "5 cups white sugar",
            "1 ½ cups apple cider vinegar",
            "1 (6 fluid ounce) container liquid pectin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove stems, veins and most of the seeds of the bell and jalapeno peppers.  Mince peppers in a food processor.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 5-quart pot over high heat, combine bell peppers, jalapenos, sugar and vinegar.  Bring to a rolling boil; boil for 3 minutes.  Remove from heat and cool for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stirring constantly, add the pectin and let mixture continue to cool for 2 minutes more.  Now stir for 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into hot, sterilized jars and top with sterilized lids.  Secure lids with bands and allow jars to cool slowly, creating a vacuum seal.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7485207100591715,
            "ratingCount": 338,
            "itemReviewed": "Red and Green Christmas Jalapeno Jelly",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "111.6 calories",
            "carbohydrateContent": "28.4 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": "0.2 g",
            "proteinContent": "0.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "1.1 mg",
            "sugarContent": "28.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-09T22:12:09.89Z",
                "reviewBody": "I can't say anything more that hasn't been said about how good this recipe is.  I tried this last year for christmas as a newbie canner. (I still am a newbie canner).  I searched the reviews and wished someone had quickly explained the \"canning\" process, but sadly found none.  So I wanted to put my 2 cents in and try to feed some info for those like me who are scared to try.  ( I may make some canners cringe, so please feel free to correct me!)  This recipe makes 4 12 oz jars or 6 8 oz.  I used 2 medium red peppers and 5-6 med-large jalapenos.  I washed the jars and lids in hot soapy water and put the jars in a very large pot and covered with water. I put it on high heat until the water simmered (about 180 degrees) and turned the flame down to keep it at a simmer.  Then I started cooking the jelly.  When it was almost ready, I use a pair of large tongs to take out the jars and poured in the jelly, leaving 1/4 inch space on top. I then plopped on the lid and screwed the screw top on and stood it back in the pot and boiled for 5 minutes and removed.  I then did the mentioned flip trick -- flipping four times, once a half hour, to ensure evenly distrubuted peppers.  I made four batches for this christmas.  It's a great last minute gift when you forgot someone and great when visiting.  Thank you for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri McFadden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T22:27:09.717Z",
                "reviewBody": "I've learned several things after making 5 batches of the jelly over the past four days (two batches failed;  don't use canned jalepenos and don't do a double batch)!  After LOTS of trial and error, I am very happy with my finished product.  Here are a few tips.  \n1. use 1/2 cup finely chooped fresh jalepenos with the seeds from 2 (or more!)of the peppers \n2. use 1 cup bell pepper and process both peppers in a food processor (I didn't drain mine) \n3. add about 1 T crushed red pepper and 5-8 shakes of cayenne pepper while you are cooking the jelly (it doesn't make it too hot, just gives it a nice kick)\n4.  Don't alter the sugar/vinegar amounts or you may end up with botulism (or just ungelled jelly!)\nI used 1 1/2 packages of sure jell with my jelly.  I don't usually like hot food, but I love the jelly on wheat thins with cream cheese.  My husband thought this sounded AWFUL, but is now a devotee!  I am giving it as a gift with another jelly along with recipes (look on this site for some pepper jelly recipe ideas).  Good luck!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Haig Cooreman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2656529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T22:47:39.31Z",
                "reviewBody": "This is a  wonderful recipe. I have made it at least 10 times. The secret to looking like the photo(my picture) is to cut the peppers up in very very tiny pieces. I also put all the viens and seeds in a metal teaball and put it in the pot I am cooking the peppers in. Gives it a little extra zing. I put it in a hot water bath (5min) and turn it up and down every 1/2 hr for 2 hrs....evenly distributed. A real winner!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1COOKIEANGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1455579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-12T16:58:12.453Z",
                "reviewBody": "This is beautiful and very flavorful. I think it has just the right amount of heat. Other reviewers mentioned some questions/problems they had with theirs. One wanted to know how to keep it from boiling over and almost starting a fire. The answer to that one is a BIG pot and stir constantly during the boiling time! Another wondered why their double batch wasn't setting. Most canning guides recommend that you make two separate batches rather than try to double the ingredients in one batch. Just one of the mysteries of jelly making. I wouldn't fool around with the proportions of ingredients (sugar and vinegar) you could run into food safety issues they are what preserve the jelly safely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-05T21:22:57.22Z",
                "reviewBody": "The first time I made this, I followed the recipe exactly.  When finished, I tasted a hint of jalapeno, a lot of sweet, and it had the strong smell/taste of cider vinegar.\nNot to give up easily, thinking this should have more of a savory taste, even though it is jelly, I made the following adjustments.\nI used white wine vinegar.  I sweated a coarsely chopped white onion and 6 cloves of garlic until they were sweet and translucent. I added a seasoning bag containing 1 tsp mustard seed, 1 tsp crushed red pepper, 1 tbsp pickling spice, and 1 tbsp whole peppercorns and the vinegar, being careful to make exactly 2 cups.  I added 1 cup of water.  I added the red and green pepper, and jalapeno (leaving some of the seeds for heat) and simmered for 30 minutes until the peppers were \"cooked\".  At this point I removed the spice bag.  I added the sugar and continued to simmer mixture until all the sugar was dissolved.  I brought the mixture to a rolling boil for one full minute, added the pectin, and stirred until all the pectin was dissolved, another 2-3 minutes.  I shut off the heat, let sit for 2-3 minutes, then filled my sterilized jars.  I processed the filled jars in a hot water bath for 30 minutes to remove any remaining air from the jars.  Upon removing the jars from the simmering water, they promptly sealed themselves within 30 minutes.  On tasting this further revised recpie with the savory additions, the added texture is a real winner.  Try it; you'll like it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Levesque",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T20:40:07.03Z",
                "reviewBody": "This is a wonderful recipe -- especially for a novice like me -- this is my first time to make jelly!  Three important things I learned, though: 1.  For heat, I used the seeds of four of the 12 jalapenos.  2.  Definitely, squeeze out as much water from the chopped peppers as possible (I used paper towels).  The first time mine didn't set well and I think that was the reason.  3.  WASH HANDS or wear gloves when working with the peppers.  I accidently rubbed my nose -- ouch!!  Finally, this recipe really comes together when put on cream cheese.  The colors contrast beautifully against the white cream cheese and the spicy against the sweet is just wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Case",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1983309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T16:12:39.653Z",
                "reviewBody": "I made this recipe with both red and green peppers and it looks wonderful on my Christmas treat table. We served it on crackers with a bit of cream cheese. Make sure you keep the fan going while you cook the recipe as the vapor from the peppers can burn your eyes. Thanks for the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RALLRED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/542306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-01T15:13:58.81Z",
                "reviewBody": "If there were more stars available I would rate this jelly higher! I followed the recipe exactly and licked the pot before I washed it! I got 5-8oz jars and I made it to give away but I may have to make another batch so I can keep some too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brigitte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1574661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-23T01:33:29.403Z",
                "reviewBody": "Absolutely fabulous recipe.  My father-in-law accepts it as payment for plowing the driveway in the winter!  Make sure to chop peppers very finely and flip the jars to evenly distribute the peppers.  This is truly a great recipe, even people who wrinkled their noses at the idea of pepper jelly loved it when they tried it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1724173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T17:19:50.8Z",
                "reviewBody": "Ok I made this yesterday and followed the recipe almost exactly. I use about 1 cup of Jalapeno peppers and 1 cup of the Red Bell pepper. I left the seeds and veins in one of my 4 very large chilies. I timed each step perfectly. It never set up. So tonight I researched on how to fix unset jelly. I tried the easiest method which is to reboil no more than 4 cups at a time to 220 degrees. It was so thick as I poured it back into the cleaned jars and new lids I think this will set up. Only BIG problem is that my 6 half pint jars went down to 4 half pint jars when I was finished. How come so many people had no problem? It does taste fantastic though. I will try another batch this weekend but will boil after the pectin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jasatt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jasatt/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "How to Make Jalapeno Jelly",
            "description": "Jalapeño Jelly - APPROVED",
            "uploadDate": "2013-05-30T21:35:11.398Z",
            "duration": "PT2M17.095S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa32d7f6a-1951-430f-9c48-6bba742b9c34%2Fe3be3dd4-7ee7-494b-8c58-a67bae69e905%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2421701189001"
        }
    }
]