[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/226/world-cuisine/african/",
                    "name": "African",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9018/chutney-chicken/",
        "name": "Chutney Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F228727.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-06-03T08:40:54.000Z",
        "description": "A South African chutney recipe. Serve with rice and a green salad if desired. Divine!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "12 chicken thighs",
            "1 (12 ounce) jar hot chutney",
            "1 (1 ounce) package dry onion soup mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine chutney and dry soup mix. Mix together. Season chicken pieces with salt and pepper to taste. Place seasoned chicken pieces in a 9x13 inch baking dish and pour chutney mixture over chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 45 to 60 minutes, or until chutney sauce has turned brown and crunchy.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "African"
        ],
        "recipeCuisine": [
            "African"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sharon Plett"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.344262295081967,
            "ratingCount": 122,
            "itemReviewed": "Chutney Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "495.4 calories",
            "carbohydrateContent": "25 g",
            "cholesterolContent": "157.9 mg",
            "fatContent": "29 g",
            "fiberContent": "1.5 g",
            "proteinContent": "33.5 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "566.1 mg",
            "sugarContent": "19.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-24T23:08:19.403Z",
                "reviewBody": "This recipe was quick easy and absolutely delicious! I took into consideration some of the other reviews about the saltiness so I skipped the seasoning of the chicken before baking. I did not have any hot chutney (I used apple) so I doctored it up with some red pepper flakes and added the soup mix a bit at a time so that I had the desired taste combonation. In order to make this dinner a simple and easy one stop meal I quartered up some new potatoes drizzled them with olive oil and tossed them with the remaining onion soup mix. I then placed the potatoes on one side of the casserole and the chicken on the other half I scattered several jalapeno slices on top of the chicken and potatoes covered with foil baked half way removed the foil and finished baking. The results were fabulous! My husband and a dinner companion went on and on about my culinary skills (I loved it)! This recipe had such a harmony of flavors; the sweet-and-sour of the fruit in the chutney the salty flavor from the onion soup mix the spice of the red pepper flakes and the jalepenos; it was truly a symphony for your tastebuds! I served this with a green salad and fresh baked french rolls. Thank you very much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDMN28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/182112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T10:00:36.623Z",
                "reviewBody": "This was DELICIOUS!!!!!!!!! I used mango chutney and skipped the salt but WOW!!! Simply amazing.... it had this cool sweet/sour almost teriyaki/BBQ taste: but it was simple to cook and left no mess! My husband and I both loved this and it will become a regular recipe for me!! Thanks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESS_VALENTINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/529539/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-09T17:28:39.203Z",
                "reviewBody": "This was really good! I made a couple changes base on comments from other reviewers. I browned the chicken first which elimated a lot of grease. Then I put the chicken in the oven for 35 minutes. I used aspecialty chutney Basha Browns Spicy Fruit. When I removed chicken at 35 minutes I took the fat from cooking in the oven and poured into chutney & onion soup mixture then I poured over top of chicken before I placed back in the oven for 20 more minutes. Its a flavor that really does grow on you and makes you want to more. I used this for 4 thighs but could have used 6 or various other parts. I will probably make this easy recipe for company it looks fancy too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1605022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-26T17:14:42.39Z",
                "reviewBody": "I was plesantly surprised by this. After I made it I wasn't sure I'd like it. By itself the chutney/onion soup mix tastes weird but it is great on the chicken. I used peach chutney and added some cayenne and brown sugar. Next time I will try mango chutney. I used the full package of onion soup mix (but didn't salt the chicken) and had no problem w/saltiness. I also made it with potatoes that I sprayed w/butter flavored cooking spray and mixed w/another package of onion soup mix and they complimented each other very nicely. This was also SUPER easy which is a huge plus. I just recently tried it w/mango chutney. Highly recommend that over the peach. Again I added cayenne and brown suger. It was awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLY9000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-25T19:57:49.843Z",
                "reviewBody": "This Rocks!! The best chicken I've made. Here's what I changed since I did not have any chutney - I made my own. 1 small glass jar raspberry jelly vinegar ginger garlic cayenne pepper cinnamon cloves and dried mustard powder. Gave it a whirr in the food processor and had my own homemade chutney. I agree with the other review drain the juice about midway thru the cooking THEN add the chutney and onion mix topping my juice was a bit greasy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PENNSTATER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1421926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-01T01:15:02.857Z",
                "reviewBody": "WOW! This is delicious. Unlike anything I've ever tasted before. We're having guests from Kenya for dinner next week and I was looking for some African recipes. I decided to experiment with this recipe tonight before serving it to guests. I have never liked chicken thighs before. In fact the only chicken I eat is skinless boneless breasts. But I decided to give the recipe a chance as written. I removed all of the skin from the thighs and most of the fat using kitchen shears. I found that I think thigh meat is quite good under the right circumstances. I had to go to two grocery stores before I found chutney and then they only had one kind--Major Grey's Chutney. I had wanted the hot kind. I didn't add any salt but I did pepper the chicken before putting on the sauce. I put cayenne pepper on some of the thighs and ground black pepper on the others. The cayenne pepper was a little too hot for my taste so maybe I would not have like the hot chutney after all. It was plenty salty enough. I heartily recommend this recipe because it is so easy to prepare and it is so unique tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAMPPJPATTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/968171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-12T03:00:46.81Z",
                "reviewBody": "This is Fabulous! If you live in So. Cal. try using Patak's Major Grey Chutney or Spicy Mango Chutney. I also add sliced green onions to give it some extra color. To complete it as a meal try slivering mango & yellow or orange peppers laid on top of a bunch of sunflower sprouts. (yes that is sunflower sprouts - suppose you could use baby spinich or arugala.) Presents as beautiful as it takes. Everyone always asks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLYJOELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-25T03:44:04.013Z",
                "reviewBody": "OK folks...I tried this recipe based on what everyone else had written....& you all were right! It really was good. I've heard of chutney (somehow thought of it being British) but had never used it before. My variations to the basic recipe: as suggested in other reviews I left out the salt; but kept in fresh ground pepper. I also added a large dollup (such a precise term!) of orange marmalade; it was super tasty! It prob. did make the sauce a bit less thick but the subtle orange flavor was worth it. Also used a large casserole dish &added a mix of baby carrots fresh asparagus cauliflower & broccoli with butter & black pepper in a foil \"wrap\". The veggies cooked along w/the chicken but you may want to check them as you go. It did take me a bit longer to cook the whole thing than was listed. But it was REAL good. I will def do this one again. Enjoy!;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSLIZ2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T18:33:38.387Z",
                "reviewBody": "So easy and sooooooo good! I used chicken legs in lieu of thighs and drizzled a little bit of olive oil on top before baking. Served with Israeli couscous and steamed green beans. Tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "analufranco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4854244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T18:58:33.75Z",
                "reviewBody": "Well I had to only give it 2 stars because I thought it was \"ok\" but my husband did not care for it at all. He was not into the taste of the sauce. There was something \"off\" about the taste to me but I couldn't put my finger on it. I guess it just wasn't for us. I made it exactly as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce Morones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1492975/"
                }
            }
        ]
    }
]