[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8691/chicken-enchiladas-i/",
        "name": "Chicken Enchiladas I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F04%2F05%2FChicken-Enchiladas.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-06-08T03:55:52.000Z",
        "description": "This is a quick and easy recipe. Good for quick suppers.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "1 onion, chopped",
            "½ pint sour cream",
            "1 cup shredded Cheddar cheese",
            "1 tablespoon dried parsley",
            "½ teaspoon dried oregano",
            "½ teaspoon ground black pepper",
            "½ teaspoon salt",
            "1 (15 ounce) can tomato sauce",
            "½ cup water",
            "1 tablespoon chili powder",
            "⅓ cup chopped green bell pepper",
            "1 clove garlic, minced",
            "8 (10 inch) flour tortillas",
            "1 (12 ounce) jar taco sauce",
            "¾ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium, non-stick skillet over medium heat, cook chicken until no longer pink and juices run clear. Drain excess fat. Cube the chicken and return it to the skillet. Add the onion, sour cream, Cheddar cheese, parsley, oregano and ground black pepper. Heat until cheese melts. Stir in salt, tomato sauce, water, chili powder, green pepper and garlic.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll even amounts of the mixture in the tortillas. Arrange in a 9x13 inch baking dish. Cover with taco sauce and 3/4 cup Cheddar cheese. Bake uncovered in the preheated oven 20 minutes. Cool 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Debbie Donham"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.471661237785017,
            "ratingCount": 3070,
            "itemReviewed": "Chicken Enchiladas I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "498.4 calories",
            "carbohydrateContent": "49.7 g",
            "cholesterolContent": "72.2 mg",
            "fatContent": "15.9 g",
            "fiberContent": "3.9 g",
            "proteinContent": "26.7 g",
            "saturatedFatContent": "9.4 g",
            "servingSize": null,
            "sodiumContent": "1226.7 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-16T19:56:12.29Z",
                "reviewBody": "I know many if you have found this recipe to produce a soupy mess if the water isn't cooked down. Please try my variation on the recipe: \n\nOmit:\n1 (15 ounce) can tomato sauce \n1/2 cup water \n1 (12 ounce) jar taco sauce\n1 tablespoon chili powder\n1/2 pint sour cream   \n\nReplace the ingredients above with the following:\n\n1 can (10 oz) La Preferida Enchilada Sauce (Hot or Mild)\n1 jar (16 oz) Frontera Grill Salsa (I like the Chipotle Salsa)\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1754461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-07T21:52:54.597Z",
                "reviewBody": "This is one of the favorite things I've made from this site.  It was very time and labor intensive the first time I made it, but each subsequent time I get faster.  I make a double or triple batch, and freeze the extras after rolling.  When I'm ready to prepare I take out the amount needed and put in a baking dish, throw on the sauce and cheese and into the oven.  The second and third times I serve it from frozen are even better than the first batch that doesn't see the freezer!  Using the other reviewers suggestions, I omit the water, substitute salsa for the tomato sauce, chopped chiles for the green pepper, red enchilada sauce for the taco sauce, and use reduced fat cheddar. I poach my chicken in some chicken broth and herbs, then shred it with 2 forks.  I've also tried it with a supermarket roasted chicken, but my family likes it best when I've poached it.  Sooooo delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OneSweetShannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T19:18:17.233Z",
                "reviewBody": "This is a fabulous recipe!! Since I'm not one to follow recipes to a \"T\", I too made some modifications.  Instead of the green pepper I use green chiles, more chili powder, and a few dashes of ground cayenne pepper to spice it up.  I also use very little water and about half of the recommended tomato sauce.  For a rich and creamy flavor, try adding a few tablespoons of cream cheese and some Monterey Jack--it's wonderful!  I've also added refried beans to these enchiladas and they turned out great. Overall, this recipe needed some modifying to suit my tastes (I also used red enchilada sauce rather than salsa), but it's a good base for the best chicken enchiladas I've made yet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PackerBacker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/733528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-05T19:39:10.607Z",
                "reviewBody": "These are wonderful! I do make some modifications so they are more like the Mexican food I am used to eating which does not have red sauce on the inside. I prepare the chicken in chicken broth and shred instead of cube. Next I add the cheese and other ingredients but I do not use tomato sauce or water for the filling. I also add green chiles to this mixture. I then roll and place in the pan. I use enchilada instead of taco sauce as the topping. I find the flavor is better. I do not buy the commercial brands of the sauce (like El Paso) which can taste strange and instead look for a Mexican variety. These are a big crowd pleaser and it is easy to multiply the recipe for large groups. I highly recommend them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2618512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-25T16:14:40.497Z",
                "reviewBody": "Very yummy enchiladas!  Probably will become a staple in our household.  Minor varitations based on other reviews.  YOU MUST:  Poach your chicken with a mixture of poultry seasonings, cumin, minced garlic, tomato sauce, and chicken broth.  This will make your chicken FABULOUS and trust me, this makes all the difference in the taste of the enchilada!!!  Substitued a 1/2 jar of Ariba Roasted Mexican Red Salsa (medium) and a 12 ounce bottle of La Victoria red taco sauce (mild) for the water and tomato sauce (much needed change).  Also cuts down on the sogginess other reviewers have complained about!    Used the Red Enchilada Sauce from this site to finish it off.  Absolutely superb!!!  HELPFUL HINT: this recipe freezes extremely well.  Thanks Debbie for a great recipe to build on for personal preference!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T18:28:36.413Z",
                "reviewBody": "These were incredible!  For the filling I skipped the tomato sauce and water and used an 8 oz. jar of taco sauce instead.  I also used a 4 oz. can of green chilis instead of green pepper.  Also 1/2 pint of sour cream equals 1 cup.  I used about 3/4 cup and Mexican blend cheese instead of Cheddar.  I topped the whole thing with a 10 oz. can of enchilada sauce mixed with about 1/4 cup of half and half to make it nice and creamy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-26T01:52:53.577Z",
                "reviewBody": "What the heck? I am just not getting the high rating on this recipe. I agree with MSAGGIEAMY (9/11/05) review. She mentioned growing up in Texas and exposed to much better enchiladas. Same here for Cali, where I am from and live. I figure that must be why we are so picky, this is nothing more than a smothered burrito. And not a very good one at that. With the spices used, you'd think it would have some flavor. But not! How the heck did this recipe get in a cookbook? First of all, I've yet to find a flour tortilla enchilada recipe that was actually worth making a second time. But you know what? That darn number, 533 ratings, 415 reviews, 5 star average, and published in a cookbook, really suckered me in. I'm dumbfounded still by it, and wish more people would be more honest. I'd like to know if the people who said it was the best had ever made real enchiladas before. I'd like to know where they are from and their cooking experience. I am sending the rest of the enchiladas to my husbands work tomorrow and asking him to put a sign on the breakroom fridge offering them to people for free. I am not trying to be rude or mean or slam the author of the recipe. I'm just frustrated at wasting my time & money on something only to be be extrememly dissatisfied.\r\n\r\nI've gone through every single rating now, bewildered still. There are other's that agree, I urge anyone that is trying this recipe to read them all first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LadyBugMomma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/552004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-10T20:37:38.27Z",
                "reviewBody": "I was very surprised at how good this recipe turned out! I had company over, and one of my guests was Mexican/American...all she said was WOW!!!!!!! When did YOU learn to cook real Mexican food????  It turned out great....I followed the advice given here, and eliminated the water, sauted some garlic, onion and green pepper together, and used only 1/2 of the tomato sauce.  I eliminated the taco sauce, and used the Red Enchilada Sauce recipe found on this site.  Totally awesome, and not too much effort.  Served Mexican Rice, also found on this site.  Excellent meal, and as husband stated...it's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1BUSYMOMNTX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-30T23:40:25.21Z",
                "reviewBody": "The overall taste of this recipe is great. However I made the recipe without reading the reviews first and was sorry. Omit the water or you will have a soupy mess. I made do by using a slotted spoon to put the chicken peppers and onions into the tortilla shells and then pouring the rest of the mixture over the top along with the taco sauce. I used 8\" wheat tortillas and that seemed to work well in the casserole dish. next time I will use precooked chicken to cut down on the time. This is not exactly a quick supper. Also a whole tablespoon of chili powder was a bit much for me and I wasn't able to offer it to my toddler.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NLNELMS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680393/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Enchiladas I",
            "description": "See how to make quick-and-easy Chicken Enchiladas.",
            "uploadDate": "2012-04-13T17:48:09.604Z",
            "duration": "PT3M45.225S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fdadf62c6-b8a6-4bec-beba-21541ce0f8fb%2F95113bda-3bfb-47ba-b7ed-90f2b83ca095%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1560889041001"
        }
    }
]