[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8254/fresh-coconut-cake/",
        "name": "Fresh Coconut Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F13347.jpg",
            "width": 2496,
            "height": 1664
        },
        "datePublished": "1999-06-16T13:46:39.000Z",
        "description": "This delicious cake is made with fresh coconut. This one makes three 9-inch layers.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "3 9-inch layers",
        "recipeIngredient": [
            "2 cups coconut, drained and meat grated",
            "1 cup milk, or as needed",
            "3 cups all-purpose flour",
            "3 teaspoons baking powder",
            "½ teaspoon salt",
            "½ cup butter, room temperature",
            "½ cup shortening",
            "2 cups white sugar",
            "4 eggs, room temperature",
            "1 teaspoon vanilla extract",
            "¼ cup water",
            "1 cup white sugar",
            "⅛ teaspoon cream of tartar",
            "1 pinch salt",
            "2 egg whites",
            "1 teaspoon vanilla extract",
            "⅔ cup butter, room temperature",
            "2 cups grated fresh coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round baking pans. Reserve coconut juice and add enough milk to make 1 cup; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, sift together flour, baking powder, and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the butter, shortening, and 2 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the coconut-milk mixture, mixing until just incorporated. Fold in 2 cups grated coconut, mixing just enough to evenly combine. Pour the batter into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cake is golden and a tester inserted in the center comes out clean, 30 to 35 minutes. Cool completely on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Icing: In a saucepan, combine 1/4 cup water, 1 cup sugar, cream of tartar, and pinch of salt. Bring to a boil, stirring occasionally. Stop stirring once mixture is boiling. Cook until sugar syrup reaches soft ball stage on a candy thermometer (240 degrees F or 115 degrees C). If you don't have a thermometer, drop a little sugar syrup into a cup of cold water; when the syrup is ready, it will form a soft ball that holds its shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While syrup is boiling, whip egg whites at medium-high speed until stiff but not dry. Carefully pour the hot syrup down the side of the bowl, beating constantly at high speed. Keep beating until mixture is cool to the touch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop butter, a tablespoon at a time, into egg white mixture, beating constantly. The mixture will deflate as butter is added; just keep mixing. When all of the butter is incorporated, frosting will fluff up again. Blend in vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread buttercream between, around and on top of each layer. Sprinkle grated coconut on top of each frosted layer.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lynne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1923076923076925,
            "ratingCount": 26,
            "itemReviewed": "Fresh Coconut Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "674.8 calories",
            "carbohydrateContent": "79.5 g",
            "cholesterolContent": "111.1 mg",
            "fatContent": "37.7 g",
            "fiberContent": "3.2 g",
            "proteinContent": "7.7 g",
            "saturatedFatContent": "22.2 g",
            "servingSize": null,
            "sodiumContent": "393 mg",
            "sugarContent": "52.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-10T11:25:43.423Z",
                "reviewBody": "i havent tried this recipe yet.but wanted to share some info about using fresh coconut which is used widely in most of the asian cuisines.simple way to break open a fresh coconut which we use back home is to simply dip the whole coconut in a bucket of water for 5 min.then hit it on some hard object to crack it a bit.once cracked keep a strainer to filter and catch the coconut water.once 2 get 2 halves keep it in the fridge for few hrs ( this makes the coconut to loosen from the shell).then with a knife cut chunks of the flesh and put in the food processor.this gives a nice flaky coconut.hope this is useful and do write about how this method worked for u all.thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "vidh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1816831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-28T19:09:50.63Z",
                "reviewBody": "Wonderful desert. I like mile high cakes. I would like to share a tip for the frosting. You should use a candy thermometer to watch the sugar. I doubled the frosting. After the sugar mixture reaches the correct temp (soft ball) remove from heat and wait about ten mins before you beat the whites. After you stream the the sugar mixture into the whites let the mix cool off before you add it to the whipped marshmallow. You can do this by letting it beat on high for up to 12 mins. If not the butter will melt and you may end up with soup. (your looking for about 85degrees. Then I just drop in 2 tbls at a time of room temp butter. If it seems a bit soft (too runny to spread) just place the whole mix in the fridge for 5 mins. and whip again. But be careful not to let it build condensation while in the fridge or the whole thing will collapse.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THOMJANICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T23:26:03.327Z",
                "reviewBody": "Very good!! I cut the recipe in 1/3 and still came out with a very good 2 layer cake. Added a little more sugar and substituted the coconut-water instead of plain old water. Had a bit of trouble too like the review above with the icing but all in all it still came out yummy. Here's a hint on how to use fresh coconut (I had to do a bit of research!) Crack coconut open carefully you can do this with a screwdriver and a hammer into one of the \"eyes\" and pour out & save the coconut water. Once you have the coconut in large pieces (halves more or less) put them on a cookie sheet in an oven heated to 250 for 10-15 minutes. This will make the meat loosen up a bit from the shell and easier to get out. You'll still probably have to pry. Then there is another layer of brown skin you'll have to slice off with a paring knife before you throw the meat into the food processor.:) It's a little bit of work but definitely worth it in the end.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRCOX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-18T14:49:34.78Z",
                "reviewBody": "I've been searching for a coconut cake recipe that would be as good as my late grandmother's recipe (now lost). My dad said this was close and everyone else just raved about it. Perfect for those special occaisions. Also due to time constraints I did not use a fresh coconut and substituted canned coconut (much more moist than bagged coconut.) The results were still fabulous. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZARD42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1119441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-02T15:23:02.333Z",
                "reviewBody": "This cake was a very good use for a fresh coconut. It's lasted and tasted fresh for 1 1/2 weeks so far. Just put the bottom layer in the freezer. It was simply delicious! Not too sweet firm you can tell it's a from scratch cake. Took from 9-2 to make starting with opening the coconut. There are good hints below about making the old fashioned cooked frosting which I followed which was really tasty! It turned out perfect. Might double the frosting recipe next time to decorate the sides of the cake. It was for a birthday party looked adorable and everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BestGrammieBear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5691900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-29T14:47:56.7Z",
                "reviewBody": "HOLY COW!!!!! I made cocnut frosting and toasted coconut for the 2 layer and frosted the 3rd seperately with lemon frosting and served it with a scoop of sweetened crushed pineapple!!! 2 cakes for my function out of one recipie!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TROYANDMISSY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1135363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T18:17:46.553Z",
                "reviewBody": "This a beautiful cake--well worth making!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scarlett Hedden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/78614/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T18:16:54.937Z",
                "reviewBody": "I made this cake for Easter and won rave reviews for it. I added a tsp. of almond extract plus the vanilla and it was wonderful. This recipe is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESA CARUSO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-04T20:32:33.803Z",
                "reviewBody": "I made this for the first time following the directions exactly and it was perfect! I couldn't have been happier. I did double the frosting to make enough to cover the sides which was good. Beautiful cake and wonderful flavor/texture! This is going to be a stand-by.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikole Heikes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6836025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-21T00:32:36.33Z",
                "reviewBody": "The instructions for this recipe are off. The ingredient list calls for 1 cup of milk then never states what to do with it. I know the directions stated to top off the coconut water to equal one cup so I figured that's what that 1 cup of milk was for...but it's not. You have to add it to the cake batter or it comes out tasting like flour and is dry. The icing is terrible. I spent half the afternoon shelling and grating a fresh coconut then having to remake the icing using my own recipe for cream cheese frosting only for it all to taste like a load of except for my frosting. Do not make this it's not worth the hassle. The recipes using a white cake mix are much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "April",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/356163/"
                }
            }
        ]
    }
]