[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10267/italian-fig-cookies-i/",
        "name": "Italian Fig Cookies I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F555484.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-01-05T19:00:11.000Z",
        "description": "This recipe has been handed down through my mother's family for years.  My grandmother brought it with her from Italy in the early 1900's.  My mom taught me the recipe this year.  Now I am the designated person in our family to make the Fig Cookies.  This is a very high honor.  So they must be as good as my Grandmothers' cookies.  Some call them Homemade Fig Newtons.  They are a tradition at Christmas and are wonderful with a hot cup of coffee.  They are lot of work.  I make them in stages.  First the dough, then a few days later the figs, and finally I will make the cookies.  The dough and the figs keep well in the refrigerator and the cookies freeze very well.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 -5 dozen",
        "recipeIngredient": [
            "2 cups shortening",
            "3 cups white sugar",
            "6 eggs",
            "8 cups all-purpose flour",
            "7 teaspoons baking powder",
            "2 tablespoons vanilla extract",
            "1 pinch salt",
            "2 cups whole milk",
            "4 pounds dried figs",
            "1 pound raisins",
            "2 teaspoons ground cinnamon",
            "½ cup white sugar",
            "1 whole orange, with peel",
            "1 small apple",
            "1 ½ cups chopped pecans",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Dough:  Cream sugar and shortening.  Add eggs, vanilla, and salt.  Blend in flour and baking powder by hand.  Knead dough until smooth and workable.   Add milk to reach workable consistency.  (This takes a while and you will get a workout, but you'll know when it's right.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling:  Cut up figs, orange, and apple into small pieces.  (It is easier to grind this way).  Grind figs, raisins, orange, and apple.  If the mixture is too dry or thick, mix in up to 1 cup of water, if desired.  (I do not use the water, the juice from the apple and orange are enough).  The spices and chopped nuts are added to the ground fig mixture.  After the fig mixture is ground, I sprinkle them in over the mixture and mix (knead) it in by hand.  STICKY!  But good.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out some dough. (should be kind of thin).  Put fig mixture in a line.  Wrap dough over mixture, sealing figs inside dough.  Trim to desired length, using a diagonal cut.  Make small diagonal slits in the sides of the cookies.  Bake on ungreased cookie sheet for 10-15 minutes.  (Dough makes good cookies without the filling also).  Wonderful  with coffee.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Mary Jo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.388888888888889,
            "ratingCount": 36,
            "itemReviewed": "Italian Fig Cookies I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "301.5 calories",
            "carbohydrateContent": "51.9 g",
            "cholesterolContent": "19.4 mg",
            "fatContent": "10.1 g",
            "fiberContent": "4.9 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "71.8 mg",
            "sugarContent": "33.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-03T16:56:40.397Z",
                "reviewBody": "This is an excellent recipe for a traditional Sicilian Christmas cookie. Almost all Americans with grandparents from Sicily are thoroughly familiar with this fig cookie. In the dialect of my paternal grandparents these cookies were known as \"uccidati\". In Italian they are normally called \"cuccidati\". Some use the word \"buccellati\" A plethora of recipes for Italian fig cookies can be found by googling  \"cuccidati cookies\" and \"buccellati cookies\". My wife of Scotch-Irish heritage went out of her way to master the baking of cuccidati each Christmas - she soon realized how much I considered them to be a part of my traditional Christmas. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "William Chas.Caccamise Sr, MD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T00:15:31.84Z",
                "reviewBody": "This recipe makes tasty cookies, but the quantity estimate is way way off.  I made a quarter-batch and it produced 41 cookies that were probably twice the size of Fig Newtons.  In order for a full batch to make the estimated 4-5 dozen cookies, they would need to be probably four times the size of Fig Newtons.  Maybe that's what you're going for, but I think that's a mammoth wad of fig goo.  I also think the dough-to-filling ratio is a bit off.  I would probably use 2/3 as much filling next time.  Still, this recipe was spot-on in terms of making tasty fig-filled cookies.  The raisins and apple add a nice sweetness to the dried figs without interfering with the flavor.  Be careful not to overdo the orange.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Matt Kuzma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4052202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-13T15:13:09.577Z",
                "reviewBody": "These cookies are quite good!  I am a big fan of Fig Newtons, and I would prefer these to the Newtons any day!  The only complaint I have though is that the dough definitely has a shortening flavor to it that I can't really get used to.  Perhaps I'm just a purist in these situations, but I still think that using real butter in baked items such as these is still the best way to go...and somebody has yet to prove to me otherwise!  I think I will try making these cookies again using butter instead of shortening to see how it turns out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLAYA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-12T22:08:31.153Z",
                "reviewBody": "My family has been making a similar recipe for as long as I can remember always at Christmas time. My family is Sicilian and to us they are called \"Cuchidata.\" The difference is that we grind a mixture of dried fruits (figs raisins candied orange and lemon peel pineapple candied cherries etc.). Then we flavor it with bourbon and let the mixture sit for a day or two. They are absolutely delicious and freeze beautifully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAYLADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704344/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-16T21:33:40.78Z",
                "reviewBody": "This is the most dynamic cookie recipe I've come across. The fig cookies came out amazingly -- tasted just like fig newtons. I have also used just the dough recipe to make peanut butter cookies chocolate chip cookies chocolate cookies plain vanilla cookies and thumbprint jelly cookies. Every time they have been amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3387875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-09T16:56:43.607Z",
                "reviewBody": "First time making fig newtons. These cookies are pretty easy to make and they taste great! My friends all raved about them. I used non salted butter in place of shortening. But if you use butter remember to put the dough in the refrigerator for at least an hour so the butter sets up and you can roll out the dough easier. Also be careful about using the full recipe becasue it makes a lot of cookies. I used 1/3 of the recipe for the filling and 1/4 of it for the dough. It made about 18 cookies. I made some cookies with the left over dough and put vanilla icing and sprinkles on them. Very tasty with coffee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Likes-To-Bake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5083805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-09T14:01:23.717Z",
                "reviewBody": "this reciped is so close to the one my grandmother left me but instead of figs or dates for filling i found this dough excellent for mincemeat filling without all the fuss.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TIMSMOM23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1061546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-23T20:22:01.41Z",
                "reviewBody": "Grinding the filling means to put it in what is called a meat or sausage grinder. The manual ones clip onto the edge of the table or cabinet and a handle is turned. There are some that have a vacuum base. There are electric ones and Kitchen Aid has one as an attachment for their mixer. A food processor will not substitute for a grinder. The texture will be different and much coarser which is why your filling was too thick and dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Parrish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6447871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-13T15:13:49.17Z",
                "reviewBody": "this is the same recipe my Mom used and now I use. It was great seeing it here. We were the only ones that I knew of that used the orange. It came out the same as my recipe and was delicious. Are we related Mary Jo? Sal in Erie",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SALLIEIS60",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-03T13:05:10.987Z",
                "reviewBody": "I found the dough didn't seem to have the right consistence so I will experiment but I used mincemeat instead of the figs and besides the dough not coming out right it was delicious",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bklein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4313259/"
                }
            }
        ]
    }
]