[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13885/lentil-loaf/",
        "name": "Lentil Loaf",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F149856.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-06-20T17:49:41.000Z",
        "description": "This vegetarian staple features a crunchy bread crumb topping.  Make it the centerpiece of your meal, and serve with a savory vegetarian gravy, mashed potatoes, and English peas.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ⅛ cups green lentils",
            "2 ¼ cups water",
            "6 slices white bread, torn into small pieces",
            "2 eggs",
            "1 cup vegetable broth",
            "2 tablespoons tomato paste",
            "½ teaspoon dried basil",
            "¼ teaspoon garlic powder",
            "½ teaspoon ground black pepper",
            "1 teaspoon dried parsley",
            "1 tablespoon olive oil",
            "½ packet dry vegetable soup mix",
            "⅓ cup dried bread crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine lentils and water in a small saucepan. Bring to a boil. Reduce heat, and simmer until tender, about 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C). Grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together 2 cups cooked lentils, bread, eggs, broth, tomato paste, basil, garlic powder, black pepper, parsley, olive oil, and dry soup mix.  Spread into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 40 minutes.  Sprinkle top with dry bread crumbs, and continue baking another 10 minutes. Let sit for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KDCG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.216931216931217,
            "ratingCount": 189,
            "itemReviewed": "Lentil Loaf",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "272.2 calories",
            "carbohydrateContent": "40.9 g",
            "cholesterolContent": "62 mg",
            "fatContent": "5.6 g",
            "fiberContent": "12.4 g",
            "proteinContent": "14.6 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "368.6 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-10T19:35:02.797Z",
                "reviewBody": "I REALLY liked my version...after reading the reviews, I knew I had to spice it up some.  \nFirst off, I added a bouillon cube to the water when boiling the lentils. \nI then sauted 1/2 an onion, some green pepper, left-over jalapeno, grated carrot & minced garlic. \nI used 1/2 cup italian bread crumbs instead of bread, ketchup instead of tomato paste, and italian seasoning instead of the spices and soup mix. \nI also added a dash of chili sauce and a dash of worcheshire sauce.\nI did not put bread crumbs on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DC Girly Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-19T17:40:01.75Z",
                "reviewBody": "Made this up last night and was stunned with the results. Growing up vegetarian, I've eaten a lot of lentil loaf (and cottage cheese loaf) and always thought it was too dry and tasteless. Then I found this recipe. My carnivore husband went back for seconds and told me it was better than any meatloaf he'd ever eaten! I added an additional egg, used wheat bread instead of white, subbed ketchup for the tomato paste and used onion soup mix rather than vegetable. Just had the leftovers for lunch. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fussybritches",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2407083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-19T01:33:03.403Z",
                "reviewBody": "I have made this twice, the first time exactly as written, and it was a little too salty. The second time I followed the others' reviews and used ketchup instead of tomato paste, as well as water instead of vegetable broth. This turned a so-so recipe into an amazing recipe. This will become a staple in my house. \n\nOne note: be sure to let the loaf cool for a while before trying to remove it from the pan...the first time I removed it too soon and fell apart. The second time I let it cool for a while and it held together nicely. Adding another egg might solve this problem too if you're not going to have time to let it cool, but I haven't tried it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sininen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1946308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T05:36:59.577Z",
                "reviewBody": "I really recommend this recipe; it's great comfort food.  It uses lentils in a much better way than any other lentil recipe I've tried in the past.  However, in all fairness, I should mention that I didn't follow it exactly.  I was anticipating that it might be too dry (after reading some of the other reviews) and added an extra egg and a little more olive oil.  With these changes, I liked it a lot - 5 stars - but the recipe as is gets 4 stars.  Other modifications:  I put cheddar cheese on top instead of bread crumbs - 10 minutes at 400 degrees turned out to be just right for a cheese \"crust\".  I used potato soup mix, and it really complemented the other ingredients.  Also, I divided the mixture into two small loaf pans so that I could freeze one for later.  Thanks, Karen!   EDIT 11/1/06:  These loaves reheat perfectly!  I thawed mine out in the oven until it was soft enough to cut, then sliced off a piece and nuked it, & refrigerated the rest until I used it all up.  Worked like a charm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Beckerkorn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1211694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-19T01:44:01.263Z",
                "reviewBody": "This was great! I took the advice of other reviewers and added an extra egg. I also added fresh onion garlic and portobello mushrooms. This one's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KADart05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1701936/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-26T22:10:45.44Z",
                "reviewBody": "Just finished making this and I must say I am optimistic. I have tried multiple lentil loaves that have turned out mushy nothing like a loaf. I followed the suggestions of others and substituted ketchup for tomato paste & whole wheat bread for white. I used crimson lentils as well and the color of the loaf and consistency going into the pan was far firmer than other attempts. Instead of bread crumbs I put a little barbecue sauce on before putting it in the oven and cheese for the last 10 minutes. Overall it looks and smells terrific. It sliced easily and everyone in my family loved it although we all love lentils. This was a great recipe although I might try using egg replacer instead of the egg next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/467578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-05T01:59:19.233Z",
                "reviewBody": "this was so good. i put 1/2 of the lentil mixture in the loaf pan sprinkled mozzarella cheese and covered it with the remaining mixture. even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PANDORA1106",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T23:06:46.587Z",
                "reviewBody": "This was the first lentil loaf I've ever tried to make. I was please with my results though I have started getting  ideas for the next time I make this. \n\nI thought the flavor was very good with the dry soup mix and  vegetarian vegetable broth (not water as some suggest).\n\nMy loaf didn't stay together very well when I pulled it out of the pan at the end of the 10 minutes (the bottom and top seperated horizontally as it was flipped and pried out of the pan  even though I used an extra egg as one reviewer suggested.\n\nI think I might make lentil cupcakes next time and hope that they come out easier. I would suggest lining your loaf pan with either parchment or wax paper before filling with the lentil mixture if you like to make a nice presentation.\n\nI would not suggest adding the 1/3 cup of bread crumbs as suggested either...just a dusting will do as the rest will just fall off.\n\nAll in all, I was very pleased with this dish. Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "spidermonkey555",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/179787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-15T00:29:48.033Z",
                "reviewBody": "After reading all the reviews I took some suggestions and made a few modifications of my own. I sauted an onion carrot 2 stalks of celery and half a green pepper. I threw in 2 chopped garlic cloves for the last minute. I added one extra egg and 1/2 a cup of whole grain bread crumbs. As I am concerned about sodium and most dry soup mixes are incredibly high I left out the dry soup mix and put in 1 cup of water instead of vegetable broth. Also used 2 tbls of low cal ketchup in place of the tomato paste. I basically stood in front of my spice cupboard and threw in a bit of everything. I had the lentils in one bowl with the bread crumbs and sauted veggies and in another I combined the eggs water ketchup olive oil and some chopped cilantro. Gave it all a good whisk then added it to the lentil bowl. Mixed everything well and put it in a convection oven at 400 degrees for 40 minutes. Took out let sit for five and then enjoyed. Did not put breadcrumb topping on. Was really delicious - nice and moist. I'd made a lentil loaf before and it was dry and tasteless. This was a winner and I'll make again and recomend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bollistoli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2633102/"
                }
            }
        ]
    }
]