[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14930/main-dish/sandwiches/sloppy-joes/",
                    "name": "Sloppy Joe Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13893/unsloppy-joes/",
        "name": "Unsloppy Joes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3379581.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1999-06-20T17:59:23.000Z",
        "description": "Not guaranteed to be a completely unsloppy experience, but these filled kaiser rolls come close.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "½ cup chopped onion",
            "½ cup chopped celery",
            "½ cup chopped carrots",
            "½ cup chopped green bell pepper",
            "1 clove garlic, minced",
            "1 (14.5 ounce) can diced tomatoes",
            "1 ½ tablespoons chili powder",
            "1 tablespoon tomato paste",
            "1 tablespoon distilled white vinegar",
            "1 teaspoon ground black pepper",
            "1 (15 ounce) can kidney beans, drained and rinsed",
            "8 kaiser rolls"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large skillet over medium heat.  Add onion, celery, carrot, green pepper, and garlic: saute until tender.  Stir in tomatoes, chili powder, tomato paste, vinegar, and pepper.  Cover, reduce heat, and simmer 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in kidney beans, and cook an additional 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut a 1/4 inch slice off the top of each kaiser roll; set aside.  Hollow out the center of each roll, leaving about 1/2 inch thick shells; reserve the inside of rolls for other uses.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon bean mixture evenly into rolls and replace tops.   Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes",
            "Sloppy Joe Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KDCG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1501597444089455,
            "ratingCount": 313,
            "itemReviewed": "Unsloppy Joes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "204.4 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": null,
            "fatContent": "3.9 g",
            "fiberContent": "5.8 g",
            "proteinContent": "7.8 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "488.8 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-10T20:40:53.373Z",
                "reviewBody": "My fiance and I really enjoyed this... but I made some changes based on what other reviewers said. First of all I made 16 servings instead of 8 and froze half. It froze and reheated really well! I would definitely recommend this. It is so easy to go ahead and double the recipe and a huge time-saver b/c of all the vegetables you have to chop. Secondly I added more vinegar to mine... I felt it gave the recipe more of the characteristic sloppy joes flavor. I went ahead and added twice the amount. I also only added 1/2 the amount of chili powder the recipe calls for and 1/2 the amount of black pepper. I like spicy stuff but all that pepper was still a little too overpowering for my tastes and it took away from the other flavors in the recipe. Overall this is really filling and even sort of fun to eat too especially with the kaiser rolls!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Loftin Berryman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2035572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-26T03:18:28.033Z",
                "reviewBody": "\"The best vegetarian food I have EVER tasted\"...\"A meat lover's perfect non-meat meal\"... those were some of the wonderful things my boyfriend was saying as he was eating his. He was almost in shock at how great they were (he's a carnivore at heart). I thought they were spectacular as well... and being a vegetarian myself I was able to appreciate them even more. I made a few alterations to the recipe though... my favorite alteration was using a red pepper instead of a green pepper. I think it added just a tiny bit of sweetness to an otherwise super-spicy dish. It also livened it up with more red color. I left out the celery because I didn't have any but truthfully I think it wouldn't have been as good with it. Since I didn't have any diced tomatoes I added 2 8oz cans of tomato sauce (which I think was a wonderful substitution). I also followed previous suggestions not to put in so much chili powder so I put in 1 1/2 teaspoons instead of 1 1/2 tablespoons. This was absolutely the right decision. Even a drop more chili powder and it would have been way too spicy. The best part was that my boyfriend was complaining when he was done that he was too full. That is by far the biggest compliment of them all because he's rarely full after eating a vegetarian meal. This is DEFINITELY becoming a staple in my diet. I couldn't be more pleased.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Filippone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/princessnk/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-07T23:23:49.233Z",
                "reviewBody": "I doubled the recipe oh my way much more than needed. Good recipe. I gave 5 stars as it is hard to find healthy recipes that taste pleasing. This is one and it deserves 5 stars. I added a bit of tomato puree as i wanted a stronger tomato flavor and cut back a bit on the chili powder as previously recommended and i ended up with an excellent sloppy joe. Thanks for helping me to cook fabulous vegetarian dishes. Alongside a green salad with walnuts this is a great nutritious meal. Definately in my new recipe file of things to make over and over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELEKITCHEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1134599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-05T22:42:08.607Z",
                "reviewBody": "Made this a couple of nights ago and yes it IS delish! I didn't have any kaiser rolls though so we just ate them on wheat buns like normal sloppy joes. My dad couldn't put his finger on it but he's never tasted anything quite like this stuff. I'm surprised at how spicy it was-- usually I leave pepper and added salt out but I was afraid this would be bland so at t?e last minute I went ahead and added the black pepper. Wooo-EEE! It's not terribly spicy but I think it would be perfectly tasty with a little less. I'm returning to dorm life tomorrow but I will make this again next time I am home. Right now I am eating the left overs over brown rice and topped with light cheddar cheese. It's pretty good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEVINT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/510393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-22T22:22:40.483Z",
                "reviewBody": "This recipe was delicious and very filling. All the other vegetarian Sloppy Joe recipes I tried had TVP or veggie ground round and they were too rich and not filling. I think the 1 1/2 tablespoons of chili powder in the recipe was too much; next time I'll reduce it to 1 1/2 teaspoons. The recipe was easy to follow and this makes a great meal with a large green salad. Even my husband was filled up by two rolls and the Unsloppy Joe mix and he doesn't fill up easily! I will definitely make this again. Thanks Karen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CONSTANTREADER1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/444242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-19T01:24:45.973Z",
                "reviewBody": "This is great! Even my carnivore husband found them delicious and has asked for them again. I play around with the spices to suit our tastes. I add more chili powder and a couple of dashes worcestershire sauce to darken the flavor. I also leave out the celery since we hate celery. I serve it on regular hamburger buns with mustard and chips on the side. Have already made this recipe several times and will continue to do so. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LoveToCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1757399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-22T22:30:56.827Z",
                "reviewBody": "I made this dish for a lunch get together with a bunch of moms and it received rave reviews. I served it over rice and lessened the chili powder to 1 tbsp. I prefer it over the real sloppy joe anyday.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loves to cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-22T22:30:56.013Z",
                "reviewBody": "My boyfriend couldn't eat this; he said that it tasted of nothing but chili pepper. I thought that it was all right but I don't think I'll make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RAZZMATAZZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T23:06:04.903Z",
                "reviewBody": "This was good but way more like a veggie chili than a sloppy joe. I loved how inexpensive it was. I already had the spices onion and celery bought everything else and some nice big wheat rolls for around 8.00. It also went well in a wheat pita for smaller portions. Also it was just as good as a leftover.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyousfreee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2714803/"
                }
            }
        ]
    }
]