[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15836/strawberry-pie-ii/",
        "name": "Strawberry Pie II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F401339.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-06-21T01:52:21.000Z",
        "description": "This is my favorite pie. It is very easy to make. I got the recipe many years ago in North Jersey. It is from the Sussex County Strawberry Farms.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 (9 inch) pie crust, baked",
            "1 quart fresh strawberries",
            "1 cup white sugar",
            "3 tablespoons cornstarch",
            "¾ cup water",
            "½ cup heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Arrange half of strawberries in baked pastry shell. Mash remaining berries and combine with sugar in a medium saucepan. Place saucepan over medium heat and bring to a boil, stirring frequently.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, whisk together cornstarch and water. Gradually stir cornstarch mixture into boiling strawberry mixture. Reduce heat and simmer mixture until thickened, about 10 minutes, stirring constantly. Pour mixture over berries in pastry shell. Chill for several hours before serving. In a small bowl, whip cream until soft peaks form. Serve each slice of pie with a dollop of whipped cream.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "OKBEE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.580392156862745,
            "ratingCount": 1275,
            "itemReviewed": "Strawberry Pie II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "265 calories",
            "carbohydrateContent": "41.9 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "10.9 g",
            "fiberContent": "1.7 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "109.3 mg",
            "sugarContent": "29.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-21T07:13:46.563Z",
                "reviewBody": "This stuff is the bomb! I cheated, however, and modified it a little according to others opinions. Instead of leaving half of the berries unmashed and mashing the other half, I did 3/4 unmashed and 1/4 mashed. It was PERFECT - not too sweet and jammy that way! I still kept the measurements of cornstarch at 3T, but I cut down on the sugar (used 3/4 cup) and the water (used 1/2 cup). I did NOT cook the mixture for 10 minutes like the recipe says. I added everything together in the cold pot, then turned it on to med-high and stirred it CONSTANTLY until it started boiling. Leave it at boiling for 2-3 minutes. It gets thick really fast. I let it cool for a couple of minutes and poured it on the pie. After only 1 hour in the fridge, it was set perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Misty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1411616/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-26T14:13:22.813Z",
                "reviewBody": "We loved this pie for Easter. I used more strawberries in the sauce than it called for. The clencher that took it over the top was after the shell was baked I melted about 2 oz. of semi-sweet chocolate chips in the microwave and \"painted\" the inside of the crust with the melted chocolate! Unbelievably awesome! Strawberry pies are notorious for getting soggy - with the painted chocolate crust that was avoided. After you paint the crust be sure to put it in the refrigerator and let the chocolate set up before you fill it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BTEAMMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1009717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-19T15:08:28.34Z",
                "reviewBody": "I use a very similar recipe to this from a Farm Journals Pie Book (from 1965).  Mine just calls for more berries (1 1/2 qts.) and less water (only 1/2 cup).  You crush 1 cup worth of berries and add the water to that.  Mix the sugar and cornstarch together (will blend much better) and then bring the whole thing to a boil. Let it boil for 2 minutes until thick and translucent.  Add 1 tbs. butter and let it cool before adding to the crust.  I find that it avoids getting a soggy crust that way. I would highly (highly, highly, highly) advise never to use store bought strawberries.  If you have a farmers market or a pick-your-own place just use those.  You'll never get the true flavor of the pie otherwise.  I just made this yesterday for Father's Day (made a 10-inch version) and there's none left.  Also good to try this with other fruit (I've done raspberries and peaches)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHELLYBERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/790539/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-12T21:55:10.36Z",
                "reviewBody": "For a great taste, use gingerale instead of water. What it does for the flavor is unbelievable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-10T16:49:08.61Z",
                "reviewBody": "I've made a silimar version of this pie for several years and the priamry differences are: I use fewer mashed strawberries and incorporated them into the simple syrup I made. For the simple syrup I used 1 cup water, 2 tablespoons corn starch and I cup sugar. Cook this mixture over meduim heat until thick and clear. Remove from heat and add 2 tablespoons strawberry Jell-O powder. Add mashed strawberries and proceed as directed. This give flavor and color to the pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GBKENNEDY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876819/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-11T05:12:15.84Z",
                "reviewBody": "I was rushing when I made this recipe the first time, and accidently dumped the 1/2 cup of whipping cream in with the mashed (or in my case, blended) strawberries, sugar, water, and cornstarch.  It was FANTASTIC!  I have made this recipe without the extra whipping cream, and I prefer the creamy version.  Cream or no, it is a fabulous and easy recipe.  My guests have left raving about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AMYLOU1218",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-13T14:08:44.03Z",
                "reviewBody": "8/8/06: A marvelous pie to take advantage of red, ripe strawberry season!  Although it is definitely a plan-ahead pie, as mine needed a full 24 hours in the fridge to completely set.  I sliced it at 12 hours and the interior was not yet firm (but maybe my strawberries were not completely dry from rinsing).  Taking a cue from other reviewers who found this pie too sweet, I used 3/4 cup sugar and found that it was just the right sweetness to complement the tart fresh strawberries.  After mashing, I used a hand mixer to puree the strawberries and liked the results.  It was delicious with a dollop of whipped cream on top, but I might even prefer a layer of vanilla custard on the bottom.  I think I'll try that next time.  Thanks for a wonderful New Jersey recipe! UPDATE 5/13/07: I've made this pie several more times, and I have decided the vanilla custard, while a nice addition, actually gets lost amongst the strong berry flavor.  The pie has never been as firm as I would like it to be, but the taste is consistently a big hit.  I have found that reserving some sliced strawberries to sink into the top after your pour the filling is a nice way to create an impressive presentation (the strawberries have to be covered by a little bit of the glaze so they do not dry out).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara Lazar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-04T18:08:53.953Z",
                "reviewBody": "This was one of two pies I made for my dad’s b-day; it disappeared so quickly that he didn’t even get a piece! I used ¾ c. sugar and mashed ¼ of the strawberries, but next time I may mash the recommended amount. I make all my crusts from scratch, but this was my first time making a pie where the actual pie filling didn’t need to be baked but the crust still did. Baking a pie crust w/o the filling inside is called pre-baking or blind baking. I did some research on this: when pre-baking a crust, it will need to be weighted so that the edges of the crust don’t fall down while baking. To pre-bake an unfilled pie crust place the crust in the pie pan, grease one side of a large piece of aluminum foil, and place the foil into the pan with the greased side down. Make sure the foil is large enough so that several inches of overhang are left around the pan edges; leave enough so that the foil can be grabbed and pulled out of the pan later. Next, weight the crust by filling the foil-lined pan with dry beans or rice, making sure to fill the pan all the way up. Bake at 450° for 8 to 10 minutes until the crust has firmed up, then remove the foil and beans or rice. To completely bake a pie crust whose filling will spend no time in the oven, continue baking the unweighted crust for 10 to 15 minutes more, or until golden brown. To just pre-bake a crust that will go back in the oven later, bake the weighted crust as above, remove the foil and beans or rice, and only bake 5 minutes more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina Pierson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2281230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-10T00:43:35.057Z",
                "reviewBody": "Without hesitation, this pie deserves more than a 5 star rating.  It is delicious.  If you really want to impress your guests, this is the way to do it. Look forward to making this pie with fresh strawberries from my garden this year.  By the way, I'm originally from North Jersey, Bergen County.  Now live in Upstate New York, been married to my husband, a dairy farmer, for 30+ years.  We have two children, and two grandsons. I do miss my hometown where I grew up and hope to visit there this summer.   Thank you for this recipe, and thanks for listening!!  God Bless.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELWINGS4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-17T00:35:12.123Z",
                "reviewBody": "This pie had a really good flavor but I could not get it to thicken.  My pie was nothing but strawberries swimming in pink liquid.  I followed the directions, adding the right amount of cornstarch and refrigerating for over 5 hours so I don't understand what went wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLE SJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/784114/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Strawberry Pie II",
            "description": "You won’t believe how easy, and tasty, this strawberry pie is.",
            "uploadDate": "2012-07-30T23:19:38.763Z",
            "duration": "PT3M5.686S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa18f73e5-260d-46a9-b3f4-a2cebf18d1c0%2F0d0c74d1-568a-49e8-b528-7eee756f8c9c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1762611419001"
        }
    }
]