[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15700/double-chocolate-pie/",
        "name": "Double Chocolate Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4867492.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1999-06-23T01:12:34.000Z",
        "description": "Rich and chocolaty, a truly sinful pie! Chocolate fans will love it! Garnish each slice with whipped topping.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT4H50M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 (9 inch) pie crust, baked",
            "1 ½ cups white sugar",
            "⅓ cup cornstarch",
            "½ teaspoon salt",
            "3 cups milk",
            "¾ cup semisweet chocolate chips",
            "2 (1 ounce) squares unsweetened chocolate, chopped",
            "4 egg yolks, beaten",
            "1 tablespoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine sugar, cornstarch, and salt in a 2-quart saucepan. Stir in milk gradually. Add chocolate chips and unsweetened chocolate. Place over medium heat, stirring constantly, until mixture thickens and boils. Boil and stir 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place egg yolks in a medium heatproof bowl. Gradually pour half of chocolate mixture into egg yolks, whisking constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk egg yolk mixture back into mixture in saucepan. Place over medium heat and bring back to a boil, stirring constantly. Boil and stir 1 minute. Remove from heat; stir in vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour mixture into baked pie shell. Press a layer of plastic wrap onto filling. Refrigerate at least 4 hours but no longer than 48 hours. Remove plastic wrap before serving and top with whipped topping.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CORWYNN DARKHOLME"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.602605863192182,
            "ratingCount": 307,
            "itemReviewed": "Double Chocolate Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "433.7 calories",
            "carbohydrateContent": "67 g",
            "cholesterolContent": "109.7 mg",
            "fatContent": "17.6 g",
            "fiberContent": "2.3 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "292.8 mg",
            "sugarContent": "51.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-07-08T22:14:49.5Z",
                "reviewBody": "I will use this recipe in place of my old standby, which is a blue-ribbon winner. I followed the directions exactly and it came out perfectly.  We'll see how the county fair judges like it this year. Please note: one reviewer suggested to add 3 times more chocolate, add more cornstarch, and use whites instead of yolks. If you want a disaster on your hands, go ahead and take that advice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-21T22:55:48.45Z",
                "reviewBody": "This pie came out great - It was wonderfully chocolaty! I made it for my husbands B-day and he loved it. I followed the recipe exactly and it was perfect as is and I even live in high altitude. I didn't have any problems with it setting or anything else. The step where you mix the egg yolks separately in a bow is necessary so that the eggs don't cook when you add them to the hot chocolate mixture, if they cook as you add them then you will have lumps of egg yolks in your filling. Having them in a bowl and adding some of the chocolate mixture to them slowly takes the temp down a bit so this doesn’t happen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEDGEHOGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/258494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-28T12:05:21.943Z",
                "reviewBody": "For those of you who have a gritty result, I'd say it's not the kind of milk you're using (I used whole) but perhaps you're not dissolving the sugar/milk mixture long enough, or melting the chocolate thoroughly.  I whisked this recipe basically constantly  and it came out with a lovely texture.  It tastes like homemade chocolate pudding.  Very good and pretty simple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommymeggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-24T08:53:15.343Z",
                "reviewBody": "Good flavor but not suited for pie because it's a bit loose. Backed off the sugar and did 1 1/8 cup plenty sweet as it is with the choco. chips. Everything else followed exactly --and nope the Saran Wrap doesn't stick cool huh? Pie set for 24 hours in the fridge but still came out loose (we even used whole milk). Consistency of thick pudding -- excellent tasting pudding mind you but not quite thick enough to truly be a great cream pie. We'd cut a slice put it on a plate and it'd would blob into a gooey puddle that looked like pudding as soon as your fork hit it. Big no no for a pie. I may try this again and add a little more corn starch to see if that firms things up. I'm not a fan of pudding pies - pudding is good just not in a pie shell. If you dig instant pudding pies are content with that sort of gooey consistency and are looking to get a bit fancier than ripping open a box and dumping some milk in you may really dig this recipe. If you're not a pudding pie type this probably won't be for you. If you're just looking for a great rich pudding this is a great recipe sans the pie shell!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Impish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T18:57:03.097Z",
                "reviewBody": "This is a great base recipe, but it needs a couple changes in order to make it perfect.  First of all, DO NOT use chocolate chips.  Chocolate chips contain ingredients that can cause items to be soft-set.  Instead, I substituted 6 oz. semi sweet chocolate and then the 2 oz. unsweetened chocolate already called for in the recipe.  I suggest using whole milk simply because it will yield the best results, but I'm sure you could sub. lower fat milk and it turn out just fine.  I also used a chocolate graham cracker crust instead of the normal pie crust.  Once your milk/chocolate mixture gets warm, temper it into your eggs.  This essentially means to whisk constantly to ensure the eggs don't curdle.  Add that mixture back to the pot, and whisk constantly until it boils.  You want it to boil for a good minute and make sure you whisk during that minute.  Pour into a pie shell, cover with plastic wrap and chill.  For those who complained about it being lumpy, it could be you didn't temper the eggs correctly and you're tasting pieces of egg.  If it's grainy, you likely didn't cook it long enough and you're still tasting the cornstarch.  I'm sure using a store-brand chocolate chip can also yield lumpy results because they just don't melt the way toll house does.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STARZ7369",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T21:18:33.53Z",
                "reviewBody": "This chocolate pie is evil on a plate, it is sooooooo sooooooo yummy.  My husband made Christmas eve and had extra pudding in a bowl saved for mwa and I put whipped cream on and yes it is sinful.  It would even be GREAT served in fancy glasses w/ whipped cream if you don't have pie shell, I can't decide how I liked it better.  Don't change this recipe, why mess with perfection.  For pie give plenty of time to set up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "scarlett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1635404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-02T04:00:59.03Z",
                "reviewBody": "o.k. so this pie turned out super awesome! It totally wasn't THAT hard, and so worth it even if it was! It was so rich and chocolaty compared to the pudding versions. At the last minute before serving, I smothered the top with fresh whipping cream, then I  garnished it with chocolate curls that I made with a vegetable peeler. YUM",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSESGIRL04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1383128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T21:36:32.503Z",
                "reviewBody": "This must be a DEEP DISH pie shell...or use 2 regular pie shells. I poured the excess filling into dessert cups, and used Meringue II from this site to top the pie. ONE cup of sugar was perfect, and made the perfect chocolatey richness. 5 stars if the sugar were reduced.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "joy-of-jesus-smileymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-15T23:36:10.937Z",
                "reviewBody": "The chocolate is so rich it will make your teeth ache! I used 2% milk but next time I make this I'm going to use either whole milk or maybe half and half as the pie wasn't creamy enough for me. I would certainly be pleased to offer this to guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATYPI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2074840/"
                }
            }
        ]
    }
]