[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/850/desserts/cookies/nut-cookies/",
                    "name": "Nut Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13350/desserts/cookies/nut-cookies/walnut/",
                    "name": "Walnut",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10115/rugelach/",
        "name": "Rugelach",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F516810.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1998-01-07T19:48:59.000Z",
        "description": "This recipe is from Linda Shapiro. I have many rugelach recipes, but this is truly the best I have ever made.",
        "prepTime": "P0DT0H55M",
        "cookTime": "P0DT0H22M",
        "totalTime": "P0DT3H17M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "¼ teaspoon salt",
            "1 cup unsalted butter",
            "1 (8 ounce) package cream cheese",
            "⅓ cup sour cream",
            "½ cup white sugar",
            "1 tablespoon ground cinnamon",
            "1 cup finely chopped walnuts",
            "½ cup raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut cold butter or margarine and cream cheese into bits.  In food processor pulse flour, salt, butter or margarine, cream cheese and sour cream until crumbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape crumbly mixture into four equal disks. Wrap each disk and chill 2 hours or up to 2 days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine sugar, cinnamon, chopped walnuts, and finely chopped raisins (may substitute miniature chocolate chips for raisins).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll each disk into a 9 inch round keeping other disks chilled until ready to roll them.   Sprinkle round with sugar/nut mixture.  Press lightly into dough.  With chefs knife or pizza cutter, cut each round into 12 wedges.  Roll wedges from wide to narrow, you will end up with point on outside of cookie.  Place on ungreased baking sheets and chill rugelach 20 minutes before baking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "After rugelach are chilled, bake them in the center rack of your oven 22 minutes until lightly golden.  Cool on wire racks.  Store in airtight containers...they freeze very well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Variations:  Before putting the filling on the dough, use a pastry brush to  layer apricot jam as well as brown sugar. Then add the recommended filling. You may also make a mixture of cinnamon and sugar and roll the rugelach in this prior to putting them on the cookie sheets.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Nut Cookie Recipes",
            "Walnut"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jackie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.667785234899329,
            "ratingCount": 298,
            "itemReviewed": "Rugelach",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "101.4 calories",
            "carbohydrateContent": "7.9 g",
            "cholesterolContent": "16 mg",
            "fatContent": "7.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "27.6 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-26T21:09:12.72Z",
                "reviewBody": "These were a huge hit at the office. For anyone who is having issues with filling falling out I would suggest pushing the chunky parts of the filling to the outside of the circle (leaving the cinnamon/sugar mixure in the middle) before rolling. This way you can squeeze the raisins/nuts in as you roll. Also if you don't want to make the crescent shape you can use this recipe to make roulades (exactly the same cookie just a cinnamon roll-like shape). To do this roll the dough out either into a rectangle or circle. Then add the toppings. Roll the dough with the filling. Then cut into 1 inch pieces. (Note: If you rolled into a circle you'll need to cut a 1/4 inch piece off of each end before cutting the 1 inch cookie pieces.) Place seam side down for baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/gobaking/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T11:21:23.52Z",
                "reviewBody": "I have tried many Rugelach recipes, this was the easiest and came out the best. One note, the rugelach is always rolled out in a sugar cinnamon mix never flour if rolled and turned once it is covered in sugar, it is no problem to roll out at all. Mine was never sticky I chilled for 24 hours.  NEVER use table james or jellies for fillings, use Solo fillings which are specifically made to handle the hot temps of the ovens and they dont liquify as much. I used apricot and choc chips, I put nothing on top of them and they came out WONDERFUL. Company said they were stupendous, and when my company left and I finally went to have some for myself they were already gone. They lasted sbout 2 hours.  Too much work to give out on platters but a nice treat for company or for family. Will truly make this again.  Bakeries charges up to 7 or 8.00 a pound for these gourmet treats.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Silver Ghost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2347262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-01T00:28:56.263Z",
                "reviewBody": "Thank you, Jackie! Great recipe!! I made each of the four quarters of the dough differently, just to experiment.  One with cinnamon, white sugar and walnuts, one with rasberry preserves, one with chocolate ganache and walnuts and one with walnuts heated in a simple syrup (and then cooled). Brushed all of them with beaten egg white and sprinkled a little white sugar on top. I found that 20 minutes produced a rugelach that was lightly browned and was very flaky and tender when cooled. By baking them just two minutes more, they were a little crisper. Both ways are wonderful, and I'm sure I'll come up with other filling variations. Thanks again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Frederick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-09T20:19:48.073Z",
                "reviewBody": "Absolutely the best rugelach recipe that I have tried and I have tried a lot of them. Very easy to do in the food processor. I followed the recipe exactly. I chopped the walnuts and rasins in the processor also. The filling stayed put when rolling the cookie by simply pressing it onto the dough as the recipe stated. Most rugelach I have made leak all over the pan giving the cookie a burnt look on the bottom but these did not do that. The flavor is wonderful! Definitely try this recipe! It is a gem!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynnje",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1902553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T23:37:39.23Z",
                "reviewBody": "I can't say enough about this recipe. It is my new standard holiday gift. My son and I found that we could easily get 64 cookies out of this recipe and still have decent sized cookies. We made three varieties: raspberry all fruit jam and chocolate chips Apricot all fruit jam and almond paste and Trader Joe's Apricot Orange preserves with chocolate chips. I like them all equally however my co-workers enjoyed the raspberry chocolate best. Since making our first batch around Thanksgiving we've made no less than 300 cookies! I found that the easiest and fastest way to make them is to roll the dough out into a rectangle shape and brush with your jam or sprinkle with your sugar mixture add a line of the chunkier ingredients (chips nuts chopped fruit) as you roll. That is roll the rectangle as you would a jelly roll and after each turn flatten it a bit while laying down a line of the chunky ingredients along the edge of the roll. When finished cut with a pizza cutter for the perfect shape and size. This shaved at least 15 minutes off the prep. I made the first batch according to the recipe and then replaced all of the cream cheese with Neufchatel and the sour cream with 0% fat Greek yogurt. This did not change the texture or taste at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fig1007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3501291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T11:16:43.727Z",
                "reviewBody": "Jackie this Rugelach recipe was fantastic! The only thing you didn't mention was to make sure and throw some flour on the rolling surface and rolling pin to prevent the mixture from sticking and to help it cut and roll better. I made a batch of 48 for Christmas (I also added cherry jelly crushed almonds as filling) and they completely disappeared. On New Year's I doubled the recipe and they vanished again! Next time I know better and will quadruple it. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUMINARA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-21T04:20:39.043Z",
                "reviewBody": "I rolled the dough out into rectangles instead of circles because I wanted more of a square shape for my rugelach. Then I spread a thin layer of apricot jam before sprinkling on the nut mixture. Using a pizza cutter I cut the dough in half horizontally then into 7 vertical pairs. I then rolled them up log fashion and put them seam side down on the cookie sheets. I did refrigerate the dough disks overnight and then kept the prepared rugelach in the fridge at least an hour before baking. I think that this gave them almost the quality of a puff pastry. I thought this recipe to be quite a bit of work but after tasting the results I would use it again. I like my rugelach a bit on the moist side and this was just the best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIDOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1209025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-31T22:15:34Z",
                "reviewBody": "This was my first attempt at rugelach. Even though the recipe has a few steps I found them very easy. The dough was a cinch in the food processor. After making a few batches I learned to roll the crescents tighter. I used the original recipe and everyone loved them. The second time I used Nutella spread and mini chocolate chips. Those were the biggest hit with the kids. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1556773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-06T20:48:30.513Z",
                "reviewBody": "I have never had Rugelach before...actually I don't even know how to pronounce it but it's fantastic. I did change the recipe a little. I don't have a food processor so I used my kitchenaid mixer and a pastry cutter to make the dough. It took a little while but it worked. One thing I learned is that you really have to flour your surface and the rolling pin before you try to roll out the dough. It was hard for me to roll mine because the wedges stuck to the wax paper. I still have 3 more disks to roll out so I will know how to do it tonight. For my filling I used sugar-free apricot preservatives sprinkled it with some brown sugar then put about 1/4 of a cup of white sugar and 1/2 a tbsp of cinnamon. I added raisins to top it off. Baking them for 22 minutes was perfect. When I make the rest of mine tonight I think I will chop up the raisins so they fit better. Besides that I don't think I am going to change a thing. I wasn't sure how the dough would come out...it was light and flaky. My brother-in-law thought it was a french recipe because it was similar to a croissant. He was surprised I had made it from scratch. This recipe is awesome. It's a little time consuming but totally worth it in the end. Thanks for the recipe. I brought these for dessert at Christmas dinner and my father couldn't believe I had made these he was really shocked. He loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/624676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-21T17:23:13.977Z",
                "reviewBody": "My dough came out sticky not crumbly in the food processor. Double checked-ingredients correct. I want to make a few more batches. What did I do incorrectly?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Rightnour",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8420491/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Rugelach",
            "description": "See how to make traditional rugelach with walnuts and raisins.",
            "uploadDate": "2013-04-18T23:22:03.181Z",
            "duration": "PT4M29.561S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff6fdb0d0-d78e-468a-9f15-23d5fff0fb83%2F48aa665f-81ad-4ef5-a4aa-992d1d4e03ac%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2310774869001"
        }
    }
]