[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/670/main-dish/pork/ham/",
                    "name": "Ham",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11894/ham-tetrazzini/",
        "name": "Ham Tetrazzini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F817225.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-06-27T03:00:55.000Z",
        "description": "A quick casserole that only takes about 30 minutes to make: perfect for those busy 'game' days.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "6 ounces spaghetti",
            "3 quarts water",
            "1 teaspoon salt",
            "1 tablespoon butter",
            "2 tablespoons chopped onion",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "½ cup water",
            "½ cup shredded Cheddar cheese",
            "1 cup diced ham",
            "2 tablespoons chopped fresh parsley",
            "2 tablespoons chopped pimento peppers"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain (or use leftover pasta; see Cook's Note).\n"
            },
            {
                "@type": "HowToStep",
                "text": "While pasta is cooking, melt butter in a saucepan over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in cream of mushroom soup, 1/2 cup water, and shredded cheese. Heat mixture until cheese melts, stirring often.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the ham, cooked and drained pasta, chopped pimento, and chopped parsley to saucepan; stir to combine. Cook until mixture is heated through, then serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Ham"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan Holtgrewe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.319845857418112,
            "ratingCount": 519,
            "itemReviewed": "Ham Tetrazzini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "358.1 calories",
            "carbohydrateContent": "38.8 g",
            "cholesterolContent": "39.2 mg",
            "fatContent": "15.6 g",
            "fiberContent": "1.6 g",
            "proteinContent": "15.1 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "1585.2 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-05T23:49:52.05Z",
                "reviewBody": "This is a great [almost one pot] meal!  I had to do some substitutions based on what I had on hand, but it's a great base recipe!  I saw the recipe lacked any seasoning, so I sauteed two cloves of fresh minced garlic with the onion - and increased the onion to one small onion.  I didn't have pimiento, so I also sauteed diced green pepper with the onion until soft.  I used Chinese Mie noodles (Ramen), low-sodium Cream of Chicken soup (I think this is much better than Mushroom would be!), milk instead of water (much creamier!), sharp cheddar (a little extra) and added ground white pepper and celery salt.  I also let the mix simmer on the lowest heat for nearly an hour waiting on my husband, and as I tasted it every 15 minutes, it got better and better.  Leftovers will be great!  Everyone in the family loved it!  I served it with shredded cheese and a sprinkle of parsely on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JulieCC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/juliecc/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-10T00:56:50.327Z",
                "reviewBody": "This is an awesome recipe!!  I agree ~ it tastes as though you have worked for hours when in reality it is so super easy!  The first time I made it exactly as written and received rave reviews from my family.  The next time, I played with the recipe just a bit: I didn't have any fresh parsley, so I added in about 1/2 cup frozen broccoli florets (thawed) with the ham and also tossed in a few sliced mushrooms (from a jar); I was a little low on cheddar cheese, too, so I added some Parmesan.  It still turned out wonderful.  I love recipes that give you some freedom to be flexible (and still taste great!)  This one is definitely a family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSLIZA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1151082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T20:26:00.653Z",
                "reviewBody": "I was surprised at how good this tasted with my revisions--skip onions; use low fat marg.; use low fat mushroom soup; reduce water to 1/4 c.; add 1/4 c. dry white wine; add 1/4 c. parmesan.  Very flavorful my way.  I didn't use the parsley or pimento because I didn't have it.  You do need those two ingredients for color purposes only.  I'll definitely make this again.  Even my husband enjoyed it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T20:23:11.39Z",
                "reviewBody": "This was exactly what I was looking for to use up the Easter ham leftovers.  I doubled the recipe to make 8 servings, and I used 98% fat free cream of mushroom soup to cut the calories.  It had a great creamy cheesy mild taste, and the combination of ham, cheese and cream of mushroom made it plenty salty without having to add salt.  I added just a little black pepper and garlic, and it was perfect.  This was also a very quick dish to prepare on a school night.  Thanks!  5*****Stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meredith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T20:23:45.873Z",
                "reviewBody": "GREAT RECIPE - This is also good because you can do it all in one pot other than cooking the noodles. I doubled this recipe. I changed/added a few things. I added minced garlic and black pepper which were not listed for extra flavor chicken broth instead of water (this does not need salt due to the salt in the condensed soup). I used ham steaks (chopped)and sauteed all vegetables ham and seasoning together before adding the soup chicken broth and cheese - add extra cheese. The family really enjoyed this one (sauteed mushrooms would be great in this but my son would not eat it if I had added them). Since we are ham lovers we will make again and again. Thanks Susan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PammyJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T19:34:36.323Z",
                "reviewBody": "I thought this was pretty good. I gave it 5 stars because of how easy it was and its a good one for putting your own twists on. Great for a busy weeknight. I did change some things based on what others said and it was actually great with the changes. I douubled the recipee and used 4 cloves of fresh garlic and 8 ounces fresh mushrooms which I sauted with the onions. I used a full 2 cups of shereded mozerella and provelone cheese. (It was what I had on hand) I omited the pimento and instead added a 16oz bag of chopped mixed veggies. Instead of water I used chicken broth and added just a tad more than the recipee called for. I also used the whole 16oz box of spaghetti. I used ham but i bet chicken or turkey would be good too. Thanks for such a great recipee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KFELSMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/599308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T20:25:09.263Z",
                "reviewBody": "A good easy and fast meal. Per other reviewers I too used 1/4c water & 1/4c white wine but I think chicken broth could also be subbed instead or you could use a splash of white wine while sauting the onions. Also I added some fresh/sliced mushrooms (in the saute') and added parmesan to taste. Good and would make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-28T04:03:12.893Z",
                "reviewBody": "Wow! What a great recipe. I was skeptical at first with canned soup being the main base for the sauce but it did not taste like that at all! I did tweak the recipe a bit. 2 TBSP butter and 1 TBSP EVOO to saute onions in, adding 1 clove minced garlic at the end of saute time, cooking just until fragrant. Increased the water to 3/4 and added 1/2 cup of sour cream to the base. I wanted to increase the sauce so I could increase the pasta. 6 ounces just didn't seem like enough for a family of 4. I used at least 8 if not 10 ounces of linguini. I used 1 1/2 cup of left over smoked ham (yum!) and omitted the parsley and pimentos. Instead, I added about 2 cups of small, crisp steamed broccoli florets at the end. I also seasoned with some cracked black pepper. My family raved about this. I like to try new things fairly often. Some get the go ahead to try again, some go in the trash can. This recipe went right into my recipe book as a family favorite. Thanks a bunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8476978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T20:23:30.14Z",
                "reviewBody": "This was very easy.  Great for kids but bland for adults.  I added extra cheese and left out the pimento.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri Keas Monical",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/798237/"
                }
            }
        ]
    }
]