[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13302/main-dish/seafood/crab/",
                    "name": "Crab",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19515/stuffed-fish-in-puff-pastry/",
        "name": "Stuffed Fish in Puff Pastry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F294026.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-06-27T13:00:46.000Z",
        "description": "This recipe involves placing a seafood stuffing between fish fillets and encasing the package between sheets of puff pastry. This recipe is definitely a company dish although I occasionally make it just for the family. I like to present the whole fish to guests before cutting into serving pieces, you will have earned the compliments.   You could also substitute your favorite deviled crab or crab cake recipe for the filling offered here.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "¼ cup butter",
            "1 cup finely chopped onion",
            "1 cup minced celery",
            "1 tablespoon chopped fresh parsley",
            "8 ounces crabmeat",
            "8 ounces shrimp, peeled, deveined and minced",
            "¼ cup dry vermouth",
            "salt to taste",
            "ground black pepper to taste",
            "¼ teaspoon hot pepper sauce",
            "½ cup bread crumbs",
            "1 (17.5 ounce) package frozen puff pastry sheets, thawed",
            "2 pounds flounder fillets",
            "2 egg yolks, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the stuffing: Melt butter or margarine in a large saucepan over a medium-low heat. Saute onion, celery, and parsley until all of the vegetables are just tender. Mix in crabmeat, shrimp, and vermouth. Season with salt, pepper and hot pepper sauce; cook until shrimp is finished cooking (it will be pink). Mix in bread crumbs, a little at a time. When the mixture holds together well, stop adding bread crumbs. Taste and add more seasoning (salt, pepper, and hot pepper sauce) if necessary. Set this mixture aside to let it cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spray a baking sheet with non-stick cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll 1 sheet of puff pastry onto a flat surface. The puff pastry, once rolled should be about 1/3 to 1/4 inch thick and large enough for you to lay the fish on top of it and still have puff pastry on the sides. Lay one of the fish fillets on top of the puff pastry. Spread the stuffing mixture evenly over the fish fillet. Place the remaining fillet over the stuffing. Trim the pastry around the filets in roughly the shape of a fish. Save the trimmings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll second sheet of puff pastry out to about 1/3 to 1/4 inch thick.  Drape second sheet over stuffed fillets, making sure that there is enough of the top sheet to tuck under the bottom sheet of puff pastry.  Trim the top sheet of pastry about 1/2 inch larger than the bottom sheet.  Brush underside of top pastry sheet with water and tuck under bottom sheet of puff pastry pressing lightly to totally encase the fish and stuffing package. Place the sealed packet on the prepared baking sheet, and let it cool for 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While packet is chilling, roll out pastry scraps.  From the scraps cut out fins, an eye and 'lips'.  Attach cut-outs to chilled package with a little water.  Use an inverted teaspoon to make indentations in puff pastry to resemble fish scales but do not puncture pastry.  Chill entire package.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the package is chilling, preheat the oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the fish from the refrigerator and brush the package with the egg yolks. Measure the thickness of the package at its thickest part. Bake for 15 minutes, then reduce the temperature to 350 degrees F (175 degrees C) and bake the fish for 10 extra minutes per inch of measured thickness. Test for doneness by inserting a thermometer into the package, when the temperature reaches 140 degrees F (70 degrees C) the fish is finished cooking.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Crab"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Merwin L. Chambers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.344827586206897,
            "ratingCount": 29,
            "itemReviewed": "Stuffed Fish in Puff Pastry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "613 calories",
            "carbohydrateContent": "36.5 g",
            "cholesterolContent": "188.7 mg",
            "fatContent": "32.8 g",
            "fiberContent": "1.7 g",
            "proteinContent": "39.4 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "490 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-10T04:11:58.733Z",
                "reviewBody": "This one was soooo hard to rate. I'm giving if a five for creativity but everything else only gets a three from me. The stuffing was bland until I doctored it up and the fish really needed some personality. I dredged them in a combo of parm cheese and seasonings before laying them on the puff pastry. To the stuffing I added dijon mustard worst. sauce a bit of mayo lots of seasonings and just a small handful of fresh breadcrumbs. When I say creativity this is it. If you want to impress someone go for it because you certainly will. Don't be intimidated by making your pastry into a fish. It was so much fun and it looked absolutely ADORABLE! My family cracked up when I brought it to the table. End result was so darn delicious and I do thank you L. Chambers for your submission. Without it we wouldn't have had so much fun cutting up a fishy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:33:11.09Z",
                "reviewBody": "Not only did this recipe taste wonderful it made a great presentation. I made it early in the day and just popped it in the oven at dinner time. It is definatly a \"keeper\"!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHLANE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/593410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-13T04:43:22.843Z",
                "reviewBody": "This was absolutely the BEST!!! Outstanding is all I can say about this delightful, flakey, fantastic flavoured dish! Only thing I added was some fresh lemon juice and parmesan cheese.  There was no sogginess whatsoever, the pastry was exceptional! and the fish(I used sole) was perfect!!  My husband despises fish, so I took the broccoli, cheese and rice filling from another recipe off the sole recipe from this site and even he said after the first bite that it was good! Unfortunately, then he tasted the sole a few bites later and stopped eating!! Oh well...more leftovers for me!!! Thanks for a terrific post! Will defintely make again and even use the filling in a stuffed chicken breast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paivi Minnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:33:26.14Z",
                "reviewBody": "A very good and pretty dinner although it takes some time in the preperation department but it is well worth it in the end. For company it will make them think that spent all day in the kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/166263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-18T14:13:08.67Z",
                "reviewBody": "Excellent dish. I didn't have crab for the stuffing so I used canned shrimp instead added 2T of green onion added 2T of butter and 1/4C. parmasean cheese to the stuffing. It was delicious and my husband and 3y/o ate every bite! I will make this again and again. YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRICIA 98",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107765/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:33:33.263Z",
                "reviewBody": "Excellent dish!!! My husband and I loved it!! We didn't have any celery so we left it out. My 8yr old loved it!!!!!! Delicous. Will definitely make again and again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sirenadabat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-02T12:49:33.84Z",
                "reviewBody": "This dish was absolute excellence! Never have I been so impressed. The only thing I did different was I seasoned the fish with Emeril's Fish Rub and used haddock because my fish guy was out of flounder. I used canned crab meat and made sure I chopped the onions shrimp and celery very fine (more minced than chopped). I may cut back on the hot sauce next time but that is a matter of taste. My 6 year old had so much fun using the spoon to make scales and adding the decorative touches. This recipe deserves to be featured in the next All Recipes Cookbook!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACYCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T22:29:11.183Z",
                "reviewBody": "I made this recipe with cobia instead of flounder and added lemon juice and Old Bay seasoning to the stuffing and the fish. I also left out the bradcrumbs and used less hot sauce so it would stick together- I tasted the mix before adding the breadcrumbs and couldn't bring myself to put them in! I guess I changed a lot about it but it was still fantastic and I give (most of) the credit to L. Chambers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chrisurfs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2506885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-16T19:45:01.337Z",
                "reviewBody": "This was so much fun to make! I wish I could send all the photos we took... my husband made the pastry into a fish... beautiful. The flavor was very mild. It just needed lemon pepper lemon juice lemon zest and Parmesan cheese added to the stuffing...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2533158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T13:32:11.297Z",
                "reviewBody": "Just okay. Fillets needed seasoning and the stuffing overpowered the delicate fish. Lovely presentation however.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JANNA RODRIGUEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606817/"
                }
            }
        ]
    }
]