[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
                    "name": "Gumbo Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12717/merwins-shrimp-gumbo/",
        "name": "Merwin's Shrimp Gumbo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521423.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-07-01T01:29:34.000Z",
        "description": "This is a recipe for a classic, dark brown, shrimp gumbo in true Louisiana Cajun country fashion.  Serve over rice.  Browning the chicken pieces in the oil used for the roux adds flavor to the dish.  I use the cooked chicken for chicken salad.  File is added off the heat to thicken the gumbo. If added while the gumbo is still cooking, it may become stringy and unpleasant.  File is ground sassafras leaves.  It is available in many supermarkets.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H15M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound smoked sausage, cut into 1/4 inch rounds",
            "½ cup vegetable oil",
            "1 (4 pound) chicken, cut into parts",
            "⅔ cup all-purpose flour",
            "2 cups chopped onion",
            "½ cup chopped green onions",
            "⅔ cup green bell pepper, finely chopped",
            "2 tablespoons chopped fresh parsley",
            "1 tablespoon minced garlic",
            "2 pounds medium shrimp - peeled and deveined",
            "8 cups water",
            "salt to taste",
            "ground black pepper to taste",
            "⅛ teaspoon cayenne pepper",
            "1 teaspoon dried thyme",
            "2 bay leaves",
            "file powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium skillet, brown the sausage over medium heat.  Remove from pan, and drain on paper towels to remove some of the fat.  Discard fat in pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat vegetable oil over high heat.  Brown chicken pieces in hot oil.  Turn frequently until golden brown on all sides.  Transfer chicken to a dish, leaving oil in pan.  Set chicken aside, but keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make a roux by whisking flour into the hot vegetable oil.  Turn heat down to low.  Continue cooking flour and oil mixture, stirring constantly, until it reaches a dark brown color. This may take 30 to 45 minutes;  the darker the roux, the better the final gumbo.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the roux is a dark brown color, quickly add the sausage, onion, green onion tops, green pepper, parsley, and garlic.  Cook over low heat until the vegetables are wilted, about 10 minutes, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in 2 cups water and spices.  Add chicken parts.  Add rest of the water slowly.  Bring mixture to a boil, and reduce heat.  Simmer for about 45 minutes, until chicken is done and tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken pieces, and save for another use.  Add shrimp to gumbo; cook for about 8 to 10 minutes more.  Remove bay leaves.  Taste, and adjust seasoning.  Serve gumbo in deep bowls.  Sprinkle file powder over individual servings, and stir in.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Gumbo Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Merwin Chambers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.547445255474453,
            "ratingCount": 137,
            "itemReviewed": "Merwin's Shrimp Gumbo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "836.9 calories",
            "carbohydrateContent": "19.1 g",
            "cholesterolContent": "327.7 mg",
            "fatContent": "52.2 g",
            "fiberContent": "1.6 g",
            "proteinContent": "69 g",
            "saturatedFatContent": "13.4 g",
            "servingSize": null,
            "sodiumContent": "822.6 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-17T15:18:59.187Z",
                "reviewBody": "This was terrific!  My friend from Louisianna helped me make this, and told me instead of constantly stirring the roux, to let it sit for a minute or two, then stir, let sit, etc.  I don't think my roux would have EVER turned brown if she hadn't told me this!  I put more green pepper in than this called for, a can of tomatoes, used 1/2 olive oil and half veg oil, other than that, stuck to the recipe for an excellent product.  One other note:  My friend told me her mom makes a lot of roux at a time, and freezes it in baggies so that next time, she doesn't have to stand at the stove for so long.  Thanks Merwin!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KimsKitchen3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2493904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-08T15:40:54.217Z",
                "reviewBody": "I am from and still live in southern Louisiana.  I think some people don't realize that good southern cooking takes time.  People here love to cook.  Alot of us base our weekends on food..inviting friends and family over to share good times being outside on a nice day driking and talking while we cook one stew, gumbo, jambalaya, sauce picante, etc. all day long.  Its nice to sit around and smell the good smells while enjoying the day. Good food takes time and is always well worth it in the end.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INTHEKITCHEN2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1278766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-01T17:30:00.517Z",
                "reviewBody": "I grew up eating my mom's gumbo, so as I read many recipes and reviews, I also had some ideas such as gumbo must have okra and tomatoes!  I think this is the best recipe I've found.  I did speed it up by doing a few of the steps simultaneously in two pots, so my total cooking time was about 2 hours.  \n\n1. First I browned the chicken in light olive oil (holds up to heat better than regular) in a heavy skillet.  I put the chicken aside to be added back and cooked in the gumbo during the last 40 minutes. (Chicken included is how I know gumbo.)\n\n2. Then I cooked the roux in the heavy skillet simultaneously with browning the sausage (I used Polish, sliced in circles) in a large soup pot.  For the roux, I added to the oil that had browned the chicken more olive oil and 1/4 cup of butter to make a total of about a cup of oil/butter, and gradually added about a cup and a half of flour, stirring constantly so that the roux was smooth.  I like to use a metal spatula (aka turner) so that I can quickly scrape the bottom of the skillet and not let the roux burn.\n\n3. While the sausage browned in one pot, and the roux browned in the other (stirring every couple of minutes), I finely chopped the Cajon \"trinity\" of onion, bell pepper, and celery. I added the vegies to the sausage pot, along with cajon seasoning (salt, pepper, etc.), garlic, and a little olive oil.   \n\n4. When the vegies were wilted and the roux was \"darker than peanut butter,\" I added the roux to the sausage and vegies, along",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ruthie Houston Barrett Blank",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2962944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-28T15:04:02.563Z",
                "reviewBody": "Fabulous! I made this recipe almost exactly as it was posted with a few minor changes. I browned four chicken thighs skin and all I did not save the meat rather after I was finished cooking with it I skinned and de-boned the thighs and set the meat aside with the shrimp. I also sauteed the smoked sausage then set it aside with the shrimp & chicken (this keeps the flavor from being boiled out of the sausage). I added all of the meat together at the end for the final few minutes. As far as this recipe being bland all good cooks know that you have to taste as you cook and add more seasoning to meet your family's taste (expecially salt & pepper). I love things a little warmer but I know that my family will only tolerate 1/8 teaspoon of cayenne in a dish like this so that is what I use. If you want this dish spicier... add more! This is a great gumbo recipe! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRIVY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/861404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T00:08:24.043Z",
                "reviewBody": "With my dad being a Louisiana native you'd think he'd have taught all us kids how to make a good gumbo but no. Thank you Merwin for stepping in and giving us a great no-fail recipe! The best part is where you make the roux and the recipe actually says that it takes time lots of time to stir and stir and allow the roux to darken and develop that characteristic richness. Absolutely wonderful! I used jalapeno spicy Texas sausage that I bought at Costco plus some shrimp my dad gets from Louisiana. Before serving i skimmed the oil/fat from the liquid by using one of those gravy cups. The recipe is excellent when you use quality ingredients. Most of all I appreciate the technique in preparing the all-important roux. Thank you again for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OYSTERGIRL1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-30T03:57:12.857Z",
                "reviewBody": "Delicious dish...we enjoyed it. I couldn't get file powder so I ended up adding 2T of cornstarch to thicken just before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DRSRICHARDSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1230259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-10T17:45:41.82Z",
                "reviewBody": "I am giving this some-what low rating due to the complexity of the recipe. I am not a Creole/Cajun chef at all and I will take most of the responsibility for the low rating. But I feel disappointed in the final product this recipe served up. For something that takes 3hrs too cook I expected much more. Maybe that s the problem I expected something better. For recipe simplicity I give it 1 star ( ) And for final taste I give it a 2 star ratting ( ) The taste was very plain. I added some chicken broth to bring out the flavors and this helped a lot. Unfortunately I would not want to go through the hassle or the expense of making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BUTCHER_BOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T12:06:47.97Z",
                "reviewBody": "Being that I am from Louisiana and spent most of my life there I tend to really miss the more traditional dishes. This was the first time I had ever actually made gumbo myself because I always just bought it. I couldn't believe that I was actually smelling and tasting gumbo as I know it! I followed the recipe except that I didn't have sausage or chicken. I added calamari with the shrimp. My husband liked the calamari better than the shrimp. I didn't have any file' (impossible to find here) or cornstarch at the end but I did cut the water to 6 cups. I even reheated it the next night and it was still great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1733157/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T02:20:31.17Z",
                "reviewBody": "Great recipe that is really easy for gumbo. My pot would only hold 6 c. of water. I recommend cutting the oil to 1/2 c. I added gumbo file to the entire pot at the end and a little more thyme for added flavor. Everyone loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LATASHAG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/193311/"
                }
            }
        ]
    }
]