[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17092/chicken-lo-mein/",
        "name": "Chicken Lo Mein",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72787.jpg",
            "width": 2048,
            "height": 1535
        },
        "datePublished": "1999-07-05T16:27:02.000Z",
        "description": "This dish is easy to make, and full of flavor. The chicken is incredibly tender, and the ginger, garlic and soy sauce combine to give it its authentic taste. Garnish with chopped fresh cilantro.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves - cut into thin strips",
            "5 teaspoons white sugar, divided",
            "3 tablespoons rice wine vinegar",
            "½ cup soy sauce, divided",
            "1 ¼ cups chicken broth",
            "1 cup water",
            "1 tablespoon sesame oil",
            "½ teaspoon ground black pepper",
            "2 tablespoons cornstarch",
            "1 (12 ounce) package uncooked linguine pasta",
            "2 tablespoons vegetable oil, divided",
            "2 tablespoons minced fresh ginger root",
            "1 tablespoon minced garlic",
            "½ pound fresh shiitake mushrooms, stemmed and sliced",
            "6 green onions, sliced diagonally into 1/2 inch pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium, non-reactive bowl, combine the chicken with 2 1/2 teaspoons of white sugar, 1 1/2 tablespoons vinegar and 1/4 cup soy sauce. Mix this together and coat the chicken well. Cover and let marinate in the refrigerator for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another medium bowl, combine the chicken broth, water, sesame oil and ground black pepper with the remaining sugar, vinegar and soy sauce. In a separate small bowl, dissolve the cornstarch with some of this mixture and slowly add to the bulk of the mixture, stirring well. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the linguine according to package directions, drain and set aside. Heat 1 tablespoon of the vegetable oil in a wok or large saucepan over high heat until it starts to smoke. Add the chicken and stir-fry for 4 to 5 minutes, or until browned. Transfer this and all juices to a warm plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining vegetable oil in the wok or pan over high heat. Add the ginger, garlic, mushrooms and green onions, and stir-fry for 30 seconds. Add the reserved sauce mixture and then the chicken. Simmer until the sauce begins to thicken, about 2 minutes. Add the reserved noodles and toss gently, coating everything well with the sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Meesh"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.145021645021645,
            "ratingCount": 462,
            "itemReviewed": "Chicken Lo Mein",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "598.6 calories",
            "carbohydrateContent": "78.6 g",
            "cholesterolContent": "60.8 mg",
            "fatContent": "14.7 g",
            "fiberContent": "4.5 g",
            "proteinContent": "38 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "1877 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-20T01:33:41.31Z",
                "reviewBody": "FOR JECCA:  The missing ingredient is oyster sauce...took me awhile to figure it out, but after trial and error, I used abt 2 -3 tbs. and it did the trick.  Made great restaurant lo mein, with a thick brown sauce just like you get in Chinese take out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "danica1976",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2741355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-23T06:32:50.153Z",
                "reviewBody": "This is an incredibly customizable recipe with a nice, solid flavor whatever you add. I can't honestly give it four stars because I changed it so much, but the sauce flavor was fantastic, reminiscent of the lo mein at one of my favorite local Asian restaurants (I don't know what the other reviewers are on about. Maybe they're all eating at bad restaurants!). Some lo meins that I've had at restaurants have a bland, onion-y flavor I really don't like, but this one was much more to my tastes. I didn't add mushrooms, because I hate them, and instead chose to add some chopped broccoli, carrots, snow peas and water chestnuts and also used pre-packaged stir fry noodles instead of linguini (that seemed an odd pasta choice to me.) I used half the sugar, no water, and halved the chicken broth and corn starch because I had a feeling it would be too saucy. The amount of ginger in the original recipe was actually good and did not have to be altered. What I ended up with was just about perfect. Some odd ingredients listed (don't use linguini!), but overall an excellent flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ENDOFALICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1048247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-28T02:34:18.17Z",
                "reviewBody": "Great recipe says my wife, who usually doesn't favor Oriental noodles dishes. A couple comments about balancing flavors.  All quantities in the recipe will be right if you use four 3-ounce packages of ramen noodles (any flavor okay because you will NOT use the flavoring packs, just the basic noodle blocks which only take three minutes to boiland separate).  Chicken quantity should be 1-1/2 pounds.  Suggest adding 1/2 small green pepper and 1/2 small red pepper in 3/4-inch dices along with other veggies to give flavor and slight crunchy texture to an otherwise soft dish.  Use fresh ginger, never dried.  Too bland?  Add a teaspoon (or to taste) of Chinese or Thai hot red chili sauce when cooking veggies.  Put chili sauce on the table for the more adventuruous.  Stick with the liquid quantities listed in the recipe.  Drain the cooked ramen noodles in a colander and then add to the wok; the sauce will be fully absorbed in the noodle mixture as it should be.  Don't worry about making too much, leftovers will microwave great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Uncle Ed's Nephew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1898838/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-27T18:33:25.357Z",
                "reviewBody": "Rather poor actually. 1/2 cup of soy sauce??? If you are using some thin supermarket brand I would halve the amount. If you have a real soy sauce purchased in an asian market use only a couple of tablespoons. \r\nThere is also way too much liquid in this recipe. Lose the extra cup of water and decrease the broth by a quarter of a cup. \r\nThis recipe also bears little resemblance to the lo mein you might get in a restaurant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ABIGFRICKINRAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1264658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T16:02:16.923Z",
                "reviewBody": "A 5 star recipe if you follow the recommendations of your fellow homecooks. I used spagetti instead of linguine and added a bag of stir fry veggies. It won't be \"soupy\" if you add a bit more cornstarch and give it more time to thicken up (2 minutes is not going to cut it). My husband says is his favorite of all the oriental dishes I have prepared... I made it yesterday and he is still talking about it. I added some shrimp with the veggies and some red crushed pepper to make it spicy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-17T05:57:14.17Z",
                "reviewBody": "I enjoyed this recipe but I did change it around a bit. I didn't use the water at all. I thought 1 cup of water and 1-1/4 cups of broth would have made this way to soupy. I stir-fried the chicken until most of the liquid was absorbed..this left it a golden brown color. I'm not a big fan of ginger so I left that out and chopped up some broccoli cauliflower and cabbage to use. I made the sauce (minus the water) and instead of using the full amount...I added a spoonful as I stir-fried my vegetables until I was pleased with the results. Instead of mixing this all together I left the noodles seperate and also made a pot of rice. We added the amount we wanted to either the rice or noodles. This is nothing like the lo mein we get at our local chinese place but this was still enjoyed nonetheless. Thanks Michelle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T17:52:07.72Z",
                "reviewBody": "I had a craving for Chinese restaurant-style Lo Mein and after reading the 12 or so different variations on here this one is as good as any (the process is mostly the same for all). I followed this recipe but with these changes: I marinated the chicken overnight used real Oriental Lo Mein noodles and since I don't like mushrooms; I substituted other veggies- sliced onion carrots green peppers water chestnuts spring sprouts and snow peas. (Hey) add what you like. Sure it was a combo of chicken & veggie Lo Mein but wow was it good. Used the base sauce here and as others suggested- skipped the cup of water and added a TBL of both Hoisin sauce & Oyster sauce (again- make it to your taste). All those Oriental flavors of sesame ginger garlic Hoisin & Oyster sauce the flavorful chicken & crisp veggies is like a party in your mouth. Don't be afraid to make a variation that suits you or your family's likes or dislikes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robbo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6588360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-12T14:37:07.06Z",
                "reviewBody": "Iloved the flavor of this recipe. What I did not like was the linguine noodles. I will use this recipe again but use chinese noodles instead. I did like the recipe quick fast and inexpensive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ALP399",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-06T01:00:26.56Z",
                "reviewBody": "I liked the idea of this recipe but to make it work for me i have to make some changes it just didnt taste good for me i will make again with some few adjustments im sure it will be great next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/964925/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Lo Mein",
            "description": "See how to make tender chicken with saucy noodles.",
            "uploadDate": "2013-04-16T20:32:45.274Z",
            "duration": "PT3M8.605S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F119975a7-9b93-4558-bf03-5a26ca35ce7d%2Fac50e5c0-517c-4c45-9292-229def50180c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2305757511001"
        }
    }
]