[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/726/world-cuisine/european/spanish/",
                    "name": "Spanish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12728/paella-i/",
        "name": "Paella I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2337092.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-07-07T04:58:52.000Z",
        "description": "A very traditional paella, garnished with chorizo, chicken, peas, squid, mussels, and shrimp. Chorizo is a sausage spiced with garlic and chili powder; remove casing before cooking. A paella pan is recommended.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 tablespoons olive oil",
            "1 onion, chopped",
            "2 cloves garlic, minced",
            "1 red bell pepper, chopped",
            "4 ounces Spanish chorizo (cured spiced pork sausage), casing discarded and sausage cut into 1/4-inch dice",
            "2 skinless, boneless chicken breast halves - cut into 1 inch cubes",
            "1 (12 ounce) package uncooked Arborio rice",
            "5 cups chicken broth",
            "½ cup white wine",
            "1 sprig fresh thyme",
            "1 pinch saffron",
            "salt to taste",
            "ground black pepper to taste",
            "2 squid, cleaned and cut into 1 inch pieces",
            "2 tomatoes, seeded and chopped",
            "½ cup frozen green peas",
            "12 large shrimp, peeled and deveined",
            "1 pound mussels, cleaned and debearded",
            "¼ cup chopped Italian flat leaf parsley",
            "8 slices  lemon, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in paella pan over medium heat. Add onion, garlic and pepper; cook and stir for a few minutes.  Add chorizo sausage, diced chicken, and rice; cook for 2 to 3 minutes. Stir in 3 1/2 cups stock, wine, thyme leaves, and saffron. Season with salt and pepper. Bring to the boil, and simmer for 15 minutes; stir occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Taste the rice, and check to see if it is cooked.  If the rice is uncooked, stir in 1/2 cup more stock. Continue cooking, stirring occasionally. Stir in additional stock if necessary: use up to 2 cups additional stock, 5 cups total. Cook until rice is done.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in squid, tomatoes, and peas. Cook for 2 minutes. Arrange prawns and mussels on top. Cover with foil, and leave for 3 to 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the foil, and scatter parsley over the food. Serve in paella pan, garnished with lemon wedges.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Spanish"
        ],
        "recipeCuisine": [
            "European",
            "Spanish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Christine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.463541666666667,
            "ratingCount": 192,
            "itemReviewed": "Paella I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "524.1 calories",
            "carbohydrateContent": "56.6 g",
            "cholesterolContent": "106 mg",
            "fatContent": "18.2 g",
            "fiberContent": "3.3 g",
            "proteinContent": "28.8 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "1162.2 mg",
            "sugarContent": "4.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-09T19:19:12.867Z",
                "reviewBody": "I wouldn't ever use arborio rice for this recipe again, it's too creamy and once it's done the consistency isn't right - paella isn't supposed to be like a risotto.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MIAX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/722565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T21:03:45.89Z",
                "reviewBody": "quite authentic and good. italian boyfriend who has eaten paella many times said it tastes like those he had in spain.  portions of ingredients are perfect. used safforn threads instead. read another recipe on the net from someone in spain, added tomato paste, thyme and 2 bay leaves. very good flavor but my mussels and shrimps didn't cook coz they were stright out from the fridge. next time might add mussels and shrimps together with the peas n tomatoes to make sure they cook. Important: shellfish MUST be FRESH! don't add too much water, else the rice will be mushy and use aborio rice. they have a firmer bite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BABYFLOUR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/670201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-30T21:39:28.09Z",
                "reviewBody": "If you love seafood and shellfish this dish is perfect for you. It's a bit of work to gather all of the ingredients however once you have them all ready they come together like a dream. I first had this dish when I was in Spain -- this recipe tastes just like the original.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Esmee Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/esmee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-13T22:47:15.057Z",
                "reviewBody": "Please don't waste your money on a fancy \"paella pan\" unless you already have one...or your getting one as a gift but just to let you know...I've made a fabulous Paella in a Wok.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "juliana07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2398697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-03T10:07:55.967Z",
                "reviewBody": "This was my first try at paella. My husband loves paella and said it was better than the ones he has had in finer restaurants.  I substituted tumeric for the saffron, and used dried thyme. I too substituded clams for the squid.  And put the shell fish in a little sooner than the recipe called for.  It was easy to make, and did not take that long to prepare, the only thing that took any time was the chopping of ingredients.  I highly recomend this recipe to anyone wanting a good paella.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAINESEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/708805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T17:11:58.017Z",
                "reviewBody": "I admit I did make some minor changes to the recipe. However my rating for the recipe is based on the fact if you follow the directions you end up with a risotto consistency and NOT paella. The recipes calls for too much liquid. Despite knowing the recipe called for too much liquid I went ahead and followed the directions and was greatly disappointed. For \"rice\" it's best to use 1 part rice and 1.5 parts liquid. When using arborio rice if you use more liquid you get risotto. 12 oz. of rice is 1.75 cups of rice - so the maximum amount of liquid you should use is a generous 2.5 cups. I omitted the white wine for religious reasons - but used 3 1/2 cups of liquid and ended up with risotto. Despite my best attempts to boil the extra liquid off it didn't work. With all that said I would highly recommend cutting back on the liquid by at least 1 cup - and adding more if needed as you stir occasionally. I also used soy chorizo (aka soyrizo) instead of pork chorizo. I recommend using 1/4 tsp saffron and 1/4 tsp of smoked paprika (or Spanish paprika). This will increase the flavor greatly and is more traditional. I would start with 1 tsp of salt and add more if needed (depends on how salty your broth is) use 1/4 tsp of black pepper. I used 1 cup of peas and I tripled the amount of shrimp. Overall it was tasty but disappointing. Next time I'll make it with less liquid and will most likely be pleased.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-20T16:33:43.233Z",
                "reviewBody": "This was excellent! My mother was Cuban so I know good paella when I taste it! It was very similar to what she made. I made it for Father's Day and got rave reviews. Which is good because they all know their spanish food! I eliminated the squid and used scallops instead of mussells. This worked great. Also needs more wine (to taste of course) and I added a little hot sauce muy bueno! Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENWOP7573",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1343951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:21:46.633Z",
                "reviewBody": "Truly a remarkable memorable dish. I've made this several times already (once for a dinner party - to elated gobbled-up glee) and sometimes for some extras that I freeze for another night. The only successful \"changes\" that I've made having prepared it a few times now is to brown the chorizo and drain b4 adding the onion peppers and garlic have the chicken pre-cooked and cubed and to toss everything in a large skillet (less the seafood and peas until prior to serving) and use Vigo brand saffron-flavored rice. Covered it's typically ready in 40 min. and I haven't found the need for more than 3 c. chicken stock 1/2 c. wine. I've even used canned diced Rotel tomatos w/ no complaints. Oh and I'm happier w/o the mussels so we skip on those. Absolutely amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-23T17:40:44.753Z",
                "reviewBody": "Quite an impressive dish! Very pleasing to the eye. Instructions were easy to follow preparation took a little time especially gathering all the ingredients. This dish to begin with was a challenge for me but well worth it!! The Saffron threads is the key ingredient and it is a must for this dish. There is no substitute for Saffron. I soak a pinch in warm water first. This dish is full of color texture and flavor. The arrays of shellfish meats and sausage are what what makes this dish pop as well. This is worth the work involved thou it is a costly dish to prepare (saffron seafood stock meats). I did add a bay leaf and a pinch of red pepper flakes. The only slight change I made was to use long grain white rice instead of arborio and that is after reading what others stated about the rice being too mushy and too much liquid. So I watched carefully when pouring in the liquids and made sure nothing got overcooked. I added the shrimp and pressed it into the rice. Shrimp does take about 8 minutes or so to cook all the way through. Instead of mussels I chose clams which were the last ingredient I put in and I placed them on top of the rice in a circle. I covered it with a lid and let the steam and heat cook the clams and open up. Before serving I sprinkled a generous amount of fresh chopped flat leaf italian parsley. I would certainly make this dish again but probably for a special occassion or family gathering. A truly authentic and wonderful dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            }
        ]
    }
]