[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17278/desserts/fruit-desserts/fig-desserts/",
                    "name": "Fig Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8290/fresh-fig-cake/",
        "name": "Fresh Fig Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6837351.jpg",
            "width": 2080,
            "height": 4160
        },
        "datePublished": "1999-07-08T17:24:32.000Z",
        "description": "This recipe makes a moist cake filled with a mixture of fresh figs, brown sugar, and lemon juice.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 8-inch layer cake",
        "recipeIngredient": [
            "¼ cup butter, softened",
            "1 cup white sugar",
            "1 egg",
            "2 cups all-purpose flour",
            "½ teaspoon salt",
            "2 teaspoons baking powder",
            "1 cup fat-free evaporated milk",
            "1 teaspoon vanilla extract",
            "¼ teaspoon almond extract",
            "1 cup chopped fresh figs",
            "2 cups chopped fresh figs",
            "¼ cup packed brown sugar",
            "¼ cup water",
            "1 tablespoon lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray two 8-inch round cake pans with vegetable oil spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, sift together flour, salt and baking powder. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, cream butter with the sugar until fluffy. Add egg and beat well. Add flour mixture alternately with the evaporated milk. Fold in vanilla and almond extracts and 1 cup chopped figs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide into two prepared 8-inch round cake pans. Bake in preheated oven until cake springs back when lightly touched with a fingertip and a toothpick inserted into the center comes out clean, 25 to 30 minutes. Cool cake layers on wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling: In a saucepan, combine 2 cups chopped figs, brown sugar, water and lemon juice. Bring to a boil. Reduce heat to a simmer and cook until thickened, about 20 minutes. Spread thinly between cooled cake layers and on top.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Fig Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karin  Christian"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.451327433628318,
            "ratingCount": 113,
            "itemReviewed": "Fresh Fig Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "370.2 calories",
            "carbohydrateContent": "71.7 g",
            "cholesterolContent": "39.8 mg",
            "fatContent": "6.9 g",
            "fiberContent": "2.6 g",
            "proteinContent": "7 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "357.1 mg",
            "sugarContent": "45.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-21T22:53:48.873Z",
                "reviewBody": "I made this cake 2 days ago for a bunch of fig fanatics. Everyone went wild over it. It is not overly sweet and a very pleasant ending to a meal.  I will definitley be making this again very soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1998887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T16:35:10.42Z",
                "reviewBody": "This recipe makes a moist, though somewhat dense, cake.  The batter is as easy to create as anything out of a box--in other words, very easy!  So that's good if you have lots of figs and not much time.\r\nWe ended up splitting the layers, toasting them in the toaster oven, and adding butter, to eat the cake like a slab of a scone.  Amazingly good with your morning coffee.\r\nNext time I will make a lighter batter, probably substituting oil for the butter, and I will puree the figs (and double the amount to 2 cups in the batter!) with a little of the evapourated milk before blending the figs with the batter.  That would change this recipe from something of a coffee cake or scone-like creation to more of an after dinner cake, which is more what I'm looking for.  Again, it's a good recipe, wonderfully sweet and satisfying!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSCLAIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/369607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-22T08:47:57.467Z",
                "reviewBody": "Near my home I came across a fig tree on what once was a market garden area. There were so many figs both fallen and on this tree I brought them home and then went on the net to see what we could do with them. This recipe was just so lovely we returned for more figs over several weeks. Even cut up and froze pieces for later. Such a moist and flavoursome cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TESSA07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404137/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-14T00:26:58.117Z",
                "reviewBody": "This cake turned out to be a pleasant surprise! I used 1 lb. of fresh figs which equaled 3 cups needed for this recipe. The figs are in season towards the end of summer and are around $5.99 a pound. The deepest darkest purple figs are the ripest and juiciest. I chopped the figs up, with skin on, and combined them into the batter as well as the filling mixture. I used buttermilk in place of evaporated. The change I made was to bake this in a bundt pan. I placed a thin layer of batter in the greased bundt pan, added the cooled filling, then topped that with the rest of the batter. I baked this at 325 degrees for 50 minutes.  I enjoyed the sweet smell of the figs baking up in the oven. The cake cooked thoroughly and I placed it aside for 35 minutes until it was luke warm/cool to the touch. The cake is a nice light golden color with brown edges. It is a moist, tender and flavorful cake with the right amount of everything! It is somewhat dense and I had a mouthful of sweet figs in every bite. The edges have a slight tender crisp to it and I can see the layer of fig filling in the cake when sliced. This tastes like Nabisco Fig Newton Bars, only BETTER and TASTIER - and in a cake! We ate more than half of the cake up while it was still luke warm. It is not often I come across a \"fig cake,\" and I am glad that I did because this turned out to be a real treat for all of us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-22T18:54:26.683Z",
                "reviewBody": "Although this cake did not come out quite right when I made it, it still tasted delicious.  I suspect most of my problem was taking the advice of other reviewers.  As I wanted more of a dessert cake than a coffee cake, I took the advice of the two reviewers who suggested increasing from 1 to 2 cups of chopped figs in the batter and pureeing those figs with the evaporated milk before adding to the batter.  Unfortunately, this made the batter so dense, the layers hardly rose.  Plus, I burned the outer edges and bottom while trying to get the middle to cook.  Every time I stuck a toothpick in the middle, it came out with crumbs so I kept baking until I realized I'd ruin the cake if I kept going.  I had to cut off the sides and bottoms to get rid of the burnt areas while the middle was still mildly soft.  I don't think pureeing the figs is such a bad idea, but I'd leave it at 1 cup in the batter, not 2.\n\nI still made the filling/topping, layered the cake with it, and just cut the cake into bars so as not to waste it.  Despite all my troubles, the bars were still delicious.  I'd definitely make this cake again, but will stick closer to the original recipe and ignore the reviewers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kendra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-07T17:28:29.56Z",
                "reviewBody": "An excellent way to use fresh figs.  No matter what time I make it, this cake is not around long enough to see the next sunrise.  I think the variable juiciness of fresh figs may give different results each time, so you have to be flexible when making it.  I leave out the water in the fig topping and use a little more lemon juice, sometimes some zest. Wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISARAI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35368/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-29T00:07:53.997Z",
                "reviewBody": "I made this yesterday & today it's here on \"Recipes of the Day!\" My neighbor just gave us a sack full of figs & I didn't know what to do with them! This cake is really good- I used a 13x9 pan. I didn't use the icing since I wasn't doing a layer cake- I used Caramel Frosting VI. (with no nuts) It was good too- although I would have liked a little more- next time I will use 1 1/2 times as much. My son REALLY loved it. Next time I also might puree the figs first & maybe use 2 cups. (I used a heaping cup of chopped.) Thanks for submitting- & thanks to my neighbor, Leroy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELLO 57",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/518008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:57:35.89Z",
                "reviewBody": "This was a wonderfully moist and fruity cake that we really enjoyed -- reminiscent of holiday fruitcake. I wouldn't change a thing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHMURROW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/423370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-30T00:12:38.547Z",
                "reviewBody": "Great cake for using fresh figs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eve's",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2004212/"
                }
            }
        ]
    }
]