[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
                    "name": "Cherry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8327/chocolate-cherry-chip-cake/",
        "name": "Chocolate Cherry Chip Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F185706.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-07-22T03:44:59.000Z",
        "description": "We always called it the \"Busy Cake\"...too many things going on with it! Crushed maraschino cherries can be found in the ice cream sundae department at the grocery store. If you can't find them, get regular maraschino cherries and chop.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "2 cups white sugar",
            "¾ cup unsweetened cocoa powder",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "2 eggs",
            "1 cup strong brewed coffee",
            "1 cup milk",
            "½ cup vegetable oil",
            "2 teaspoons vanilla extract",
            "1 (10 ounce) jar maraschino cherries, drained",
            "2 cups miniature semisweet chocolate chips",
            "½ cup butter, softened",
            "4 cups confectioners' sugar",
            "½ teaspoon salt",
            "2 tablespoons vanilla extract",
            "4 tablespoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat  oven  to  350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix flour, sugar, cocoa, baking powder, soda and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add eggs, coffee, milk, oil and vanilla. Beat until smooth (batter will be thin).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold in cherries and chocolate chips. Pour batter into 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 35 minutes or until toothpick inserted into middle comes out clean. It's best to leave it in the pan, because the chips and the cherries sort of sink to the bottom and solidify and will stick big time! Frost with white buttercream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the frosting: In a large bowl, combine butter, confectioners sugar, 1/2 teaspoon salt and vanilla. Cream with an electric mixer. Add milk by the tablespoon until frosting is smooth.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Cherry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Michelle C. Williams"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.617021276595745,
            "ratingCount": 47,
            "itemReviewed": "Chocolate Cherry Chip Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "360.1 calories",
            "carbohydrateContent": "59.4 g",
            "cholesterolContent": "26.7 mg",
            "fatContent": "13.9 g",
            "fiberContent": "2.1 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "263.4 mg",
            "sugarContent": "45 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-18T09:10:18.347Z",
                "reviewBody": "I made two small changes when making this cake--I cut the mini chocolate chips back to one cup and instead of using milk in the glaze I used the juice from the marachino cherries that I reserved for more of a cherry flavor. I did run my cherries through the food processor for a coarse chop then set them to drain on paper towels before I tossed them with the mini chocolate chips in a little of the flour used in this recipe. This really helped them to sink less in the cake. I did bake this in a glass 9x13 pan mine was done in just under 35 minutes. My whole family loved this cake even my husband who's not usually a fan of chocolate and cherries. I would have liked more marachino cherries in the cake. I will make this again but I would double the amount of chopped marachino cherries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T09:07:24.373Z",
                "reviewBody": "Woohoo I'm the first person to rate this fabulous recipe. It just has so much flavour too it. You could almost call it a cherry surprise because you'll be eating away and then every once and a while you'll bite into a cherry and get this rush of flavour. And the chocolate chips yummmmm. They drop to the bottom of the cake and give this fudgey bottom. This is also a very versatile recipe. I decided to use this recipe as the bottom layer of my wedding cake. I tripled the recipe to fill a 16-inch square cake pan and it came out just perfectly. It's actually kind of kewl to see a 16-inch square cake. It's just huge. It took a little longer to bake but it baked all the way through without burning. The only thing that I would recommend when baking this cake would be to line your pan with Parchment paper or Wax paper. That way it comes out of the pan easily and the cake stays nice and smooth for icing. Thank you for an amazing recipe. Sincerely Martin",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKER BOY 79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/448473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T15:30:56.953Z",
                "reviewBody": "The first thing I noticed about this recipe was that as the caption says there were too many things going on with it! For one thing I believe the reason why many reviewers complain about the chips and cherries sinking to the bottom is that there is too much liquid in this recipe. I made the following changes and it turned out moist fudgey rich and delicious...with cherries (halved maraschinos) and chips suspended evenly throughout and without sticking to the pan at all. Omitted coffee completely (not sure why it's even in the recipe) increased milk just slightly to 1.25 cups used 1/2 cup unsweetened applesauce instead of oil and used 1 cup (instead of 2...that's a TON!) of the mini chocolate chips. Used a bundt pan and baked for 55 minutes. Turned out wonderfully & made the birthday girl very happy! Made a chocolate ganache as a topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassie S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2358802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T17:36:52.17Z",
                "reviewBody": "If there were more stars this cake would receive a 10!!! It was wonderful! I made it for small family dinner and it got rave reviews. I scaled down the recipe to 12 servings and baked it in a 8x8 pan. Because of the smaller pan the cake was a little thicker so it needed about 15 more minutes to bake. After reading the reviews about the cherries falling to the bottom I waited to add the cherries and the chips until the cake had baked for about 5 minutes. This technique helped. The cherries and the chips were wonderfully distributed throughout the cake. The recipe for the frosting was a bit sweet but good. Next time I will reduce the amount of sugar in the frosting recipe. I added a few drops of red food coloring and had pink icing topped with three cherries in the middle. These additions made a really cute Febuary Pre-Valentine treat. Thank you for this great recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENEGIL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/411993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-21T22:49:26.753Z",
                "reviewBody": "I tried drying the cherries and putting flour on both them and the chocolate chips and they still fell to the bottom but it was still good. TIP #1: I added the cherry juice to the icing instead of milk and it tasted so good and was pink. TIP #2: I used flour/oil spray and nothing stuck to the bottom and I didn't line my pan. This stuff works great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/goldner/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-27T23:43:50.5Z",
                "reviewBody": "This is an excellent cake! I greased and lined a 9\" springform pan with baking paper and the cake popped right out no sticking at all. Some of the reviews said they were having trouble with the chips and cherries sinking - the way around that is to rinse the juice off the cherries then toss them in 2 tbsp of flour. It helps them stay suspended in the batter. Toss the chips in flour too (but don't rinse them!)I used 1 cup while and 1 cup whole wheat pastry flour and applesauce in place of the oil. Great cake my family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gabsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-01T21:13:01.607Z",
                "reviewBody": "I loved this cake I'm not a big chocolate lover but this one I loved! I want to make these into cupcakes for my daughter's birthday. Mine did stick very bad I didn't let it cool long enough before trying to turn it out and it made a mess. But what a delicious mess it was!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Lee Starnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826135/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T18:00:14.25Z",
                "reviewBody": "Cake itself is awesome. Cherries fell to the bottom even when I coated with flour as another reviewer suggested. Using parchment paper was a good solution for sticking that others reported. I would make again without the cherries. Chocolate cream cheese icing is a great addition for us chocoholics.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SDStace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2929118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-22T03:59:10.2Z",
                "reviewBody": "this cake is really good...of all the cake recipes I have tried on this site this one is the best. its very moist rich but not too rich and its not too difficult. as the first reviewer suggested using wax paper to line the pan helped with the sticking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSYBEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1160764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T18:41:18.01Z",
                "reviewBody": "This cake was not that good even my kids who love chocolate cake didn't want it after one bite. It didn't fall or anything like that it just did not have the \"wow\" factor I was looking for. i followed directions to a \"T\" even sifted the flour. It had an alright taste but i think adding in a couple tablespoons of the maraschino cherry juice in the cake batter would REALLY jazz this cake up. Why let it go to waste? i did add some of the cherry juice to my home made whipped cream and it was very delicious. back to the cake- I was so disappointed because I had high hopes for this cake after reading rave reviews. I used skim milk instead of whole maybe it just needed a little more \"fat\" in it from whole milk. But can't see having that much of an impact. Also I found that baking a chocolate cake with cocoa powder as apposed to chocolate baking bars taste more like boxed cake. I probably won't be making this again it was not what i was looking for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1286699/"
                }
            }
        ]
    }
]