[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10482/monster-cookies-iv/",
        "name": "Monster Cookies IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F291349.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-01-18T18:59:57.000Z",
        "description": "This is one heck of a cookie!  This is a very thick dough.  It is mixed best with a table top mixer.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 - 5 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "1 cup white sugar",
            "1 cup packed brown sugar",
            "2 eggs",
            "1 ½ teaspoons vanilla extract",
            "1 tablespoon real maple syrup",
            "1 cup all-purpose flour",
            "½ cup whole wheat flour",
            "⅓ cup graham cracker crumbs",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "3 cups rolled oats",
            "2 cups semisweet chocolate chips",
            "4 ounces finely grated chocolate bar",
            "½ cup chopped walnuts",
            "½ cup chopped cashews",
            "½ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place margarine in a large bowl. With an electric mixer,  cream for 30 seconds.  Stop and scrape bowl.  Add sugars and cream for 2 minutes.  Stop and scrape bowl.  Add eggs, vanilla, and maple syrup.  Mix for 2 minutes.  Scrape bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add all-purpose flour, whole wheat flour, graham cracker crumbs, baking soda, baking powder, and salt.  Mix on low for 1 minute.  Add oatmeal and mix on low for 1 to 1 1/2 minutes, until thoroughly blended.  Add chocolate and nuts.  Mix on low for 30 seconds,  just until blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop by rounded teaspoonfuls onto greased baking sheets.  Bake at 350 degrees F (175 degrees C) for 8 to 10 minutes.  Cool completely on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Leisa Stewart"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.428571428571429,
            "ratingCount": 7,
            "itemReviewed": "Monster Cookies IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "141.9 calories",
            "carbohydrateContent": "18 g",
            "cholesterolContent": "14.8 mg",
            "fatContent": "7.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "85.9 mg",
            "sugarContent": "11.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-09T20:19:52.78Z",
                "reviewBody": "I made a couple changes due to what I had on hand. I used cinnamon graham crackers and ground them in my blender with the ice crushing feature. I also did this with two cups of the oats making part of them more fine to have a good contrast in texture. We have quite a bit of leftover Halloween candy left so I dug out any Hershey bars and chopped them up coarsely. I left out the walnuts and just increased the cashews and pecans each by 1/4 c. as we're not fans of walnuts. I got most of this combined well with my Kitchen Aid mixer I had to hand mix it when I added the chocolate/nuts because it was quite a bit of dough and I wanted to make sure I didn't have it unevenly mixed. I used my small cookie scoop to measure out the dough kind of making the scoop overflow to make the cookies just a little bigger. This is a heck of a cookie....there's a bunch of different tastes and textures. These baked up nicely eleven minutes at 350 was about right. I let the cookies sit on the sheet for a minute or two to let them firm up before I took them off. I'd make these again. NOTE: You can buy the nuts cheaply at your local dollar store and save a couple bucks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T17:50:29.26Z",
                "reviewBody": "These cookies are soft thick and chewy just how I like them. Since this is the 1st review I thought I would be thorough. I added extra graham cracker crumbs just because I crushed too many I probably ended up putting in about 1/2 C. I used milk chocolate chips instead of semi-sweet because that is what I prefer and the big ghirardelli ones that taste so good. I used a 6.8 oz symphony bar for the grated chocolate because I had it on hand but you could forgo this altogether and just add more chocolate chips I don't think it will change it much. I also did not put any nuts in because my family hates them. I do like nuts and think that nuts would taste great in them but they are great without. Also if you like thick chewy cookies DO NOT grease your pan this will cause the cookies to spread and be thinner and crispier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIGGSAIDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1508922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T20:24:30.973Z",
                "reviewBody": "The day I made these was the last day I'd make anything in my kitchen for a long while. While mixing up the dough workers were going in an out of our house to recooperate the flood damage to our house. This unfortunate circumstance shyed me into not baking the dough that day. It was my first time making this recipe an don't handle flops well. However once we made it to our temporary home I scooped them right out an everyone scraped them right up. They were GOOD.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaley_Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-08T20:33:49.617Z",
                "reviewBody": "These are AWESOME!!!! Moist and Chewy! Great taste! Mixed everything by directions with my kitchenaide. No problem.: ) But it is a very thick batter. When I added the chips nuts etc. I mixed by hand not to crush them. I did not have any wheat flour so just substituted the regular white flour and all was good.(I wish the the color was a little darker after baked.... the wheat flour may do this) I did process 1/2 of the oatmeal as one reviews suggest for a variety of texture. For my taste: I added 1/2 cup cho chips 1/2 cup butterscotch chips 1/2 cup white cho chips and 1/2 cup raisins. And only used pecans. Also added 1/2 cup coconut as other monster cookies recipes include. The cookies did not run on the baking sheet while baking. Had great texture. A little crunch a little chewy and very moist. I rolled 1 TBSP balls and then flated. I added M & M's on top after they were on the cookie sheet for added color. Baked for 11 mins at 350. Love love love them.!!!! Yum yum yummie! Enjoy! I will baked these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "billie caren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2062013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-15T01:09:26.83Z",
                "reviewBody": "This cookie rocked my socks off! I was looking for something to clean up some of the ingredients in my cupboard and this was just the ticket. I substituted 1 lb of M&M candies for the chocolate chips and I skipped the grated chocolate bar because it's not something I had on hand. I also skipped the cashews. I brought this cookie to work and gave them out for St. Patrick's day they were a HUGE hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MissAmanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6747292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-18T04:45:50.633Z",
                "reviewBody": "I also ground up left over stale graham crackers in my food processor. I used M&m instead of chocolate bars because it is what I have. The addition of maple syrup was very interesting. It gave the sweetness of raisins without the texture which my kids are not a fan of. I used my KitchenAid stand mixer which began to buck when I added the chocolate and nuts. I switched to a dough hook and it stopped. I used the tablespoon cookie scoop and got 4.5 dozen cookies. I have a gas oven that runs slightly hot so I baked for 9 minutes. The cookies were a big hit with my kids and went viral over social media so I will have a stream of teenager coming by to eat my cookies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "orangeeener",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3074585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-26T20:26:15.167Z",
                "reviewBody": "I've made this recipe about a dozen times and it is great! I grind up the oats because my granddaughter doesn't think she likes them and I add a teaspoon of cinnamon. Thanks for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2127525/"
                }
            }
        ]
    }
]