[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8310/key-lime-cake-iii/",
        "name": "Key Lime Cake III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9425935.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-07-28T03:50:57.000Z",
        "description": "This is a very moist cake. Very easy to make. If you like key lime, you will love this cake.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 - 8 inch round pans",
        "recipeIngredient": [
            "1 (18.25 ounce) package lemon cake mix",
            "1 ⅓ cups vegetable oil",
            "4 eggs",
            "1 (3 ounce) package lime flavored Jell-O® mix",
            "¾ cup orange juice",
            "½ cup butter",
            "1 (8 ounce) package cream cheese",
            "3 tablespoons fresh lime juice",
            "4 cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine cake mix, gelatin mix, oil, eggs and orange juice. Pour into three 8 inch cake pans. Bake according to instructions on box. Allow to cool, then frost.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting: In a large bowl, beat the butter and cream cheese until light and fluffy. Add lime juice and confectioners sugar. Mix well.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.530434782608696,
            "ratingCount": 345,
            "itemReviewed": "Key Lime Cake III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.3 calories",
            "carbohydrateContent": "32 g",
            "cholesterolContent": "45.6 mg",
            "fatContent": "18.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "189.5 mg",
            "sugarContent": "26.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-18T17:55:03.803Z",
                "reviewBody": "I owe it all to this recipe. This is the first recipe that I made from this website for a Family Labor Day Celebration 2 years ago. I put the cake down and sat down for a game of cards and turned around and wondered what all the commotion was about. I walked over to where the cake was (atleast what was left) and those people had scraped the platter clean. Since then I have made minor changes though. And they are still scraping the platter clean. Now I make 1-1/2 of the cream cheese frosting recipe. Please use the real key limes for the juice to go into the frosting, I know they are a pain to squeeze, but the taste is amazing. Don't be afraid to add another Tbs. of Key Lime Juice either. Then I make sure that I add atleast 2 tsp. of Meringue Powder for a firm icing. And lastly, I add atleast another cup or so of powder sugar to kindof work with the tart Key Lime Juice. But I like the sweet and tart to play off of one another. Enjoy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Hagins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2808302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-20T19:27:01.35Z",
                "reviewBody": "I love this cake. It is very rich. I like to make my frosting with just a little lime jello mixed in it gives it a lovely green color. I also add chopped pecans to the frosting. We have topped this cake with cherries or strawberries for the red and green christmas colors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TexasKim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1922843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-07T15:36:10.603Z",
                "reviewBody": "This recipe is DELICIOUS. I made cupcakes with it. I did add the zest of a small lime and fresh lime juice to the batter, for some extra lime flavor. I also used 5 eggs and 3/4 cups of oil instead, as previous reviewers suggested. I tried one without frosting, it was moist and light and the flavor was delicious. I frosted them with \"Lemon Cream Cheese Frosting\" from this site (with lime juice and zest instead of lemons). I used fresh limes for everything. With the frosting, the cupcakes really do have a tangy lime flavor. Mmmm mmmm mmm, just what I was looking for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "monty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-21T20:23:31.747Z",
                "reviewBody": "This is a very delicious, easy to make cake. I'm giving it 3 stars because I'm an advanced baker that believes the recipe can be improved.  The cream cheese icing can turn out a bit runny due to the nature of cream cheese, not the recipe itself. Sometimes cream cheese is just stubborn to deal with. I suggest refrigerating the icing 20-30 minutes prior to iceing the cake.  Also, refrigerate it overnight before serving it if possible. This will help set the icing and the cake and will NOT affect the fresh factor.  Also, the cake is plenty moist with 1 cup of oil. Last I believe to bump this cake up to 4-5 stars, lemon pudding should be used in the place of the lime gelatin. The lime gelatin doesn't really do anything to flavor the cake anyway because of the orange juice. That's mostly for the color. You should be able to use a drop or two of green food coloring w/o it affecting taste to give it a light \"lime\" coloring. Using the pudding should make it more smooth tasting and will eliminate the grit and the crumbling of the bread some reviewers noticed. Using a fresh lime, I suggest you flavor the icing to taste. Fresh lime is strong and you will use less liquid which will help the icing stay firm. If you like a true, strong key lime flavor in the cake, some of the oj HAS to be substituted for lime juice concentrate. I'm trying it this way next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Queen Bee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3801183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-10T00:58:37.863Z",
                "reviewBody": "I have now made this cake probably about 75 times. I have become known for this cake amongst my family, friends and extended family and friends. People actually pay me to make this cake for them, especially when they are entertaining guests. Mostly I go simply by the recipe instructions. I don't lessen the oil at all as I've read some do. Yes it seems like a lot of oil. I've made this cake COUNTLESS times and it still seems like a lot of oil every time but it works! I don't add anything to the batter except the recipe ingredients. What I do change though is the lime juice. Instead I use True Lime packets which is real lime juice dried into a powder form. True Lime gives the frosting the PERFECT key lime flavor with the right flavor balance without adding liquid to the frosting. When I take this cake to a function I can never leave without giving out my number for requests. I gave out the recipe once and she lessened the oil and she said it was a horrible mistake! So I don't give the recipe anymore. Also I bake this cake at 325 instead of 350!!! 350 is too high, bake at 325 for about 35 to 40 mins, depending on your oven, let pans stand for exactly 10 mins, remove from pan and let cakes cool COMPLETELY before assembling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Willie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/queencitydude/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-09T14:51:38.94Z",
                "reviewBody": "I did cut way back on the oil to 1/2 cup & added 1/2 cup applesauce. Very moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "T L Dixon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/971119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T15:38:26.14Z",
                "reviewBody": "Though I prefer \"from scratch\" cakes my family loved this recipe. Very moist with a good lime flavor and bright green color which contrasted nicely with the white frosting. My layers baked in 20 minutes and I had to double the frosting ingredients (except for the lime juice) to get enough frosting to adequately cover the layers top and sides of cake. The frosting was very good with this cake however because it offset the cakes sweetness. Overall I would make this cake again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "The Cake Maker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/135083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-21T17:39:39.857Z",
                "reviewBody": "I made this cake for a luau theme party this weekend and it was a smash hit. Everyone raved about it. Due to a two hour travel time to the party I made it in a disposable alum foil 9X13 cake pan. I'm not sure if it was my oven or because I baked it in a thinner pan but the cake baked much faster than the directions on the box. I also had read the reviews and had noticed several people indicated the icing was very rich. So I cheated and bought a can of Betty Crocker cream cheese frosting and added the key lime juice to it. Absolutely perfect! I won the prize for best dessert at the party and believe me there were some good ones. Mine was the first one consumed down to the crumbs!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Divonna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-18T02:52:49.14Z",
                "reviewBody": "I made this for a shower with a \"mexican\" theme. It was a big hit I had lots of people ask for the recipie. I loved it nice flavor. I even used apple sauce for the oil to make it \"lighter\". This is an easy cake that tastes great!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KECIA NELSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/260384/"
                }
            }
        ]
    }
]