[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/846/desserts/cookies/filled-cookies/",
                    "name": "Filled Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11423/fudge-puddles/",
        "name": "Fudge Puddles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F530188.jpg",
            "width": 1427,
            "height": 1426
        },
        "datePublished": "1999-07-28T15:46:01.000Z",
        "description": "Fudge filled deliciousness!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "½ cup butter, softened",
            "½ cup creamy peanut butter",
            "½ cup white sugar",
            "½ cup packed brown sugar",
            "1 egg",
            "½ teaspoon vanilla extract",
            "1 ¼ cups all-purpose flour",
            "¾ teaspoon baking soda",
            "½ teaspoon salt",
            "1 cup milk chocolate chips",
            "1 cup semi-sweet chocolate chips",
            "1 (14 ounce) can sweetened condensed milk",
            "1 teaspoon vanilla extract",
            "¾ cup pecan halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together flour, baking soda and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream butter, peanut butter and white and brown sugars. Mix in egg and 1/2 teaspoon vanilla. Stir the flour mixture into creamed mixture. Shape the dough into 48 balls, 1 inch each. Place each ball in one compartment of a mini muffin tin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For filling, put chocolate chips in a double boiler over simmering water. Stir in milk and vanilla, mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 14 to 16 minutes or until lightly browned. Remove from oven and immediately make wells in the center of each using a melon baller. Cool in pan for 5 minutes. Then carefully remove to wire racks. Using a measuring cup fill each shell with the chocolate mixture. Top with a pecan half.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Filled Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "debzy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.739526411657559,
            "ratingCount": 549,
            "itemReviewed": "Fudge Puddles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "273 calories",
            "carbohydrateContent": "33.2 g",
            "cholesterolContent": "25 mg",
            "fatContent": "14.7 g",
            "fiberContent": "1.3 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "164.8 mg",
            "sugarContent": "26.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-26T16:40:57.017Z",
                "reviewBody": "These were so easy to make and so, so yummy!  I used a crunchy peanut butter for a more pronounced peanut taste...  To prepare the chocolate filing, use a glass measuring cup and melt the ingredients in the microwave.  Using the measuring cup, allows you to \"reheat\" the chocolate as necessary for an easy \"pour\".  These disappeared as quickly as I filled the \"cups\" with my family clamoring for more!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-07T00:01:03.293Z",
                "reviewBody": "These were excellent! I made the recipe exactly as indicated, except I DOUBLED the cookie dough/muffin part (I used the exact amount of chocolate filling ingredients per the recipe, though). That gave me exactly the amount of chocolate filling I needed, since I read other people's reviews that they had too much chocolate left over. I made the exact amount of chocolate in the recipe, but doubled the amount of cookie dough, and the amount of chocolate filling came out perfect for the doubled batch of muffins. \r\n\r\nThe trick I learned to getting the muffins to come out without any trouble was this--as soon as they are out of the oven, go ahead and use the melon baller to make the indentation in the muffin (as recipe indicates). Then, let the muffins rest in the pan about 10 minutes before you remove them from the pan--mine came out perfectly. I just used a sharp knife and it took no effort to remove them. I also greased the mini-muffin pans before using, so that may have helped, and baked them exactly for 14 minutes. I highly recommend these--they are visually very appealing also. It looks like you spent a lot of time making them, when they were really pretty easy. Thanks for the great recipe Deborah! They will become a staple of our household, and not just for Christmas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLUEEYEZ58",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-04T19:02:25.01Z",
                "reviewBody": "Excellent!!  I made the recipe as written.  I used the pestle (from my mortar & pestle) to make the well in the center.  It was well worth the time it took.  I didn't have to double the dough but I did make sure that the well was deep without making the bottom see through.  I let them cool for about 8 minutes before removing them from the pan and transferring them to the cooling wracks.  Then I let them cool for another 15 minutes before I started on the fudge filling.  There was maybe enough left over fudge to fill two more puddles. The result was delicious!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nandabear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nandabear/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-15T15:49:26.123Z",
                "reviewBody": "Yum! I used a small cookie scoop instead of making balls and filled the mini-muffin tin. This was done in a snap. I ended up with 36 I didn't double the recipe. I also used the scoop to fill the cookies with the fudge filling. The scoop is about 1 oz. Make sure not to overbake. Take out of the oven when they start to brown.Very easy and very yummy. The chocolate center is rich. The peanut butter cookie cup does not stand out. You will have a little fudge left over put it in a small plastic container and chill it and you have yourself some fudge! UPDATE ------- I find the trick to removing the cookie without them breaking is to rotate them by pressing gently in to the right or left. Once they start to spin they come out without breaking. They should cool around 10 minutes before attempting to do this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Castellucci Miller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-18T14:50:56.513Z",
                "reviewBody": "These look sooo fancy! You can't go wrong with PB and Chocolate. While I did not have difficulty removing my cookie base from the muffin tin it does take a little bit of time to remove 24 to 48 of them one-by-one. So I would recommend that you only make the filling once they are all removed from the pan and cooling on the rack. Otherwise your fudge will start to set in the pot while you're taking them out. I found it a little difficult to scoop up the right amount of filling so that I wouldn't overflow or end up with drips ruining the perfect edges. Any tips out there?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith Woods",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1523823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-08T18:06:16.963Z",
                "reviewBody": "Looks so fancy with such little effort!  The taste is very good too.  The fudge center is awesome!  This cookie intrigued me for a Christmas type of offering, but my kids liked it enough to have more often and it was certainly easy enough.  It was a 5 star, recipe for ease, presentation, and taste, but I fixed a double batch of dough as per reviewers suggestions.  I used my mini muffin tins, and had 70 cookies to fill.  My issue was there was enough fudge to fill 48 cookies full, or about 55 cookies 3/4 full.  This recipe is perfect on amounts so don't make extra dough as suggested, unless you want a lot of peanut butter muffin shells.  :-) Thanks for a keeper recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-11T02:01:58.34Z",
                "reviewBody": "Superb concept. As many others have noted you must have patience and not try to take them out of the tins too soon. I found that waiting about 10 minutes allowed them to pop out easily by simply inserting the tip of a knife between the outside of the cookie and the tin. Only 4 stars because we disliked the artificial taste and megawatt sweetness imparted by the condensed milk. Having a hunch as to how to improve the filling I heated about 1/3 cup of heavy cream until the edges got bubbly adding 2 Tb butter and 6 ounces of milk chocolate and 6 oz bittersweet chocolate both Ghirardelli. Stirred it until the chocolate was melted and the mixture was perfectly smooth and shiny then filled. OFF THE FLIPPIN' HOOK'!! The tender cookie acts as the perfect vehicle for fudgy truffle/ganache filling. You can easily adjust the sweetness by changing the proportion of milk chocolate to semisweet or bittersweet chocolate you use according to your taste. The proportions above represent a more adult sophisticated version of the cookie not sickeningly sweet as the written filling is. Rich sinfully chocolate. Now THAT's what I'm talkin' about!!! NOTE: The easiest way to fill is to put your filling in a zip-lock sandwich bag cut one of the corners off by snipping a small piece of the plastic and squeeze to fill. If the filling gets a little thick microwave for 10-15 seconds and it should loosen up enough for you to resume filling. Easy and no mess!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-15T18:06:54.197Z",
                "reviewBody": "These were really good, I used butterscotch chips instead of Milk Chocolate and it was not my favorite, but everyone who tried them absolutely loved them. These are so easy and impressive, they are going to be a sure thing for cookie trays, catering events, etc.  My daughter said that she liked them better on the second day.  Oh, I had enough fudge left over to make about 20 more.  And, I put the warm fudge in a large squeeze bottle and just went from 'cup' to 'cup' with this yummy goodness!  Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Ostlund",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1791542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T01:51:12.03Z",
                "reviewBody": "Where has this recipe been all my life? I did not use mini tins but full-sized and they turned out perfect. I think that by using the bigger tin size you are less likely to have leftover icing. I didn't. The cookie came out perfectly from the tin also. Use a thin pointed tip of a knife and slide it down at 3 different spots and they come right out. I think putting pecans on top is not necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SubtleButStrong",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1274849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T20:16:47.937Z",
                "reviewBody": "Very cute but not the best TASTING cookie I've ever made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MISTICAT57",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/193228/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Fudge Puddles ",
            "description": "These are the best treat! ",
            "uploadDate": "2018-12-07T20:00:20.354Z",
            "duration": "PT46.656S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F38d862b7-64a0-4a5f-a635-f7c6668885d1%2F948d4c14-c092-4412-b34b-5fb7c97de6db%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5976075430001"
        }
    }
]