[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7176/soft-moist-and-gooey-cinnamon-buns/",
        "name": "Soft, Moist and Gooey Cinnamon Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4141866.jpg",
            "width": 2272,
            "height": 2272
        },
        "datePublished": "1999-07-28T18:11:53.000Z",
        "description": "I tried long and hard to find the ultimate cinnamon bun recipe for bread machines...this is it. They are so soft and yummy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT3H35M",
        "recipeYield": "2 dozen buns",
        "recipeIngredient": [
            "1 cup milk",
            "1 egg, beaten",
            "4 tablespoons melted butter",
            "4 tablespoons water",
            "½ (3.5 ounce) package instant vanilla pudding mix",
            "4 cups bread flour",
            "1 tablespoon white sugar",
            "½ teaspoon salt",
            "2 ¼ teaspoons bread machine yeast",
            "½ cup butter, softened",
            "1 cup packed brown sugar",
            "2 teaspoons ground cinnamon",
            "¼ cup chopped walnuts",
            "¼ cup raisins",
            "1 teaspoon milk",
            "1 ½ cups confectioners' sugar",
            "4 tablespoons butter, softened",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a bread machine pan, place the milk, beaten egg, melted butter, water, vanilla pudding mix, bread flour, sugar, salt and yeast in the order recommended by the manufacturer. Select the Dough cycle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When cycle is finished, remove the dough, and knead for 3 to 5 minutes. Roll out to a large rectangle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the softened butter, brown sugar and cinnamon. Spread over dough. Sprinkle with chopped walnuts and raisins, if desired. Starting with the widest end, roll the dough into a log. Pinch to seal seams. Cut into 1/2 inch to 1 inch slices, and place in a greased 9x13 inch pan. Place in a draft-free space, and allow to rise until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Bake for 15 to 20 minutes. To make frosting, mix the milk, confectioners sugar, softened butter and vanilla in a small bowl. Spread over warm cinnamon rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FIONASMOM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.768571428571429,
            "ratingCount": 700,
            "itemReviewed": "Soft, Moist and Gooey Cinnamon Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "164.7 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "28.9 mg",
            "fatContent": "8.9 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "142.6 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-29T13:07:01.31Z",
                "reviewBody": "Instructions for cinnamon buns using the mixer or by hand: \r\n1)Combine water, yeast, sugar. Allow to proof for about 15 minutes in warm place (cover with plastic wrap or a damp towel). I leave my yeast to proof in the microwave after having turned it on for a minute to heat it up. Then I put the yeast mixture in (don't turn on while it is in!).\r\n2)Mix remaining wet ingredients for dough in mixer (or by hand). Add yeast mixture. Mix till combined. \r\n3)Switch whisk attachment w/ the dough hook (or knead by hand in a large bowl to save mess of having to knead on a surface). Slowly mix in the flour w/ the dough hook, on a low speed. Once flour is more or less blended (& won't fly out of the sides), knead at a high speed till it forms a sort of ball around the dough hook. Avoid adding lots of extra flour to avoid dry buns.\r\n4) Put in large greased and/or lightly floured bowl. Cover & let rise in warm place till doubled in size (about 30-40 minutes- don't leave longer, even not yet doubled).\r\n5) Follow instructions for rolling out & the rest of the recipe as written.\r\n\r\nI substituted 1/2 c. of butter w/ 1/4 c. margarine & 1/4 c. oil. It worked fine. A couple of buns that didn't get covered well in the glaze were slightly dry. It is important to use the full amount of the butter for filling so buns don't dry out. I highly recommend them & thank Tania for the wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBES1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1217546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T07:29:29.763Z",
                "reviewBody": "If I could give this recipe 10+ stars I would!  A few months ago I made the \"clone of a Cinnabon\" recipe from this web site, and at the time I said that I would only use that recipe from thereon. That is...until I discovered this recipe over the weekend.What caught my eye was the addition of the pudding mix to the dough.  Anyway, I gave it a try, and I am converted to this recipe.  I used to live near a mall that had a Cinnabon outlet, and I became a cinnabon addict (truly!) The other clone recipe, although very good, wasn't quite it.  Now that I have this one I am in heaven!!! If you closed your eyes and did a taste test with a real cinnabon and this recipe, you most definately would not be able to tell them apart! I havn't made the icing for these yet (I've run out of vanilla), but they almost don't need it.  The buttery, sugary, gooiness of the filling turns into a gorgeous glaze. My husband wants me to start selling these, and he swore he did not like cinnamon buns! Tania, you said these have a distinctive taste, and you're absolutely right!  A million thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mollycurls77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-18T22:50:53.87Z",
                "reviewBody": "Absolutely fabulous recipe.  Very easy to follow.  I used a 16x21 inch board and rolled out the dough to fit it.  Perfect!  I did have to use a larger pan, 12x16, but the 24 rolls fit beautifully.  If you want to fit them into a 9x13 pan, cut the dough into 12 rolls rather than 24.  They need a few more minutes of baking time, but they're huge and delicious.  Better than you can get at any mall or bakery.  I agree with others who suggested more filling but I found doubling it to be a tad too much, so I now make just half again more filling (1 1/2 times the amount called for).  I also used a cream cheese frosting, just because we love it so much!  If you want to make these so they're hot and fresh first thing in the morning, you can make the dough the night before.  After you've rolled them out, spread the brown sugar mixture, rolled and cut them, put them in your prepared pan and put the pan in the fridge.  In the morning, just place a large pan of boiling water in the oven (near the bottom) and put the pan of rolls in above it.  Within 30 minutes or so, they will rise and you will be ready to bake them.  Just take them out, preheat your oven, and you'll have hot, fresh, gooey goodness in no time.  You cannot go wrong with this recipe.  It's perfect!  Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-16T21:03:59.09Z",
                "reviewBody": "Incredible! These buns are so tender and delicious! I didn't have the pudding so I left it out and they were awesome without it-don't know how they could've been any better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JILL IN FL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-04T12:52:28.783Z",
                "reviewBody": "I do NOT have a bread machine but I do have a Kitchen Aid, so I adapted this recipe to reflect that. My oldest boy and I made this recipe together. We proofed the yeast with the warm milk, warm water and the sugar for ten minutes, then we added the egg, the melted butter, the vanilla pudding mix, the salt and the flour. This did need a little more flour to get it to form a ball, about a quarter cup more. Once it formed a ball, we kneaded it with the dough hook for five minutes. We let it rise in a greased bowl over a warm heating pad for an hour, rolled it out and spread on the brown sugar/butter/cinnamon mixture. We got eight biggish rolls out of one recipe (which filled one deep disposable lazagna pan), not close to the serving size that the recipe stated. (Not a huge deal for us, we like bigger rolls. But if someone is making this and wants more rolls out of it, you'll have to double it and cut them a little thinner than we did.) I covered the rolls and let them sit in the fridge overnight until this morning when I put them on the warm heating pad for the second rise. Our rolls were done at 25 minutes. The icing was perfect EXCEPT I needed a lot more milk than the recipe asked for--I want to say 8 teaspoons? These rolls turned out beautifully, you'd think that they were from Cinnabon BUT these were WAY too sweet for us. It really was overkill. If I were to make this again, I'd cut the filling by half. NOTE: Half a box of instant vanilla pudding mix is a quarter cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-17T20:00:24.92Z",
                "reviewBody": "I made these cinnamon buns 3 times before posting this review. Each time I made them, they got a relatively positive reception, but I think it was because most of the people who tried them had eaten cinnamon buns maybe once or twice in their lives. There was something about them that really bothered me. I finally realized what it was: they did come out gooey, but it was because they stayed quite raw. Baking them longer than the recommended 20 minutes did cook them a little more, but the cooked parts were dry and crusty, and the gooey parts were really just raw dough. And the sugar to butter ratio was way too low such that the sauce turned into butter soup while it was baking, leaving none of the filling in the buns. Thanks to BellesAZ who posted her idea of using Grandma Van Doren's white bread recipe as the base for the bread. Using this recommendation, I made the most incredible, fluffy, moist cinnamon buns ever. And for filling I used 1/4 of a cup butter to 1 cup brown sugar (with lots of cinnamon). My husband thought it was to die for. That is what I'll stick to from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "cpigott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5365630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-13T20:55:23.093Z",
                "reviewBody": "These were the most delicious cinnamon buns I've ever had - even better then the store bought ones! When I first made them, they were absoluetly deeeeelicious. They melted in your mouth and the savory cinnamon flavour filled your house. A few days after, I had tried the \"Clone of a Cinnabon\" and I'd have to say, these were 100x better! The other recipe's cinnamon buns where very hard and not as oooey and goooey as these delicious treats. I didn't modify the recipe one bit because it was so good. A tip for making these cinnamon buns is when you flatten out the large rectangle, use a butter knife a straighten out all the sides (you can take those extra pieces for patching). This way, you won't have \"end pieces\" that no one will eat. \nThe texture of the dough was exceptionally delicious - soft and chewy and the filling was so flavourful - not too bland and not to spicy. I was just looking through the reviews written by others and noticed they had said how these cinnamon buns became hard the next day and how they only lasted 'soft and moist' one day. What I do is pop it on a plate and stick it in the microwave for a good 20-25 seconds (depends on your microwave!!!) then it becomes chewy gooey and fresh and soft and moist all over again. Thank you very much for this recipe. Defenitely a keeper! (I've made these about 15 times and I won't stop!!) :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "iLfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2338211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-27T18:11:47.84Z",
                "reviewBody": "These have to be some of the most wonderful cinnamon buns around!  I have made them a few times and find the recipe rather sweet for my own  tastes (not big on sweet stuff), so I usually cut the sugar and up the cinnamon in my filling.  I also don't ice them - they're great as is, and if I did ice them, this Cinnabon-raised girl would have to go for a cream cheese icing.  The dough, however, is absolutely perfect - fluffy, tender and flavorful.  So perfect that my batch has disappeared in less than 24 hours, thanks to my parents, grandmother, brother and of course, me!  Just in case anyone hasn't heard this tip before, you can use a piece of thread or dental floss to slice the buns easily: cut a piece about a foot long, hold each end and slide it under your finished log of dough.  Cross the ends of the thread over, switching hands, and pull until the thread cuts through the dough.  Works like a charm!  Thank you Tania for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Read",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1068217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T16:17:22.027Z",
                "reviewBody": "This is sooooooo good, I couldn't believe how delicious they were.  My family ate them all in about 24 hours.  This recipe is under-rated--it's much better than the Clone of a Cinnabon recipe (though I used the frosting from that recipe).  I cannot recommend it enough.  \nUPDATE: To keep the cinnamon filling from seeping out, I baked the entire roll without cutting it, and then cut it into individual rolls once it came out of the oven.  I also added pecans to the filling and it tasted even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RALWATTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1281438/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Soft, Moist and Gooey Cinnamon Buns",
            "description": "Your bread machine will love making these cinnamon rolls!",
            "uploadDate": "2017-06-28T15:28:01.510Z",
            "duration": "PT1M14.074S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffd3e18fe-15b0-44bc-9b59-b6de28c816b1%2F917e7d34-bc54-4df5-822b-98680842fe88%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5485868296001"
        }
    }
]