[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8873/easy-chicken-rice-casserole/",
        "name": "Easy Chicken Rice Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2207625.jpg",
            "width": 1936,
            "height": 2592
        },
        "datePublished": "1999-08-03T18:49:40.000Z",
        "description": "Chicken pieces and rice baked slowly in milk and cream of chicken soup. A simple, creamy casserole. You can also use a whole (2 to 3 pound) chicken, cut into pieces. The choice is yours so choose and choose well! Then enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves, cut into bite size pieces",
            "2 cups milk",
            "2 cups uncooked white rice",
            "2 (10.75 ounce) cans  condensed cream of chicken soup",
            "1 teaspoon seasoned salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl combine the milk, rice, soup and seasoned salt if desired. Mix well. Pour mixture into a lightly greased 9x13 inch baking dish. Add the chicken pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover dish tightly with aluminum foil and bake in the preheated oven for approximately 90 minutes or until rice is done, stirring every 30 minutes. Uncover the dish and bake for another 15 minutes to allow the rice to brown.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "VET2B01"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8551401869158877,
            "ratingCount": 428,
            "itemReviewed": "Easy Chicken Rice Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "516.8 calories",
            "carbohydrateContent": "67 g",
            "cholesterolContent": "81.8 mg",
            "fatContent": "10.7 g",
            "fiberContent": "0.6 g",
            "proteinContent": "34.3 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "910.7 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-28T20:29:50.787Z",
                "reviewBody": "I've made this dish twice.  The first time, I followed the recipe, and found that as written, it was much too bland for my taste.  I made it again tonight, with the following modifications:  Instead of 1 tsp season salt, I used 2 teaspoons of McCormick roast chicken seasoning, plus about 1/2 teaspoon each of dill and thyme.  I also added a good dose of fresh ground pepper, and used 1 can each of cream of chicken and cream of mushroom soup.  Much more flavorful the second time around - my family loved it. Great basic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Shute Iverson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-06T00:24:01.967Z",
                "reviewBody": "I have enjoyed this recipe for years only I add a package of dry onion soup mix sprinkled over the top.  It gives the dish the extra seasoning that really brings the whole thing together for a great taste.  It is an easy one dish meal.  I have added brocoli and/or mushrooms in the past as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1308",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/618820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-07T19:14:04.107Z",
                "reviewBody": "This was great!  Since it is just my husband, myself, and my two year old, a recipe this size would have leftovers.  Not this time.  My husband went back for seconds and thirds!  Having said that, I should let you know I made some changes to the recipe.  I switched one of the cans of cream of chicken soup for Campbell's creamy chicken verde soup.  I added 1/2 cup frozen chopped onion, and instead of the chicken breasts, I used boneless skinless chicken thighs which I laid on top of the rice mixture.  I then sprinkled the entire dish with season all.  I also sprinkled about a cup of shredded monterey jack cheese and some finely crushed tortilla chips on top for the last 15 minutes without the aluminum foil.  I know that is a lot of changes, but it was yummy!  I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pepesme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/homemadehappiness/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-02T03:28:13.25Z",
                "reviewBody": "This casserole is easy to make and uses inexpensive ingredients, but is bland as it is, so I made the following changes to mine.\n\nWhen cooking the chicken, I added minced garlic, coarse ground pepper, and a few dashes of ground red pepper.  I substituted 1 cup of the white rice for a 1-cup pkg of seasoned yellow rice mix.  I also added garlic powder, white pepper, a few dashes of poultry seasoning, and more ground red pepper into the rice mixture before putting into the oven.  Ten minutes before the casserole was done, I added shredded monterey jack cheese with jalapenos on the top.  \n\nNOTE:  It is important that you use the correct size casserole dish to ensure your results are neither too dry nor too wet.  \n\nWith my add-ons, the end result was a very good dish overall.  My family prefers dishes with some kick and depth of flavor, and this recipe delivers.  There were no leftovers with this!  My husband loves this dish and can't wait to have it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MountainGirl4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mountaingirl4/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T20:41:36.09Z",
                "reviewBody": "Great basic recipe.  In fact the only one I could find that used two cans of cream of chicken soup. (It was the only soup I had on hand and I didn't want to run to the store)  Great comfort food.  Would be especially good if family was sick or under the weather because of its mildness.  I added a few items for flavor including parsley, chives, chopped onion, poultry seasoning, salt and pepper.  I also added a small amount of grated cheddar cheese to the top just before I removed it from the oven.  It did require quite a bit more liquid than called for.  I used two cups milk and two cups of chicken stock (I boiled my chicken and cut in pieces before adding to this recipe)  I also cooked  it for only one hour.  The rice was tender and the recipe was creamy.  (hint:  read the cooking directions on the bag of rice you are using, some brands of rice call for more liquid than others.  My son said \"Mom , this one is a hit.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SKAARON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-02T16:59:35.747Z",
                "reviewBody": "Great base recipe, I took everyones advice and added a few things of my own. I only did a half version of the recipe, and I used cream of mushroom instead of cream of chicken. I added 1.5 cups milk, french fried onions, and about a tablespoon of garlic salt to the mix. I also topped it with croutons and sharp cheddar cheese during the last 15 minutes of cooking. The only thing I will change next time is adding more rice. If you don't like your rice creamy, I wouldn't reccomend this recipe as it currently is. This will be a new staple in our home! If you like to experiment in the kitchen give this one a try! You can't go wrong!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HardCore_Momma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1581511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T21:55:27.14Z",
                "reviewBody": "This recipe is quick and easy. Only I wouldn't cook it for 90 minutes. 1 hour seemed to be enough. The liquids really dried out after an hour. If the rice isn't cooked you could add another half to one cup liquid and cook longer. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTINEMARIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/142184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-05T22:21:27.17Z",
                "reviewBody": "Thanks for the original submission as well as the many detailed reviews!  As said before, excellent base but imperative to add your own flair to make it really good.  My family is big on flavor and this was my first casserole ever so here's what I did.\r\n\r\nUsed 3 cups milk, totally thawed the chicken and soaked in (hot water w/ 2 chicken boullion cubes, seasoned salt, pepper and a steak dry rub I like to use).  Used Cream of Mushroom and Cream of Chicken and seasoned with 1/2 tbsp Paprika, 4 tbsp Garlic Salt, 4 tbsp Pepper, 1/2 tbsp Garlic Powder, 2 tbsp Onion flakes.  Placed in greased casserole dish then topped off with a bag of Mexican shreaded cheese.  \r\nAfter 1 hr pulled it out.  The middle was not done (chicken still light pink and rice crunchy).  Mixed the whole thing up with an extra 1/2 milk.  Then recovered and cooked the remaining 30 mins.  Came out *perfect*.  Everything was evenly cooked, it wasn't too watery or dry (I hate things that are *too* creamy) and there wasn't a single leftover.\r\n\r\nNext time I will stir every 30 minutes and might try not topping off with cheese til the last 30 minutes.  Good Luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ELConort",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1425921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-25T00:28:17.327Z",
                "reviewBody": "Really good and basic; I also made some changes to the recipe. I only used 3 chicken breasts instead of 6 and instead of adding 2 cans of cream of chicken soup I substituted one of the cans for cream of mushroom instead. I only used 1 cup of milk instead of 2 and added some paprika chili powder (we like it kind of spicy) and garlic. Instead of baking it for 90 minutes we only put it in for 60 and it turned out just great. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTEN H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/750619/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy Chicken Rice Casserole",
            "description": "See how to make a simple, comforting winter casserole.",
            "uploadDate": "2013-11-12T20:10:47.668Z",
            "duration": "PT2M21.708S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa88844d2-bbf7-4a2a-960d-4a1278e9370a%2Fc0939fc9-1845-4894-8e1b-f80280f5e42c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2832255685001"
        }
    }
]