[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17049/soups-stews-and-chili/stews/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12816/cioppino/",
        "name": "Cioppino",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F04%2F08%2F12816-Cioppino.jpg",
            "width": 1469,
            "height": 2000
        },
        "datePublished": "1999-08-04T16:37:27.000Z",
        "description": "A wonderful seafood stew! Serve with a loaf of warm, crusty bread for sopping up the delicious broth!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "12 to 14 servings",
        "recipeIngredient": [
            "¾ cup butter",
            "2 onions, chopped",
            "2 cloves garlic, minced",
            "1 bunch fresh parsley, chopped",
            "2 (14.5 ounce) cans stewed tomatoes",
            "2 (14.5 ounce) cans chicken broth",
            "2 bay leaves",
            "1 tablespoon dried basil",
            "½ teaspoon dried thyme",
            "½ teaspoon dried oregano",
            "1 cup water",
            "1 ½ cups white wine",
            "1 ½ pounds large shrimp - peeled and deveined",
            "1 ½ pounds bay scallops",
            "18 small clams",
            "18 mussels, cleaned and debearded",
            "1 ½ cups crabmeat",
            "1 ½ pounds cod fillets, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Over medium-low heat melt butter in a large stockpot, add onions, garlic and parsley. Cook slowly, stirring occasionally until onions are soft.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add tomatoes to the pot (break them into chunks as you add them). Add chicken broth, bay leaves, basil, thyme, oregano, water and wine. Mix well. Cover and simmer 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the shrimp, scallops, clams, mussels and crabmeat. Stir in fish, if desired. Bring to boil. Lower heat, cover and simmer 5 to 7 minutes until clams open. Ladle soup into bowls and serve with warm, crusty bread!\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Seafood"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Star Pooley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.765247410817031,
            "ratingCount": 869,
            "itemReviewed": "Cioppino",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "317.5 calories",
            "carbohydrateContent": "9.3 g",
            "cholesterolContent": "163.9 mg",
            "fatContent": "12.9 g",
            "fiberContent": "1.3 g",
            "proteinContent": "34.9 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "755 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-13T13:05:48.06Z",
                "reviewBody": "Fantastic!!!  I made a few changes, took some hints from other reviews.  Such as, used 1 large can of crushed tomatoes and 1 14.5 oz. can of stewed tomatoes, no water.  I also used 1 bottle of clam juice and 1 cup of chicken broth and I added calamari and some extra garlic.  I simmered the broth for over an hour, until we were just about ready to eat, and then added the fish (took order from another recipe) first the clams for about 5 min, till they start to open, then the crab legs (about 1 minute) then the mussels, shrimp, squid, scallops and cod.  Cook stirring frequently until the mussels open, the shrimp curl and the squid and scallops are just firm (about 3 minutes).  Everything was cooked just right and the flavor.......wonderful!!!  The recipe served 6 adults and we had a little left over. I took some of the broth and cooked some extra shrimp in it and then added the rest of the broth and fish and warmed it up.....it was wonderful even as a leftover.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROTED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/486428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T01:46:47.937Z",
                "reviewBody": "Those of you who have read my other ratings know that 4 stars means my family loved it.  5 stars is absolutely above and beyond.  This is hands-down the best recipe we've ever tried on All Recipes!!!!\n\nA few helpful hints if you are going to try this wonderful recipe:  \n\nBe sure you have a really big pot!  You will want to avoid stirring this too much in order to avoid breaking up the meat, so a big pot is critical!\n\nUse very dry white wine.  A sweet white wine will interfer with the flavor of the seafood, whereas a dry white will compliment the flavor wonderfully!\nDon't use flake-style crab meat as it will just disappear in the broth.  Either use king crab legs in the shell or precook your crab legs and extract the meat for the soup. (if you use crab legs in the shell, add 1/2 lb to the amount)\n\nPlace the cod in large pieces on top at the very end and cook it quickly.  This will ensure that the cod won't break apart and your guests can extract whole pieces to their plates.\n\nCook quickly and serve!  If you cook too long the seafood will dry, flake, and lose flavor.\n\nThe three secrets to success for this recipe:  Fresh, Fresh, Fresh seafood!\n\nMake this for someone you love.  I made it for my Dad and he still raves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OSuzyQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1266627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T22:13:16.14Z",
                "reviewBody": "I hesitated between 4 - 5 stars because this is a really inspired recipe, but I did have a couple of suggestions.  I agree with other reviewers that additional fish stock would give it more depth of flavor and I too blanched at all the butter.  So used used olive oil, and just a couple tablespoons of butter.  Also, if you are using fresh mussels and clams (as I did), they need to go in about 10 minutes ahead of the other fish, because the shrimp, scallops, fish, and crab will cook in about 5 minutes.  I'd wait until the clams and mussels start to open before adding the rest.  I also added a about a 1/2 teaspoon of red pepper flakes for a little more zest.  I'll definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "florida gail",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/540692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T01:42:08.95Z",
                "reviewBody": "This was a very tasty recipe.  I used a few of the changes reccomended by other reviewers such as using all wine and no water and I added lobster broth to enhance the seafood flavour.  The one thing I will change the next time I make this recipe is to use olive oil instead of butter and reduce the amount of fat to 1/4 cup.  The large amount of butter made this recipe very, very rich (the seafood is rich by itself it does not need excess butter) and I noticed a layer of fat on the top of the stew (I did not find this appetizing).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDYLOAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-21T19:28:27.28Z",
                "reviewBody": "Wow, this was amazing!  It definitely tasted like a restaurant-quality dish.  I had a dinner party for 4 people--started with a simple lettuce salad with pine nuts and a lemon-basil dressing.  Then we had crab cakes.  The cioppino was the main course.  (Followed by a creme brulee.)  I did make a few changes, but as other people have mentioned, the beauty of this recipe is its flexibility!  I like my cioppino very tomato-based, so even though I halved the recipe, I put in a 28-oz can of tomatoes, as well as a 14-oz can of tomato sauce.  Also, I used a merlot (red wine) instead of white, because I tend to associate tomato-based dished with a red wine accent.  I used a combination of fresh and frozen seafood.  I got fresh mussels and a few scallops from Whole Foods, but then I supplemented with a bag of frozen shellfish and some frozen raw shrimp from Trader Joe's.  I used fresh basil and a mediterranean seafood seasoning from Whole Foods.  Served it with fresh grated parm. cheese on top, fresh ground pepper and a big loaf of fresh, crusty bread.  My guests kept talking about it the entire evening!  I served a nice Chianti with it, which worked well.  My husband and I are both poor graduate students, so we can't afford to make this very often, but we both agreed it was completely worth the price!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Post-It Poet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1517461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-20T23:26:27.31Z",
                "reviewBody": "Overall this is a good Cioppino.  Being Italian, I had to delete the butter for a nice Extra Virgin Olive Oil.  Other changes...I used crushed tomatoes with added puree and a can of diced tomatoes, no water was necessary, added 1/2 teaspoon dried crushed red pepper to give it a little zip, used red wine instead of white and included squid and sea bass.  Yummy hit for a friend's birthday dinner party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MADODD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/238660/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T02:19:04.787Z",
                "reviewBody": "Absolutely incredible! I made the broth a few weeks ago and froze it. I had a dinner party for 8 with heavy hors d'oeuvres and then the Cioppino and bread for the meal.I thawed the broth had it hot and simmering and added the seafood and it was ready in a snap. I used bay scallops and shrimp only and it was superb! Every bit was eaten! Definitly let the broth simmer a long time for the depth of flavor. It will be a staple at our house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/846745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T01:42:40.81Z",
                "reviewBody": "What a fabulous stew!  I replaced the butter with olive oil, added more garlic, but didn't chop fine. I added a handful of parsley and a handful of cilantro.  I added 3 anchovy filets and broke them down in the hot olive oil until they dissolved.  I added the wine and deleted the water.  I put one large can of stewed tomatoes and 2 cans of crushed tomatoes.  Then added the clams, mussels, bay scallops, jumbo scallops, shrimp and white fish.  This is excellant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBYALLEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/713027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-25T21:38:58.263Z",
                "reviewBody": "I used the modifications submitted by ROTED, which I highly recommend.  A nice thing about this dish is that it's cost can vary dramatically, depending on the types of fish and shellfish you include.  If you're making it for company, I recommend that you add one lobster claw per serving, and add it last so that it is on top of the clams and mussels.  This is expensive but well worth it, in terms of both taste and presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cioppino",
            "description": "AR_0349_CIOPPINO_R1",
            "uploadDate": "2012-07-10T18:26:11.185Z",
            "duration": "PT4M14.129S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7761768d-8820-47a2-a2ae-ebc6b16113a5%2F54318741-cf7f-4d0f-8d83-d983a71a0067%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729106381001"
        }
    }
]