[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12623/strawberry-cobbler-ii/",
        "name": "Strawberry Cobbler II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F214848.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-08-13T17:10:27.000Z",
        "description": "It is very good when served warm with whipped cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup white sugar",
            "1 tablespoon cornstarch",
            "1 cup water",
            "3 cups sliced fresh strawberries",
            "2 tablespoons margarine",
            "1 cup all-purpose flour",
            "¼ cup packed dark brown sugar",
            "1 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "3 tablespoons butter",
            "¾ cup half-and-half cream",
            "¼ cup margarine",
            "¼ cup packed dark brown sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C) Grease a 2 quart baking dish with margarine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, combine sugar, cornstarch, water, and strawberries. Cook over medium heat, stirring constantly, until thick and hot. Pour mixture into the prepared baking dish. Dot with 2 tablespoons margarine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine flour, 1/4 cup brown sugar, baking powder, and salt. Blend in the 3 tablespoons butter. Stir in cream. Mixture should be soft. When you spoon dough onto the berries, it will probably sink to the bottom. Just try to spread as well as you can. Don't worry, it comes out good.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for about 20 to 25 minutes in the preheated oven. When the cobbler is almost done, mix the 1/4 cup margarine and 1/4 cup brown sugar, and heat them in a saucepan or in the microwave (whichever is easier for you). When the topping is heated, brush it on the top of the cobbler and bake for another 5 to 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BAMBOO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.12,
            "ratingCount": 50,
            "itemReviewed": "Strawberry Cobbler II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "323.1 calories",
            "carbohydrateContent": "44.9 g",
            "cholesterolContent": "19.8 mg",
            "fatContent": "15.5 g",
            "fiberContent": "1.7 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "379.2 mg",
            "sugarContent": "29 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-11T17:40:42.593Z",
                "reviewBody": "DELICIOUS!!  I shortened the amount of water after reading the reviews.  OMG, this cobbler was a hit!  The only change I made was LESS WATER.  I started out with 1/4 cup of water, threw in the sugar, cornstarch and fresh strawberries.  I kept the extra water near just in case.  After it all came to a boil, I lowered the heat and let it sit stirring occasionally.  It thickened up in no time so I threw out the rest of the water.  I followed the rest of the recipe and the cobbler was gone within 10 minutes of serving it.  My neighbor even took half of it home to share with his family because he loved it so much.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2Eat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3562682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-19T20:45:19.623Z",
                "reviewBody": "This combination of your basic ingredients was deceptively wonderful. While making it I told my husband I didn't think it would taste very good because there was no spice (like cinnamon) in it just flour sugar and butter... not even lemon! I was getting frustrated because the recipe wasn't specific in the cooking time of the berry sauce and I wasn't sure what consistency it should come out at. My sauce got to a point where it was bubbling but no longer getting thick. I also wasn't sure exactly what \"dot with margarine\" meant. I ended up slicing bits of margargine up and dropping on top of the hot berry sauce... that was how I interpreted that term. I thought the batter was going to be the worst but as my husband says: \"the cake is what makes this recipe!\" I think the texture of the cake was perfect and I really loved how that brown sugar and maragarine glaze came out. The fresh strawberries had a tonne of flavour it was amazing! If you are planning on having some cobbbler left over try not to over thicken the berry sauce... it reheats double as thick (tastes just as good though). In the end I'd say I don't think there is much you can do to goof this one up. Thanks for this strawberry recipe which is now hubby's favourite cobbler!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MinxyBaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-24T15:02:57.72Z",
                "reviewBody": "This would be less runny if the strawberries weren't cooked first and the water was omitted. Unlike other fruit cobblers I don't cook strawberries on the stove but simply combine the raw berries with other filling ingredients in a baking dish top with sweet biscuit dough and bake. Easier and less pots to wash too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1455306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-12T21:23:28.59Z",
                "reviewBody": "I used fresh strawberries and made the strawberry mixture a day ahead. If you're going to do this it saves time but don't add the water. The sugar brings out the juice in the berries and creates its own \"soup\" as you've seen with strawberry shortcake. It does take longer to cook than the recipe indicates. It cooked for 45 minutes and was still a little under-done. Tasted good though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MADAHARI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/50414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T20:57:40.623Z",
                "reviewBody": "This is dynamite. I also made it with cherries and it was fantastic. I add a tbl. of cinnamon to the crust and another to the glaze. In addition I reduced the water for the fruit because it was a bit too watery (to 2/3 cup) and increased the cornstarch (to 1-1/2 tbl.). Serve with fresh whipped cream and you are in heaven!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TODDINHB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/561638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-30T23:07:50.437Z",
                "reviewBody": "Well the taste is good but it's sooo runny. I have made it twice and both times I ended up with a strawberry soup. A yummy soup but not a cobbler! I am not sure what I could have done differently I even added extra corn starch last time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Season Moore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1235033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-29T02:42:44.877Z",
                "reviewBody": "I was in search of a southern strawberry cobbler like the little place up the road made. This one hit the spot!!! This is my new favorite dessert dish. I used a pyrex glass pan to make this dish in. I of course did as others suggested. I used 3 cases of strawberries which was approx. 6 cups of strawberries. I added a little bit extra sugar because of the extra ammount of strawberries so I say it was probably about 3/4 cup. I added what one reviewer stated 1 1/2 TBSP of cornstarch although I will probably add 2 TBSP next time. I did not cook the strawberry mixture and I left out the water as it was perfect the way it was. I did take the 2 TBSP butter and cut off little pieces to place through out the strawberry mixture once in the pan. I thought the dough mixture was just perfect with the ammount though. I baked it for longer which I thought was very helpful! I baked it for about 40 mins. I then made the brown sugar mixture which I added a little bit of cinnamon and vanilla for flavor...just a splash of each. I brushed the brown sugar mixture over top of it all. Then I baked for close to 20 more mins. Any longer and I think it would have burned but it cooked the dough part enough to make it non cake like. Through and through it was excellent and I will be enjoying this recipe for a long long time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1745378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T20:57:47.03Z",
                "reviewBody": "Wow this was AWESOME! I used 5 cups of strawberries and just about doubled the dough. This fit perfectly in the 2 quart baking dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NATES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T20:57:42.263Z",
                "reviewBody": "This cobbler is definetly very tasty!! I used 5 to 6 cups of strawberries and I made a half more of the biscuit mixture. If I were to make it again I would add more cornstarch and maybe a little less water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUSSONMELISSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/569224/"
                }
            }
        ]
    }
]