[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/705/world-cuisine/european/uk-and-ireland/english/",
                    "name": "English",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12625/banoffee/",
        "name": "Banoffee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1430092.jpg",
            "width": 1920,
            "height": 1440
        },
        "datePublished": "1999-08-16T14:16:59.000Z",
        "description": "I heard about this pie in England, and be sure it's a wonderful one.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "1 ½ cups graham cracker crumbs",
            "1 cup butter",
            "½ cup white sugar",
            "3 teaspoons ground ginger",
            "1 (14 ounce) can sweetened condensed milk",
            "2 bananas, sliced",
            "2 cups heavy whipping cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix graham cracker crumbs, sugar, melted butter or margarine, and ginger until well blended . Press mixture into a 9 inch pie plate. Cool in refrigerator.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a sauce pan, boil an unopened can of sweetened condensed milk for 3 hours. Monitor the water closely, to make sure there is always water in the pan. Remove can from heat and let cool for 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Open can and pour toffee into pie crust. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice bananas over toffee.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip 2 cups of cream and spoon it on top of bananas. Refrigerate before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "English"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "English"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Madeleine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.275280898876405,
            "ratingCount": 178,
            "itemReviewed": "Banoffee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "709.6 calories",
            "carbohydrateContent": "60.1 g",
            "cholesterolContent": "159.2 mg",
            "fatContent": "51 g",
            "fiberContent": "1.3 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "31.3 g",
            "servingSize": null,
            "sodiumContent": "344.1 mg",
            "sugarContent": "47.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-25T14:50:06.47Z",
                "reviewBody": "I've made this many times using the condensed milk.  I got a tip from my Irish friend -- you can boil several cans of the milk and then put them back in the cupboard until you are ready to use them.  One time I gave her back is to buy pre-made caramel in the can.  It's called Dulce de Leche and can be found by the Mexican food at your grocery store.  It's exactly the same (according to my friend from Ireland).  You do have to soften the dulce de leche up a bit to make it spreadable - easy to do in the microwave (out of the can of course!).  Just made it last night - great stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ebabysmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1773178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-12T15:36:22.933Z",
                "reviewBody": "Yummy!...Instead of boiling the can of condensed milk I pour 2 cans into a 9 X 13 dish and cover with tin foil, put that into a larger oven dish, fill it with water half way up the 9 X 13, then bake at 300 degrees for 1 and a half hours---makes a wonderful toffee!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Belly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2195199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-22T01:59:30.17Z",
                "reviewBody": "Absolutely AWESOME!!! This is FANTASTIC!! I was worried that one can of condensed milk wouldn't be enough but it was spot-on. (By the way, PLEASE don't worry about the can exploding. I've done it dozens of times, and I've lived to tell the tale... I do, however, make sure that I am around to top up the water as it boils off. Also, be careful when you open the can - the second it is punctured, the boiling hot milk oozes out. I wrap the can and the can-opener in an old towel, thus protecting my hand). Thanks so much, Madeleine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T06:08:00.233Z",
                "reviewBody": "Definitely put the bananas under the caramel.  Also on  top of the whipped cream you can sprinkle finely grated chocolate, or instant coffee granules and cocoa.  The first time I had it in England, it came with the coffee dusting, and that's the way I'll always remember it best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/619053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T06:06:05.373Z",
                "reviewBody": "Very good pie. I made a few changes though: I made a graham cracker crust (but I unfortunately forgot to put ginger in it) I boiled two 14-ounce can sweetened condensed milk for about 2 3/4 hours. Let stand them for 10 minutes and poured them into a medium bowl stirred with a fork to make a more spreadable consistency and poured half of the \"toffee\" into the bottom of the crust. I garnished the toffeed pie with thinly sliced bananas (about 1/4 inch) dipped in lemon juice and poured remaining toffee onto bananas. Not oversweet as I feared it would be. As another reviewer suggested I flipped cans at mid-boiling time. Very easy but very good and can easily be served for company. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IVANDIEPART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/805237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T06:07:25.827Z",
                "reviewBody": "Of the recipes I've found, this one came closest to the Banoffi I had at the Shack Restaurant in Dublin, Ireland.  My friends agreed.\r\n\r\nDespite my friend Andy's fear, the can of condensed milk did NOT explode.  But I was careful to keep enough water in the pot. \r\n\r\nI used 1/2 cup of butter as suggested by the last reviewer and this worked very well.  I also used 3 bananas instead of 2 and added about 2 teaspoons of sugar and 1 teaspoon of vanilla to the whipped cream.  Next time I might try a deeper dish pie and add even MORE bananas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLIEKAT18",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/463055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-12T18:16:26.23Z",
                "reviewBody": "I had been searching for a recipe for Banoffee for a while. When I was in England in 2001 nearly every restaurant had some kind of dessert with this flavor whether it be ice cream pie cake etc. It's such a good combination and this recipe is no exception. You have to follow the recipe for the crust because the ginger makes the crust. I took this to several gatherings of family and friends and it is always well received. It is different but not so different that people won't try it. I was nervous about boiling the can too but I've done it now at least 3 times with no explosions so it's fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EENISSLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1257043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-26T00:22:07.61Z",
                "reviewBody": "okay first of all I cut down on the butter quite a bit. Only used abt 1/2 cup that I melted in the pie plate in the oven. Then I added the crumbs with the sugar and mixed it all in and pressed it gently to cover bottom. I omitted the ginger as I don't like it much. I baked the crust in a 375 oven for a few minutes just to dry it a bit. Then let it cool. As for the condensed milk I used a 300ml can and the best and easiest way was to boil it in a big sauce pan filled with water so I didn't have to watch it as closely. Only added a bit of water each 1 1\\2 hours. Boiled it for 4 1/2 hours. I let it rest abt 30 mins. Didn't ooze out much cuz it had cooled. It was nice and firm and creamy and brown in color. I thought it may have been overcooked but thank goodness it tasted great! I also added a bit of sugar(1 tbsp) to the whipped cream and shaved chocolate on top. Beautifu looking and my whole family loved it! They said it was really very delicious! Thanks for the recipe. Easy and delish. Worth the wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-06T20:58:23.633Z",
                "reviewBody": "This pie is still popular in the UK (my husband and I traveled to Ireland in August, 2012). After I came home I had to make this for my husband and his all-Irish family. The first one lasted all of about 2 minutes, which was about the time it took to slice it all into about 12 pieces! I think the pie is too sweet, but everyone else I know LOVES it. Here's a GREAT TIP: Make the toffee by emptying out 2 cans of condensed milk into 8-oz. jelly jars (you'll need 3 jars to 2 cans of condensed milk). Fill to within 1/2 to 3/4-inch from the top of the jar. Place clean seals and lids on jars. Place in 6-qt. or larger slow cooker. Add enough water to cover jars completely. Cook on low 8 to 10 hours overnight. Not only will you not have to worry about letting the water get too low and having exploding toffee all over your kitchen, you can check how caramelized the toffee is before you stop cooking (which you can't when you cook it in the can) and add time if you need to, AND you'll have toffee ready for your next pie, because the jars seal themselves during the cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "corinaesq",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-04T19:22:00.103Z",
                "reviewBody": "I think the layer of bananas could be thicker and it's a little rich but it's quite an experience. Though I was really impressed at first over the week I have noticed it's not something I will make again. It's just too much for us only half of us are eating it and slowly at that. Thanks for showing me something different though! Boiling condensed milk is just not my area. I would probably appreciate it more if I were familiar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LouisvilleHugger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/louisvillehugger/"
                }
            }
        ]
    }
]