[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14055/golden-rice-cakes-with-sweet-potato-ginger-sauce/",
        "name": "Golden Rice Cakes with Sweet Potato-Ginger Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4511086.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "1999-08-17T01:05:43.000Z",
        "description": "These rice cakes are absolutely delicious and have crunchy crust with light, moist interiors. The ginger, coconut milk, and sweet potatoes make the sauce absolutely yummy. You can replace the orange juice with water if you like.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 tablespoons canola oil",
            "2 cloves garlic, minced",
            "2 cups dry jasmine rice",
            "2 ½ cups water",
            "1 teaspoon salt",
            "1 sweet potato",
            "1 (14 ounce) can coconut milk",
            "½ cup orange juice",
            "1 tablespoon minced fresh ginger root",
            "salt and pepper to taste",
            "1 carrot, coarsely chopped",
            "½ red bell pepper, chopped",
            "4 green onions, chopped",
            "2 eggs, beaten",
            "2 green onions, thinly sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan with a tight-fitting lid heat 1 tablespoon of the canola oil with the garlic over medium heat for 1 minute, stirring constantly. Add the jasmine rice and stir constantly for 1 minute more. Add the 2-1/2 cups water and 1 teaspoon salt. Bring rice to a boil, then reduce the heat to low, cover the pan, and cook the rice for 15 minutes. Transfer the rice to a large bowl, and let it cool for 15 minutes\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the rice cooks, cut the sweet potato into thirds. Place the pieces in a pot, and cover them with cold water. Bring the potatoes to a boil, and cook them until they are tender, about 20 minutes. Drain and let them cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan bring the coconut milk, the water or orange juice, and the minced ginger almost to a boil, then turn the heat to low and cook for 5 minutes. Remove the pan from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Peel the skin off the cooled sweet potato. Puree the sweet potato flesh with the coconut-ginger liquid in a blender or food processor. Pour the sweet-potato puree back into the saucepan and add salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mince the carrot, the red pepper, and the coarsely chopped scallions in a food processor. Add 1/2 of the jasmine rice and the 2 beaten eggs; run the machine in spurts until the mixture has a mealy consistency. Put this mixture back into the bowl with the rest of the jasmine rice and mix well. Put half of this mixture into a clean bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat two skillets or a large griddle over medium-high heat. Divide the remaining canola oil between the skillets or spread it on the griddle. Divide the rice mixture in each bowl into thirds. Form each of the six parts into a ball then place each ball in a skillet or on the griddle.  Pat the ball down to form a cake about 1 1/2 inches thick. Fry the cakes for 3 to 4 minutes per side, or until they are golden brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the sauce, and ladle it into plates. Place a rice cake on each plate, and top with the finely chopped scallions.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Alison"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9375,
            "ratingCount": 16,
            "itemReviewed": "Golden Rice Cakes with Sweet Potato-Ginger Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "482 calories",
            "carbohydrateContent": "62.3 g",
            "cholesterolContent": "62 mg",
            "fatContent": "22.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "8.7 g",
            "saturatedFatContent": "13.4 g",
            "servingSize": null,
            "sodiumContent": "435.6 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-06-16T16:50:16.543Z",
                "reviewBody": "I think the directions might have been a little misleading towards the end where you separate the rice mixture in half and then into thirds then form each third into balls. I tried this and the balls were way to big and they fell apart. I made them much smaller like the size of a meatball in spaghetti and they came out great. Also I think the first time you make them the recipe is somewhat time consuming but I am sure once you are familiar with it it will be much quicker. However the end result was well worth the time! They were delicious! We all loved them and will make them again. Thanks for the tasty recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COURTNEYSUNSHINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-19T00:39:14.593Z",
                "reviewBody": "( recently updated my rating from the original 4 stars to 5 stars) I give the rating I do only due to the taste and the hopes that others will have better luck with it than I did. I didn't realize until I had already begun the recipe that it required the use of a food processor. So I tediously chopped everything up. I don't have access to Jasmine rice so I use short grain white rice instead. Unfortunately chopping the rice by hand (instead of putting it in the food processer like the recipe calls for) was not possible. As a result my rice cakes would not stick together. I therefore made \"Fried Rice with Sweet Potato Ginger Sauce\" Which as good as it tasted was definately lacking. This is WAY to tedious for me to repeat and if you don't have a food processor I say don't even try! UPDATE: I have made this a few more times -- WITH a food processor. I REALLY love the taste. So as long as you have a food processor and if you REALLY want to impress someone (who is opened minded to trying new foods) this really is an eye pleaser!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pheobe Alverson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/455735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-16T16:49:50.857Z",
                "reviewBody": "I love this recipe! It's very time consuming but I'll make a lot of the sauce and save it in order to cut back on prep time. Delicious. I add hot sauce to the sweet potato sauce to give it a little kick--habenero peppers go really well with the sweet taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nikkiskitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/133779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-01T01:30:10.313Z",
                "reviewBody": "Well I have to say I really didn't follow the directions all that well. I for the most part just threw most of my ingredients in the blender and added that chunky paste to my rice. I did boil my coconut milk and ginger but I had hungry men passing the kitchen acting as if they've never had a meal in their lives. I only added one egg and mixed it all together to make patties but it was kind of messy in the pan. I ended up creating a fried rice topped with pan fried tofu sauteed red peppers red onion cilantro fresh spinach and garlic. I really liked the saltiness of the tofu against the sweet potatoe and ginger. The guys weren't terribly impressed but they gobbled it down. I refridgerated what I didn't fry and thanks to the temperature I was able to make my patties and fried them up for lunch the next day for my neighbor and myself. She loved them. They taste better as golden rice CAKES not fried rice. Overall I enjoyed this recipe and plan to do it again. Maybe I'll follow the directions next time... or maybe I won't. Thank you for such a unique dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lila's kitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2894797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T18:34:00.48Z",
                "reviewBody": "Admittedly I have only prepared the rice cake portion of this dish. I ve used it on several occasions to make a bread base for canapés. I have gotten rather creative with the rice cakes. I ve cooked the rice with stock and have added cheese and hot peppers to the mix. While the instructions are somewhat hard to follow at times it does make a delicious rice cake and one day I plan to try the whole recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ERLONSLADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-02T22:43:06.953Z",
                "reviewBody": "My guests and I enjoyed this recipe. This was the second time I have made these rice cakes. The first time I didn't use a food processor and simply grated the carrots and chopped the onions and peppers finely. I mashed the rice together with the vegetables. This time I used the food processor. Similar texture and I have no preference. The amount of liquid for the rice however is off. The first time I used 4 cups of water since I \"knew\" 2 1/2 was far too low. My cakes were too wet. This time I followed the directions and the rice was so dry the cakes were falling apart. Next time I will try 3 1/4 cups. The other thing I noticed was that the sauce is highly dependnet on the texture of the sweet ptotato. My first one was saucy this time it was quite thick - more like a gravy. The thinner sauce was more appealing to the eye but we ate all of it both times.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LLANKOWSKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/634589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-09T01:16:42.053Z",
                "reviewBody": "Three stars as written four with improvements. I have to confess that I used leftover brown rice cooked in chicken broth instead of jasmine rice with garlic but other than that I followed the recipe closely. I found it to be totally bland and I couldn't get the cakes to stick together while cooking. I even added an extra egg to the mixture. After tasting the first completed cake I added some several dashes of hot sauce and some brown sugar to the sauce which dramatically improved the flavor. If I make these again I will use regular onion instead of green in the rice mix and add a little habanero for a zestier flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs. kosmos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3825395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T23:17:50.75Z",
                "reviewBody": "Really wonderful rice cake. However I made them the size of an ice cream scoop. They fried up nicely and when presented looked very attractive. My sauce was also too thick but extremely tasty. It is a lot of work but well worth the effort. I will make again with a smaller sweet potato so my sauce is not too thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSANNA3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-04T15:52:16.827Z",
                "reviewBody": "The sweet potato ginger sauce is very good but making the rice cakes is just too complicated for the bland end product that results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie Barnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358960/"
                }
            }
        ]
    }
]