[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14049/crispy-chinese-noodles-with-eggplant-and-peanuts/",
        "name": "Crispy Chinese Noodles with Eggplant and Peanuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1619836.jpg",
            "width": 1947,
            "height": 1947
        },
        "datePublished": "1999-08-17T13:45:53.000Z",
        "description": "Chinese noodles are inexpensive to buy and can be found at your local supermarket. These noodles are fantastic! Eggplant, sherry and fresh ginger meld together to create a divine taste.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 medium eggplant, cubed",
            "1 teaspoon salt",
            "16 ounces fresh Chinese wheat noodles",
            "2 tablespoons sherry",
            "1 tablespoon cornstarch",
            "¼ cup red wine vinegar",
            "⅓ cup water",
            "1 tablespoon minced fresh ginger root",
            "1 tablespoon white sugar",
            "2 tablespoons vegetarian fish sauce",
            "2 cups sliced onion",
            "3 tablespoons canola oil",
            "4 cloves garlic, minced",
            "1 red bell pepper, julienned",
            "4 tablespoons chopped, unsalted dry-roasted peanuts",
            "1 tablespoon chopped fresh mint"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the eggplant cubes into a colander. Add the salt and toss well. Let the eggplant drain for 15 minutes, then rinse it lightly with water. Let the eggplant drain again in the colander.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil. Add the noodles and boil them for about 5 minutes, until they are tender. Drain and rinse well with cold water. Let the noodles drain in a colander for at least 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the sherry with the cornstarch in a small bowl. Mix well and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan combine the red wine vinegar, water, ginger, sugar, imitation fish sauce, and onions. Bring the mixture to a boil, turn the heat to low and let the mixture simmer for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, preferably non-stick, heat 1 1/2 tablespoon oil over medium-high heat. Add the eggplant, and cook it for 5 minutes, stirring frequently. Add the garlic and red pepper and cook, stirring occasionally for 5 minutes more or until the eggplant softens. Add both the onion-vinegar mixture and the cornstarch-sherry mixture. Cook for 2 to 3 minutes, stirring occasionally. Keep the mixture warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large non-stick skillet heat the remaining 1 1/2 tablespoons oil over medium-high heat. When the oil begins to smoke, add the noodles, then place two or three plates on top of them so that more surface area will brown. Let the noodles sit over medium-high heat for 5 minutes. When the noodles have developed a golden brown crust on the underside remove the plates, turn the noodles over with a spatula and cook them 5 minutes on the other side. Then take the pan off the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the peanuts to the eggplant mixture, and spoon it onto plates. Divide the noodles into four parts, and place them atop the vegetables and sauce. Sprinkle with mint, if you like, and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Candice"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5454545454545454,
            "ratingCount": 11,
            "itemReviewed": "Crispy Chinese Noodles with Eggplant and Peanuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "557.9 calories",
            "carbohydrateContent": "88.2 g",
            "cholesterolContent": null,
            "fatContent": "16.9 g",
            "fiberContent": "7.1 g",
            "proteinContent": "12.3 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "1309.9 mg",
            "sugarContent": "10.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T17:50:00.687Z",
                "reviewBody": "I cooked this for my family; it was a hit. There were three things I changed that made this dish better for my family. I increased the sauce the amount suggested wasn't enough. I substituted fish sauce with soy sauce Also the noodles are supposed to be pan seared on BOTH sides I only did one side. The wheat nooldes do get nice and crispy with the weight of the dishes on top but two sides of crunch is too much. By frying only one side of the noodles you have a nice soft side which is a good contrast with the crispy side. Thank you to Jen for a delicious unique recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Lombard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-23T18:42:39.73Z",
                "reviewBody": "This dish is absolutely delicious!! I wasn't sure when I saw the combination of ingredients but in my search for great tasting vegetarian recipes I gave it a shot and I am so glad I did! The end result is wonderful. I will say that it is not very kid friendly as 3 of my 4 children wouldn't touch it but my husband and I loved it so it will be a staple in my house from now on. Serving it with the crispy noodles on top makes for a nice presentation so it would be a really nice meal to make for company. Thank you for the excellent recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEAHZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/726172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T17:56:56.45Z",
                "reviewBody": "I too LOVE this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Abby M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-27T14:33:20.14Z",
                "reviewBody": "I don't know about this one. I do suggest taking the skin off the eggplant before cubing. I felt the red wine vinegar flavor sort of overpowered the whole dish. It is definitely an acquired taste. Boyfriend was less than enthused over this dish. I probably won't attempt this again although it was not a difficult recipe...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LILSPINSTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T20:39:10.533Z",
                "reviewBody": "eggplant_NO WAY!!! the noodle were soggy did not like it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-23T17:56:06Z",
                "reviewBody": "I was really just looking for tips on how to cook noodles I didn't try the rest of the recipe but the sauce looks quite similar to the standard Asian sweet stir fry. For my noodles I used soumen (japanese fettucine) because I had a lot and I wanted a really thin crispy noodle like what you get at Chinese restaurants. I think they worked out really good but would have been better if they were more dried out. Kinda like old rice for fried rice. So I'm going to let my extra noodles sit in the frig and try it again soon. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fujiq/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T23:03:05.747Z",
                "reviewBody": "At first the flavors of this dish were delightful but after 3-4 bites I realized that the vegetable base needs something. Not sure what. This clearly was written as a vegetarian recipe but if I were to make it a second time (doubtful) I'd add sauteed chicken or pork to give more texture to the vegetables. I loved making the crispy noodles. Hadn't done that before. I learned a few things and am confident that next time I could improve on my technique. It was a fun recipe to try; it used up some Asian eggplants that are growing prolifically in my garden and it gave me an opportunity to try something new. Thanks for contributing it Jen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-04T21:16:34.897Z",
                "reviewBody": "When I first read this recipe I was intrigued by the mixture of ingredients in the sauce. Too many strong flavors! Nothing really blended. You would get sherry in one bite vinegar in the next fish sauce in yet another. I make many Chinese dishes and this was easy but the measurements required too many utensils. Cups plus measuring spoons for almost each of the ingredients. Wierd. Once assembled the vegetables were soggy. I really don't have any suggestions to make this better. Pass on this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Nala",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3526593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-16T01:35:18.243Z",
                "reviewBody": "Based on the other reviews I suspected I'd need more sauce & less red wine vinegar. Conveniently I had no red wine vinegar so I used cooking rice wine. I've found that when I cook eggplant I need to cook it a lot longer than the recipe calls for and add a few cups of water along the way. I did that. I also added shrimp at the time of combining all the ingredients. It seemed to need something at the end so I tossed in a healthy amount of extra sherry & soy sauce to good effect. I did not use peanuts as they didn't seem a match. I am not a big noodle fan but when I tasted it I knew it needed crispy noodles so I made them using the mung bean noodles I had on hand. Next time I'll use a little less ginger & some cayenne.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MonkeyGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4089897/"
                }
            }
        ]
    }
]