[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10432/double-chocolate-biscotti/",
        "name": "Double Chocolate Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F582756.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1998-01-31T17:35:18.000Z",
        "description": "A crisp, not too sweet chocolate cookie. Wonderful with coffee. Stores very well.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "½ cup butter, softened",
            "⅔ cup white sugar",
            "¼ cup unsweetened cocoa powder",
            "2 teaspoons baking powder",
            "2 eggs",
            "1 ¾ cups all-purpose flour",
            "4 (1 ounce) squares white chocolate, chopped",
            "¾ cup semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, cream butter and sugar with an electric mixer until light and fluffy.  Gradually beat in cocoa and baking powder. Beat for 2 minutes. Beat in the eggs one at a time. Stir in flour by hand. Mix in white chocolate and chocolate chips. Cover dough, and chill for about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Divide dough into two parts, and roll each part into a 9 inch long log. Place logs on lightly greased cookie sheet, about 4 inches apart. Flatten slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes, or until toothpick inserted in center comes out clean. Cool on cookie sheet for 5 minutes, then carefully transfer to a wire rack to cool for one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut each loaf into 1/2 inch wide diagonal slices. Place slices on an ungreased cookie sheet, and bake at 325 degrees F ( 165 degrees C) for 9 minutes. Turn cookies over, and bake for 7 to 9 minutes. Cool completely, then store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Janet Allen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542772861356932,
            "ratingCount": 339,
            "itemReviewed": "Double Chocolate Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "98.8 calories",
            "carbohydrateContent": "12.7 g",
            "cholesterolContent": "17.8 mg",
            "fatContent": "5.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "53 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-04T07:13:29.58Z",
                "reviewBody": "I have been making this recipe for the past 3 or 4 Christmases - family and friend just LOVE them.  However, I too have had the problem others describe with crumbly cookies.  I've tried all sorts of things to avoid it and nothing has worked... until today.  I make several other biscotti recipes and noticed this year that this recipe calls for double the amount of baking powder.  So I made my last batch of these cookies with half the baking powder.  VOILA!!  Perfect cookies!!  Give it a try.  Great recipe.  By the way, I've made this recipe with all sorts of different types of chocolate and nuts - all great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/amyhug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-21T16:46:31.877Z",
                "reviewBody": "Very impressive cookie! I made this for gifts at Christmas for teachers and friends, (along with a home made cappuccino mix.)  It received rave reviews.  Personally, I thought it was a bit too sweet with all the chocolate chunks, so I would reduce them slightly next time. I also tried replacing some chunks with Whole unblanched almonds and it made for a very pretty cookie with the contrasting light nuts and white chocolate in the dark cookie dough. I'll make this again and again!  Definately wait the hour (even a half hour) to cut these before the second bake.  Cutting them while hot will guarantee a crumbly mess. AND you must use a very good, very sharp knife.  It makes a huge difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brigette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1590000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T21:13:59.147Z",
                "reviewBody": "This recipe was my first try at making biscotti. Everyone loved these.  I really didn't know what to expect.  I kept reading reviews about it being difficult to cut them for the second baking.  They are a little fragile, but with the right knife, they are not hard to do at all.  The first time I made them was kind of trial by error, but they are not hard just a little time consuming.  Like making bread.  I found that shaping the batter was easy to do if you wrap it in waxed paper, then you can push and flatten without a mess.  I used a ruler to make sure I had the proper size for baking, so that on the second baking they would be crisp and dry as they should be.  All in all, my family and friends loved them.  You need a little extra time to make them, but they are worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYCHRIS9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-13T23:07:48.747Z",
                "reviewBody": "My mom makes biscotti for me every Christmas.  When I ran out I thought I should try making some myself.  I did a search for chocolate biscotti in allrecipes and this one appealed to me the most.  I didn't have white chocolate squares and used about 1/3 cup white chips instead.  They are a really nice contrast against the dark biscotti.  I baked mine at 350 instead of 375 for twenty minutes.  I also sliced mine after only cooling for 15 minutes (I might only wait 10 minutes next time as the longer you wait the more crumbly they are).  I then baked the slices at 325 for only 5 minutes per side.  They are perfect.  Great for dunking in tea.  My kids aren't fans of biscotti as biscotti really needs dunking but I let them have the ends of the logs after the first baking.  They liked them like that (they said they tasted like brownies).  My dad says he enjoys these more than my mom's.  Sorry mom - I still want some of yours next Christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAUREENSKITCHEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T15:36:25.42Z",
                "reviewBody": "Excellent! First try at Biscotti baking and this was not only good but easy. I substituted white chips for the white chocolate and it worked out just great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RENATE53",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/877895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-24T06:47:44.047Z",
                "reviewBody": "Absolutely delicious. I love the fact that these can made for like 5% of what biscotti costs in coffee houses. Speaking of coffee houses if you want your biscotti as crispy as it is at coffee houses definitely go for the 25 minutes. I pulled em out right at 20 when the toothpick first came out clean and then had to add extra time in the second bake. They still aren't quite as crispy as coffee house biscotti but they're still absolutely delicious. Who would have ever guessed that biscotti could be so easy to make at home?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daniel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1690071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-04T06:19:55.75Z",
                "reviewBody": "Baked up very nicely. For the second baking I left them in for the specified time then turned the oven off and left them in for about another 15 minutes. Crisp beautiful cookies. Very elegant desert served in a fancy glass with a scoop of vanilla ice cream and two cookies! A HUGE winner!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Beek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/121306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T18:01:56.53Z",
                "reviewBody": "I thought this was very good, though I preffered the coconut walnut biscotti better (just preference), but thought this recipe was still worth 5 stars.  As for texture, sometimes you need to ignore the recipe and go with what feels right.  I had to adjust the flour to get the consistency right.  If you've never made biscotti before, to form it into a log it should be firm but not crumbly.  Yet, it definietly  shouldn't stick to your fingers.  I preferred to dip this biscotti in chocolate (did both dark and white) to give it an extra sweetness.  Tip: Use a ruler to help shape the biscotti: use the flat side of a normal 12 inch ruler and \"scrape\" the biscotti into shape on a flat (preferably cold) countertop. This way you can tell just how thick and how flat the biscotti is; if that made any sense.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zuperbre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/848275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-24T06:17:47.483Z",
                "reviewBody": "Yummo! This is the first biscotti recipe I have made and I am very pleased with the results. I think this batch tastes better than any I've ever bought. Prior to choosing this particular recipe I reviewed MANY biscotti recipes online. I made a couple of changes based on other recipes suggested changes and high reviews. Instead of allowing the loaves to cool for one hour prior to slicing I cut them after only 15 min of cooling. Also I put them back in the oven for 10 minutes on each side instead of 5. I like my biscotti very crispy and these are perfect! They are delicious and I can't wait to share them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jkwilbanks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2824847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-24T15:35:14.45Z",
                "reviewBody": "I've been making biscotti for years but wanted chocolate biscotti this year and thought I'd try these. These are flavorless - I was so disappointed. Definitely needs more cocoa or something! Dipping them in chocolate didn't help either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "GWILSONMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512421/"
                }
            }
        ]
    }
]