[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8447/chocolate-hazelnut-cake/",
        "name": "Chocolate Hazelnut Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F113207.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-08-18T20:26:54.000Z",
        "description": "I created this cake for my son's birthday and it was a big hit. If you like hazelnuts and chocolate, this is THE cake!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 layer, 9 inch round cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package devil's food cake mix",
            "1 (3.9 ounce) package instant chocolate pudding mix",
            "1 teaspoon vanilla extract",
            "¼ cup water",
            "3 cups heavy whipping cream",
            "1 ½ cups semisweet chocolate chips",
            "1 cup finely chopped toasted hazelnuts",
            "12 hazelnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare cake mix according to package directions, using required ingredients, plus pudding mix, vanilla, and an additional 1/4 cup of water. Spread batter evenly among three greased and floured 9 inch cake pans. Bake at temperature specified on cake mix box for 18 to 22 minutes, or until a toothpick inserted in the center comes out clean. Let cakes cool completely, then chill in refrigerator for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a double boiler over simmering water, melt chocolate chips. Gradually add 1/4 cup of the whipping cream, stirring constantly until smooth. Remove from heat and let cool to room temperature. Beat 3/4 cup of whipping cream until soft peaks form. Fold the whipped cream into the cooled chocolate mixture. Stir in 1/2 cup of the finely chopped hazelnuts. Chill 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat remaining 2 cups of whipping cream until soft peaks form, then fold in the remaining 1/2 cup of chopped hazelnuts. Chill until ready to frost cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1 cake layer on cake plate. Spread 1/2 of the chilled chocolate mixture over top. Add another cake layer. Spread with other 1/2 of chocolate mixture. Top with last cake layer. Frost entire cake with hazelnut-whipped cream. Place 12 whole hazelnuts around top outer edge of cake as a garnish. This cake should be kept in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kendra Clouston"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.648648648648648,
            "ratingCount": 37,
            "itemReviewed": "Chocolate Hazelnut Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "201.3 calories",
            "carbohydrateContent": "18.4 g",
            "cholesterolContent": "30 mg",
            "fatContent": "13.9 g",
            "fiberContent": "1 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "157.3 mg",
            "sugarContent": "12.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-03T18:06:38.153Z",
                "reviewBody": "Delicious! I made this cake for my birthday and my husband and I both really enjoyed it. I used Cool Whip instead of whipping cream. I only used real whipping cream for the 1/4 cup you mix into the melted chocolate chips. The only thing I would change next time would be to use fewer chocolate chips. It was a bit too heavy in the stomach as is. Next time I'd reduce the chocolate chips to maybe 1 cup or 3/4 cup instead of 1.5 cups. Other than that a beautiful and delicious cake. I'll be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ESSJAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697274/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-16T03:21:19.327Z",
                "reviewBody": "This cake was absolutely exquisite. Everything about this cake was delectable. I particularly enjoyed that this wonderfully chocolate cake was not too heavy. Like another reviewer mentioned -- I recommend letting your cream warm to room temperature before adding it to the chocolate -- or simply heat it in the microwave for a few seconds to warm. This will prevent the chocolate from seizing. One other note when I chilled the filling for 30 minutes it was way too stiff to spread -- but maybe my refrigerator was too cold. In any case I would skip that step next time. All in all this was a wonderful recipe and I received nothing but rave reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mingry77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2193755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-07T00:11:17.247Z",
                "reviewBody": "This is a great idea for a cake-mix cake - although I would suggest making the devil's food cake mix to the specifications listed under the \"too much chocolate cake\" recipe on this site - it uses more oil and some sour cream and insures that the cake will stay moist! Hazelnuts are kind-of pricey and this was a tester cake so I used toasted almonds instead. For frosting I looked at the \"cool whipped frosting\" recipe from this site but used 8 oz. of fresh cream instead of Cool Whip. I also would recommend if using that frosting recipe that you only use HALF the amount of the pudding mix and that you buy instant WHITE CHOCOLATE pudding rather than vanilla. The vanilla gave my cake a yellow-ish tint that I did not like...next time I will use a classic white buttercream with this cake instead....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nico's Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2872162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T18:06:47.56Z",
                "reviewBody": "amazing amazing amazing! I substituted almonds for the hazelnuts and took it to a dinner party... everyone loved it and a few didn't believe it hadn't come from a bakery. this cake is going into my regular rotation! thanks kendra.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIEBELUNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-11T22:15:41.12Z",
                "reviewBody": "Delicious cake! I only had two 9\" cake pans so I made a 2- instead of 3-layer cake so the extra filling I spread on top of the cake before frosting it. I didn't have any problem with letting the filling chill completely before spreading it as some reviewers mentioned. Also be aware that if you make the frosting as written (NOT with Cool Whip) it won't be sweet just creamy/nutty. It can be a nice touch to offset all the sweetness of the cake and filling but just be aware of that. Taste a little while you're whipping the cream and if you don't like it as is add a pinch or two of white sugar until it's just sweet enough. I left mine as is and feel it's a nice contrast especially since I don't like super-sweet frostings but it also would have been good with a small pinch of sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsJPS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2629435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-21T04:44:45.64Z",
                "reviewBody": "This was a wonderful cake! Wasn't too hard to make and turned out perfect the first time. Instead of using the whipping cream for the topping I folded a teaspoon of almond extract into a tub of Cool Whip with the chopped nuts and it was delicious. One tip is to warm the whipping cream to room temperature before wisking it into the melted chocolate chips (wisking very fast and adding the cream very slowly) this helped keep it smooth. Adding the cream while it was cold made the chocolate sieze up a little and made more of a ganache than a smooth mixture. However I still crumbled it into the whipped cream and got gooey chocolate bits inside the cream...... YUM! I almost liked it better that way than when I got it right with the second cake!;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joesgirljeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1219756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-17T21:15:45.81Z",
                "reviewBody": "Looking for a way to \"jazz\" up a chocolate cake mix? This was delicious. Instead of using the hazelnuts whipping cream (which sounds wonderful) I used the \"Fluffy Creamy Icing\" found on this site. Tasted great and there were no leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BIZZYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/382801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-13T18:13:08.183Z",
                "reviewBody": "I made this cake for a family dinner and it's the only time a whole cake has been eaten before the end of the day. I usually take a bunch of leftovers home but not this time. I did add some Nutella to the filling mixture but it really didnt need it. I will definately be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Branlaadee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3041950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T21:24:05.033Z",
                "reviewBody": "I was really excited to make this cake for my sister's birthday. I was confident that it would be delicious since it had so many great reviews. I was completely disappointed.The cake was bland and the whipped cream frosting was tasteless.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "natty the pattie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3226721/"
                }
            }
        ]
    }
]