[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12651/chicken-biscuit-pie/",
        "name": "Chicken Biscuit Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F211668.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1999-09-07T23:39:03.000Z",
        "description": "This is a favorite of my family. I double it because I have hungry teenagers! Make your own biscuits or use pre-made refrigerated biscuits.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "⅓ cup butter",
            "1 onion, chopped",
            "⅓ cup all-purpose flour",
            "1 ½ cups chicken broth",
            "⅔ cup milk",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 cup frozen green peas",
            "1 cup frozen diced carrots",
            "2 cups cooked, shredded chicken meat",
            "2 cups all-purpose flour",
            "2 ½ teaspoons baking powder",
            "¾ teaspoon salt",
            "5 tablespoons shortening",
            "¾ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Butter a 2-quart casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, saute chopped onion in the butter. Stir in flour and cook for 1 minute. Add chicken broth and milk. Heat to boiling, stirring constantly. Reduce heat to medium and cook and stir for 2 minutes more. Season with salt and pepper. Add frozen peas and carrots and cooked chicken. Pour into prepared casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together 2 cups flour, baking powder, and 3/4 teaspoon salt. Cut in shortening until mixture is crumbly. Stir in milk just until dough is moistened, then drop by spoonfuls onto chicken mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 450 degrees F (230 degrees C) for 12 to 15 minutes, or until biscuits are golden brown, and cooked on the bottom. This tends to bubble over so I place a piece of aluminum foil under the pan to catch the drips.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CSTONEHS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5174825174825175,
            "ratingCount": 429,
            "itemReviewed": "Chicken Biscuit Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "615.3 calories",
            "carbohydrateContent": "57 g",
            "cholesterolContent": "85.7 mg",
            "fatContent": "29.7 g",
            "fiberContent": "4.1 g",
            "proteinContent": "29.3 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "1264.4 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-29T23:28:08.993Z",
                "reviewBody": "I gave this recipe 4 stars but with a few changes it is a 5. I am the kitchen manager for a rescue mission and have to feed alot of people on a small budget. And this dish is definetly a low cost meal that delivers big results. Here are the changes I made - first I sauteed together chopped onions, celery & carrots - which is called a mirepoix. Then I added the flour and then milk with some chicken stock. To this I added additional seasoning - garlic powder, thyme, rosemary, and sage. Then I added canned vegetables and canned chicken. Of course fresh would be better - but I use what comes in the back door - so we get alot of canned items. The consistency is like thick gravy. Then I poured this mixture into my pans. I have a bakery mix that is much like Bisquick I used to make the biscuit mixture. In reading the other reviews I noticed that the same issue kept coming up - the biscuits were done on top but still gooey/runny on the bottom. So I made my biscuit mixture a little on the \"sloppy\" side - not runny like pancake batter - and not doughy like biscuit dough - but somewhere in the middle- \"gloppy\". Then I spooned the biscuit batter on top of the chicken mixture in spoonfuls that left about a inch space around the \"glop\" as the glop will rise and expand as it cooks. It is important to leave a little room around your glops as this allows the biscuits to cook through. I got sloppy with my glops on the last pan and put them too close together and they didn't cook all the way th",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-21T23:31:30.46Z",
                "reviewBody": "This recipe is excellent and was just what I was looking for -- I had no wish to use \"whack-em-on-the-counter\" biscuits like so many other recipes call for, and I didn't want to use pie dough. For those folks who had problems with the biscuits not being cooked on the bottom: prepare the biscuit dough BEFORE you make the chicken mixture, and be sure to preheat the oven so it's ready as soon as the chicken mixture is poured into the casserole dish and the biscuit dough is QUICKLY spooned on top.  The point of putting the biscuit dough on the HOT chicken mixture is to start cooking the biscuits immediately, so they don't get soggy on the bottom. This is why dumplings go into HOT stew, and cobbler dough goes onto HOT cooked fruit. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenWitch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-26T23:01:01.03Z",
                "reviewBody": "We love this recipe!  It's a wonderful way to use up leftover chicken.  I use frozen peas, but slice my own carrots and cook them for 5 min. first before adding them to the chicken mixture.  To cut down on preparation time, I used frozen biscuits.  I baked them on a separate pan at 375 degrees for only five minutes and then put them on the hot chicken mixture and baked at 425 degrees for 12 minutes.  Everything was perfect!  If you feel the biscuits are getting a little too brown, cover the dish with aluminum foil.  I served this with a mixed greens salad.  Fast, easy, and comforting with ingredients one generally has on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARMICHEAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-10T17:17:59.88Z",
                "reviewBody": "Definitely a go-to recipe for leftover chicken. I do make some changes though: -I times it by 1.5 (x2 would be fine too) and put it in a 13x9 dish -I use 1/2 butter 1/2 olive oil (but I don't think you need to use as much as the recipe suggests) -I add thyme sage rosemary and use white pepper vs. black and next time I'll try garlic like one reviewer suggested. -I use frozen mixed veggies. -I use my own Betty Crocker baking powder biscuit recipe cut out place on top and bake @ 375 for 40 minutes--comes out perfect every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2419326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-18T20:27:26.577Z",
                "reviewBody": "This is the best chicken pie recipe I have ever tried. I substitute Bisquick for the topping (for time's sake). I have also topped it with a pie crust instead of the biscuits. It tastes great both ways.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaime",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1870571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-02T23:05:42.47Z",
                "reviewBody": "I preheated the oven at 450 degrees first, prepared the biscuit dough before I made the chicken mixture. I used fresh buttermilk and cold butter for the biscuit dough. I used half butter instead of all butter, low-sodium chicken broth and half-n-half milk for the chicken mixture. I use frozen peas with pearl onions, added diced celery, 1 medium orange, yellow and purple sweet carrots diced. For seasoning I added 1tsp of poultry seasoning, 1 garlic clove, chopped, fresh rosemary, fresh ground black pepper and Hawaiian sea salt.  As soon as I made the biscuit dough I quickly spooned them on top the HOT chicken mixture to start cooking the biscuits immediately. This helps avoid any soggy biscuits on the bottom. I had 12 biscuits spaced about 1 inch apart. I used a 13x9 dish and covered the dish with aluminum foil. I baked the chicken at 375 degrees for 30 minutes, turned off the oven, uncover the foil from pan, brushed the tops of biscuits with melted butter for a golden crust and left the mixture for 10 minutes before removing. The gravy was thick, creamy and savory! The chicken was tender and vegetables cooked just right. The biscuits were not soggy but golden brown, flaky and delicious. They rose and expanded while baking up almost touching each other. I served this chicken biscuit pie over a small mound of, “Creamy Smashed Potatoes,” also from this website. This is a true comfort food-very hearty, tasty and fulfilling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-30T09:52:22.967Z",
                "reviewBody": "This was pretty good. I think the temp of the oven was too high though. 450 over browned the biscuits on top and left them slightly gooey on bottom. I had to put back in the oven after the suggested amount of time. Would probably lower the temp to 350 and bake longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Grumpy's Honeybunch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grumpys_honeybunch/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T19:31:04.583Z",
                "reviewBody": "Simple and good.  I used leftover turkey and added poultry seasoning.  Baked at 450F for 15 minutes, then left the mixture for another 15 minutes in the hot oven with the oven off and the door open before serving.  The biscuits were cooked through.  Will double the recipe next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/elle1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T05:33:44.373Z",
                "reviewBody": "I loved how this came out thick and very savory! I used flaky buttermilk biscuits from the store to save a little time and it worked wonderfully. I also did not have an onion so I simply skipped it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aislynm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4240374/"
                }
            }
        ]
    }
]