[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2268/main-dish/savory-pies/pot-pie/",
                    "name": "Pot Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16181/main-dish/savory-pies/pot-pie/chicken-pot-pie/",
                    "name": "Chicken Pot Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12659/chicken-pot-pie-iii/",
        "name": "Chicken Pot Pie III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5895587.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "1999-09-08T00:18:18.000Z",
        "description": "A hot hearty chicken pot pie that is easy to fix.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "1 recipe pastry for a 9 inch double crust pie",
            "2 cups frozen mixed vegetables",
            "2 boneless, skinless chicken breast halves, boiled",
            "1 teaspoon dried thyme",
            "½ (10.75 ounce) can  condensed cream of celery soup",
            "1 (10.75 ounce) can  condensed cream of potato soup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Line a 9 inch pie dish with pastry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blanch frozen mixed vegetables for 3 to 4 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dice chicken and place in a large bowl.  Add vegetables, thyme, celery soup and potato soup. Stir together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour filling into pastry lined pie dish. Arrange top layer of pie crust, seal and flute the edges. Cut slits in the top of the crust to allow for steam to escape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pie on cookie sheet. Put aluminum foil around the pie crust edges. Bake at 400 degrees F (200 degrees C) for 30 minutes.  Remove foil and continue to bake for an additional 30 minutes until golden brown. Remove from oven and let stand for 5 minutes and then serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Pot Pie Recipes",
            "Chicken Pot Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Leslie Brown"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.567434210526316,
            "ratingCount": 608,
            "itemReviewed": "Chicken Pot Pie III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "345.8 calories",
            "carbohydrateContent": "32 g",
            "cholesterolContent": "24.2 mg",
            "fatContent": "18.7 g",
            "fiberContent": "4.1 g",
            "proteinContent": "12.5 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "657.2 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-13T13:13:48.337Z",
                "reviewBody": "This is so amazingly good. My husband said it was the best thing I ever made, and he is a tough critic.  I think he thinks I made the crust from scratch but I used the pillsbury ready made crust in the long red box, it was so good.   I also used both of the cans of soup and half of the thyme and did not put the cookie sheet under it when baking per another reviewer and the crust was perfect.   Even my ten year old said how much he loved it, and had leftovers later that night for a snack and I don't think he has ever done that willlingly!  I have been coming on this sight for two years and I have tried many recipes, some good, some not so good and some really good that made it into my recipe box but this is the first one that prompted me to write a review!  Three of us ate the whole thing in one night.  I have been on a quest to find good recipes that stand the test of time to hand down to my kids and this will make the cut for sure! Thanks so much for posting it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMLESNAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1372841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T23:06:40.657Z",
                "reviewBody": "Thank you for a GREAT starter recipe!  Like others have said, my Hubby doesn't like pot pies, but he liked this one!  I did tweak it ... two full cans - one mushroom and one potato (I HATE celery!) - garlic powder, and I didn't blanch the veggies.  Oh, and in the spirit of being someone too lazy to blanch veggies, I also used canned chicken - one 13 oz from a warehouse store.  (Told Hubby it was boiled, and then he thought it was really good!  LOL)  I would suggest you let it sit when you take it out of the oven for at least 5 minutes before cutting ... it will solidify a bit that way.  Really yummy!  Sent it off to a friend in the hospital and they asked for the recipe.  UPDATED:  Thought I would point out an easy way to cover the edges of the pie ... have a square of foil that is big enough to cover the pie, fold it in half, and cut a half circle out ... this will leave just the sides covered.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRUNCHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/442000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-09T15:24:21.367Z",
                "reviewBody": "Thank you for sharing....as most good cooks who have a tendency to add/subtract from recipes, I did too.  But the basics were right here in the original recipe.  I used Marie Collanders Deep dish pie shell (frozen)for the bottom crust and Ritz regular crust for the top crust.  Put an egg wash on the bottom crust before adding the chicken mixture. To recipe I added mushrooms (small can), garlic powder, onion powder, a little Lawry's Seasoned Salt, black pepper.  Covered with top crust and brushed on egg wash.  What a wonderful pie this makes.  Baked 350 degrees for 55 minutes.  Beautiful golden brown, top and bottom.  The basic recipe is so good that you can add whatever your heart desires to it or leave it as it is.  Either way would be DELICIOUS!  This is a keeper, so I threw out all my old recipes.  LOL. Something was not done properly if it didn't turn out as above.  The filling was great....not soggy or runny.  Everything held in place.  I let stand 10 minutes after I removed it from the oven for the filling to settle down before cutting.  This is a no-brainer recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARGIE402",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-19T18:07:48.59Z",
                "reviewBody": "This recipe was very easy and very tasty. I used a Pillsbury crust. My only problem was that by placing the pie dish on a cookie sheet the bottom layer of the crust didn't cook properly and was gooey. Next time I will not put it on cookie sheet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Frazier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-31T16:35:18.973Z",
                "reviewBody": "I did make a lot of minor changes to this but used it as a basic idea especially for the length of cooking time. I used fresh carrots and potatoes cut up into small pieces 1/2 a can each of green beans corn and peas. Also I used the \"veggie pot pie crust\" on this site which was amazing and added great flavor to the pot pie. I also used 2 cans of cream of chicken soup instead since that is what I had but this was AWESOME!! Will be making almost weekly keeps well and is great reheated for lunches. Thanks so much!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NC baking girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2236189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-20T03:16:19.007Z",
                "reviewBody": "My 9-year old said to give this recipe \"six stars!!\"  The only changes I made was to add one can of diced new potatoes, use both cans of soups, reduce the thyme, and add a little garlic salt.  I actually doubled the recipe and froze the second pie for another meal.  Thank you for sharing a great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linnea Wittenburg Bennett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/linnbenn1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-05T23:53:08.503Z",
                "reviewBody": "This was very good--it didn't knock our wool socks off on this chilly November day but it was a quick and hearty meal after a long hike. Honestly I was skeptical about this recipe but it looked so easy to prepare that it begged my attention. (I used to make the Barefoot Contessa's recipe and it took over an hour to prepare!) I prefer boneless chicken thighs in pot pies--the higher fat content retains moisture and flavor. I poached them in chicken broth for some additional flavor a trick I learned from Eating Well. Other times I've used leftover roast chicken. Instead of cream of celery I prefer cream of chicken soup. I use a full can with the full can of cream of potato. At first I thought the thyme was a bit overwhelming but when I reduced the amount I realized I liked it better with the original recipe's full teaspoon. This is even better reheated the next day! Truly great comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara Lazar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-28T21:22:30.657Z",
                "reviewBody": "I have made this for several years. I use cream of chicken in place of the cream of potato. I also add a little (light) sour cream mayo & shredded cheese to the mixture. I also add a little garlic & onion powder to mine. A real hit in our house especially in the winter time!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TNGIRLHERE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1198493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-14T23:41:57.5Z",
                "reviewBody": "Very good recipe..... I used 2 whole cans of soup...1 cream of chicken and 1 cream of celery (my store did not have cream of potato)....1/2teas. thyme and sprinkled in a little garlic powder. It was a huge hit here at our home....no leftovers sadly. Thank you for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1557403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-23T00:56:27.467Z",
                "reviewBody": "I dared myself to make and try this. I will not dare again. Too much MSG!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Harriet Green",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4063695/"
                }
            }
        ]
    }
]