[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17178/chicken-and-wild-rice-casserole/",
        "name": "Chicken and Wild Rice Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3096745.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "1999-09-09T23:03:08.000Z",
        "description": "A creamy chicken, wild rice, and mushroom casserole. This elegant, tasty recipe may be made in advance and baked right before company arrives! It's a real family favorite! Serve with French-style green beans or broccoli, fruit salad and French bread. That's all you need.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "3 pounds bone-in chicken breast halves, with skin",
            "1 cup water",
            "1 cup dry white wine",
            "1 ½ teaspoons salt",
            "1 teaspoon curry powder",
            "1 onion, sliced",
            "1 cup chopped celery",
            "2 (6 ounce) packages long grain and wild rice mix",
            "1 (16 ounce) can sliced mushrooms, drained",
            "1 cup sour cream",
            "1 (10.75 ounce) can  condensed cream of mushroom soup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts in a large pot with water, wine, salt, curry powder, onion, and celery. Cover, and bring to a boil. Reduce heat to low, and simmer for 1 hour. Remove from heat, strain (reserving broth), and refrigerate to cool. Remove chicken meat from bone, and cut into bite size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the rice mix according to package directions. Replace the specified amount of liquid with the same amount of the reserved broth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine the chicken, rice, and mushrooms. Blend in the sour cream and soup. Spoon into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KITKATY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.396396396396397,
            "ratingCount": 111,
            "itemReviewed": "Chicken and Wild Rice Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "385.1 calories",
            "carbohydrateContent": "33.7 g",
            "cholesterolContent": "87.7 mg",
            "fatContent": "10.3 g",
            "fiberContent": "2 g",
            "proteinContent": "33.8 g",
            "saturatedFatContent": "4.4 g",
            "servingSize": null,
            "sodiumContent": "1325.8 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-04T01:11:58.873Z",
                "reviewBody": "We love this recipe and we make it at least once or twice a month! We leave out the white wine, curry powder, and celery for the simple reason that we never have any of those ingredients on hand. I usually cook my wild rice in chicken broth instead of water and it makes the flavor go up 10 notches! I've even used fat-free sour cream and 98% fat-free cream of mushroom soup and cannot tell a difference!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/993141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-15T17:32:24.967Z",
                "reviewBody": "I have been making this recipe for years and even sell it to people as a frozen casserole.  I use twice as much chicken though and use 1 pound of fresh, sliced and sauted in 3 T of butter mushrooms.  I can freeze 2 STUFFED 8 x 8 aluminum pans or 1 STUFFED 9 x 13 pan.  IT feezes SO well and I have NEVER made this for anyone and not been asked for the recipe.  It is an absolute staple in our household.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/96911/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-19T17:48:45.7Z",
                "reviewBody": "I thought this was pretty good...I used boneless breasts, and cannot figure out how you could cook this using only 2 c. of liquid as it calls for (hence, I increased both.)This did work out well to make it ahead of time (last night)and toss it in the oven an hour before I needed it (today.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-23T22:19:08.953Z",
                "reviewBody": "Sorry but I agree with DREAMERSG04 and Kathleen. This dish would make so much more sense separated on the plate as a poached chicken breast some sauteed mushrooms some fresh celery and some rice made with the curry/celery/chicken stock. Sour cream on the side a soup of your choice as a starter. It certainly needs more stock/liquid--the texture of the dish straight out of the oven was poor (dry and crusted on top). I also used less of the seasoning package and it still was quite salty. The taste was good to quite good but the presentation was poor. You couldn't quite tell what the dish was and the yellow cast from the curry gave it a kind of unhealthy yellow/grey cast. I did all the preparation the day before and the baking the next day as I ran out of time. Certainly most suitable for your family at home but I wouldn't take it to a party. Update: Sept 12 07: great news! I tried it as a 'skillet' dinner-- saute sliced onions on medium in a skillet and start rice in a saucepan. Add small cubed chicken pieces to skillet and cover with lid to keep the juices in. Add curry powder and celery (if using) white wine (if using) and stir often. When the rice is almost done add the mushrooms can of condensed soup and sour cream to skillet. Turn the rice into the skillet and gently stir to combine. Simmer about 10 minutes or until desired consistancy. Looks awesome tastes awesome and took only 45 minutes from start to finish. 10 out of 10!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Loafer Patent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/886245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T22:26:26Z",
                "reviewBody": "This recipe is very labor intensive but definitely worth all the hard work! It is by far the yummiest chicken and rice casserole I've ever eaten. The only thing I would suggest is to cover the casserole with tin foil for the first 40 minutes of baking and then remove the foil and bake uncovered for the remaining 20 minutes. I find that if I bake it uncovered for the whole hour the top gets too crunchy and too brown.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4813502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T21:19:03.083Z",
                "reviewBody": "I tried cooking this following the recipe as close as possible, and thought it turned out great!  This is what I did- I put 3 lbs. of chicken in the pan, added 1 cup water and 1 cup Gewurztraminer (white wine) along with the other spices and veggies- ended up with over 4 cups of stock after I strained and removed solids.  More than enough for this recipe, but you could probably add another cup or two because the stock is hella good.   I cooked the rice following the directions from the box, but instead of using water, used the stock.  Rice was killer by itself!  Sauteed mushrooms in butter, then added them to the rice, chicken, sour cream, and soup (I suppose you could add the celery and onions left from the stock, but they're mushy...I didn't).  Then cooked on 325 for 1 hour, covered in foil.  My wife and I gobbled this stuff up like it was going out of style!  Definitely recommend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "justin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5743116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-19T17:48:50.81Z",
                "reviewBody": "Somewhat mixed reviews on this one. I ate the casserole immediately after it was finished and I loved it!! (5 stars). My husband ate it five hours later and thought it was OK (3.5 stars). I took a bite then too and I have to admit it didn't taste as good to me either. So freshly prepared it's great but as leftovers it's a bit less than great. This is relevant because it makes a huge amount! Probably 6 - 8 servings. Small point: to make 12 oz of rice according to my package directions you need 4 cups of liquid (way more than the 2 allowed for in the recipe).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AJAYMC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-17T16:04:16.123Z",
                "reviewBody": "Very tasty dish. Braising the chicken in wine and celery gave it an excellent flavor and kept it moist. Cover the casserole while baking to prevent it drying out. Next time I will use fresh mushrooms and add salt when cooking the rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EVELYN MEYER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/227344/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-24T21:56:40.343Z",
                "reviewBody": "I made some changes: I browned some cubed chicken breast with onion and fresh garlic. Then I added the curry some lemon juice and about half a can of cream of chicken soup to the soup mixture. I also added some garlic salt to the water that my rice was in. Before putting the mixture into the baking dish I added some fresh ground black pepper. Delicious and flavorful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie1271",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/103142/"
                }
            }
        ]
    }
]