[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10488/hearty-breakfast-cookies/",
        "name": "Hearty Breakfast Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5802077.jpg",
            "width": 3264,
            "height": 1836
        },
        "datePublished": "1998-02-07T01:21:30.000Z",
        "description": "These cookies are a delicious and hearty alternative to doughnuts or pastries. Also great to pack in lunches and on trips. Try one with your morning coffee or tea. For a slightly richer treat, use buttermilk in place of the water. Substitute dates for the raisins, if you prefer.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H47M",
        "recipeYield": "2 dozen cookies",
        "recipeIngredient": [
            "½ cup butter, softened",
            "1 cup peanut butter",
            "1 ⅓ cups packed brown sugar",
            "2 teaspoons vanilla extract",
            "2 eggs",
            "⅓ cup water",
            "1 cup all-purpose flour",
            "1 cup whole wheat flour",
            "2 cups quick cooking oats",
            "½ cup wheat germ",
            "1 teaspoon salt",
            "1 teaspoon ground cinnamon",
            "2 teaspoons baking soda",
            "1 cup raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease two baking sheets or line them with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, using an electric mixer, beat together butter, peanut butter, brown sugar, and vanilla until creamy. Beat in eggs and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together flours, oats, wheat germ, salt, cinnamon, and baking soda. Mix into peanut butter mixture. Stir in raisins or dates (see Cook's Note). Drop by ice cream scoopfuls  2 1/2 inches apart on prepared baking sheets. Flatten slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 18 to 20 minutes. Cool on baking sheet for 2 minutes, then transfer to cooling racks. Store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Janet Allen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.524528301886792,
            "ratingCount": 265,
            "itemReviewed": "Hearty Breakfast Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "478 calories",
            "carbohydrateContent": "64.9 g",
            "cholesterolContent": "51.3 mg",
            "fatContent": "21 g",
            "fiberContent": "5.3 g",
            "proteinContent": "12.3 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "578.9 mg",
            "sugarContent": "33.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-06T12:57:16.313Z",
                "reviewBody": "Love this recipe!  I'm sure it was a great recipe as is, but to bump of the \"health factor\" a bit I made some substitutions that worked well. I know that drives some people crazy to change a recipe all around, but if it helps to tweak it, WHY NOT!?  This way there's a healthier version to play with.  Instead of all the butter I only used 1/4 cup of butter and added applesauce.  Then I only used 1 cup of brown sugar.  When I mixed in all the PB etc. I added one big banana too.  I put in 1 and 1/2 cups of raisins because we like them and heated up 1/2 cup apple juice to let the raisins soak in and then I used that \"raisin water\" in place of the water called for in the recipe.  I also added 1/3 cup of ground flax to give it some more good stuff.  We eat them in the afternoon for a healthy snack or when we're running out the door on a busy morning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adrienne Belaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1155018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-20T15:10:36.683Z",
                "reviewBody": "I love these cookies, they're not very sweet and they're good for breakfast or snack.  Don't let the calorie section scare you, I made 27 cookies from one recipe and I used my ice cream scoop and when I measured how much dough the scoop holds it's 1/4 cup (that would make one serving 2 cookies plus like a bite of another cookie, one fills me up just fine).  BUT I make mine healthier and it's moist and holds together well and has to be less calories.  Here's what I did...no butter, add 1 c applesauce (unsweetened), used 1/2 c honey and 1/2 c brown sugar (in place of all the brown sugar), I also used all whole wheat flour and craisins (instead of raisins) - it's sooo good.  If you like a heartier cookie I'd use rolled oats, quick oats make a softer cookie - both are yummy.  If you like crunch in your cookies I think sunflower seeds would be great in them.  They also freeze well, plus I've made them with soy butter for an allergic child, it's a little drier but still good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soifua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/soifua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T03:41:00.653Z",
                "reviewBody": "LOVE IT!!  I'm a full-time mom and full-time student, so meals aren't really a priority in my life.  These are so quick and easy to make, package in servings, throw in the freezer, and pull out in the morning.  Toss some in my backpack and I'm set for the day.  I shortened the baking time to 15 min. so they'd be a bit chewier, and substituted choc. chips for the raisins to get my son to eat them.  I love getting to be a cool mom and letting him eat cookies for breakfast.  Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONSTERMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/436143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T19:12:55.217Z",
                "reviewBody": "I have been searching for just the right \"healthy\" cookie recipe for a long time.  Usually I make \"Ranger cookies\" that have lots of good-for-you fillers but tend to be dry and crumble easily.  This recipe just became my favorite!  I like to bake things with nutritional value but ... really what makes a cookie a cookie is fat and sugar.  A \"health\" cookie made with no fat, honey to sweeten and no eggs honestly isn't very satisfying.  This cookie gives me a real \"cookie fix\" yet is versatile enough to be quite nutritional.  \r\nI used natural peanut butter, substituted 4 egg whites for the 2 eggs (best to buy carton of pure egg whites), added 1/4 cup skim milk powder with the water, used all whole wheat flour (2 cups), and stirred in 1 c raisins, 1/2 cup mini choc chips, 1/2 cup chopped dates, 1 cup chopped walnuts.  The dough is chunky so it helps to flatten it a little (to 1\" thick or so).  Also, I found they only needed about 15 min or less to bake -- they turned out slightly browned with firm tops but inside they were surprisingly \"light\"and soft.  I used a wire wisk to beat the butter mixture and  to add the whites and water.  This may have helped.  I also would try adding dried cranberries, and other nuts & seeds.  \r\nI must say, I liked the results of this recipe so much that I have singlehandedly polished off 1/2 of the cookies in less than a week!   \r\nMay have to change the name to:\r\n \"Hearty Breakfast, Lunch and Dinner Cookies\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARCH103",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/910267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-15T16:04:16.123Z",
                "reviewBody": "I have never felt compelled to rate one of these recipes before but these cookies are the best thing I've found here! I replaced the cinnamon and raisins with chocolate chips and upped the percentage of whole wheat flour to white flour and used buttermilk powder with good results. They freeze fabulously. And...I've gotten several requests for the recipe - one from a mom whose kids don't even believe in anything remotely resembling healthy food! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADORAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-29T19:11:57.547Z",
                "reviewBody": "What a great recipe. I'm a grad student so I don't have a lot of time to cook elaborate meals and I'm a vegetarian so I have to pay attention to protein. This recipe is perfect: easy yummy protein-rich and it produces really filling cookies. I subsituted 1/4 cup of applesauce for half of the butter (to cut down on the fat a little and add some more nutrients) and I also substituted 1/2 cup chocolate chips for half of the raisins and I threw in about 1/3 cup chopped walnuts. It's like trail mix in a cookie. If these freeze well I can see myself making this every two weeks or so and not having to worry about breakfast/lunch all semester. Thanks so much for sharing this. Update: I just have to add these stayed soft and tasted fresh for over two weeks without chilling or freezing. I am so utterly impressed with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lightly salted",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/765081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T13:19:44.013Z",
                "reviewBody": "Excellent breakfast cookies that tasted great and were easy to make.  I kept the batter in the fridge and baked them as I needed them... warm cookies in the morning, mmmmmm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRISHMARIANO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/482698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-06T20:04:27.24Z",
                "reviewBody": "My husband loves to take breakfast to work vs. eating it at home because he gets up so early so I try to get creative. These \"cookies\" are great. They came out very moist and freeze well. Like others I modified the recipe a bit. I cut the recipe in half and used 1/2 c. of brown sugar and 2 Tbsp. of honey. I used whole milk vs. water and 1 c. of all purpose flour. I also used 3/4 c. of oats and 1/2 c. of grape nuts instead of wheat germ. I also added 1/2 c. of chopped peanuts along with the raisins. They baked up very nice and smelled great coming out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-21T03:35:11.263Z",
                "reviewBody": "These cookies are wonderful. I have a hard time getting my 3rd grader to eat breakfast... now I just hand him a big cookie and he is thrilled. I used applesauce in place of all of the butter and ground flax seed in place of the wheat germ. Great recipe. Thank You.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2035979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-02T22:57:05.113Z",
                "reviewBody": "Unfortunately these did not go over well in my house. They were dry and I even added the banana like some suggested. Using a measured scoop mine only made about 20 so maybe they had to bake longer since they were bigger therefore drying out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cooks4forty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cooks4forty/"
                }
            }
        ]
    }
]