[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15008/desserts/specialty-desserts/liqueur-desserts/coffee-liqueur/",
                    "name": "Coffee Liqueur",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8446/chocolate-cavity-maker-cake/",
        "name": "Chocolate Cavity Maker Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535805.jpg",
            "width": 3629,
            "height": 2722
        },
        "datePublished": "1999-09-17T23:57:47.000Z",
        "description": "Chocolate, chocolate, chocolate. This cake is so moist and rich there's absolutely no need for frosting. This cake made me an instant star with my clients. I quickly became known as 'that incredible chocolate cake lady!'",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "1 (18.25 ounce) package dark chocolate cake mix",
            "1 (3.9 ounce) package instant chocolate pudding mix",
            "1 (16 ounce) container sour cream",
            "3 eggs",
            "⅓ cup vegetable oil",
            "½ cup coffee flavored liqueur",
            "2 cups semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cake mix, pudding mix, sour cream, eggs, oil and coffee liqueur. Beat until ingredients are well blended. Fold in chocolate chips. Batter will be thick. Spoon into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour, or until cake springs back when lightly tapped. Cool 10 minutes in pan, then turn out and cool completely on wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Coffee Liqueur"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Caitlin Koch"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.741433021806854,
            "ratingCount": 1605,
            "itemReviewed": "Chocolate Cavity Maker Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "527.6 calories",
            "carbohydrateContent": "66 g",
            "cholesterolContent": "63.2 mg",
            "fatContent": "26.4 g",
            "fiberContent": "3 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "498.5 mg",
            "sugarContent": "46.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-01T14:02:46.75Z",
                "reviewBody": "My boyfriend's mother is supposedly famous for this cake, and the first time I tried the infamous dessert, I laughed silently to myself knowing that I could out her secret and it's ease with a mere link. But I didn't. :)\nI do however serve this cake, and it is one No one can get enough of. I use dark chocolate chunks as opposed to chocolate chips. Try using mini bundt pans, and make sure to dust them with a little cocoa...I prefer Ghirardelli. Serve them drizzled with a liqueur, and don't be afraid to experiment with flavors...this is the kind of dessert you can cater specially to the tastes of your guests. I have used raspberry, hazelnut and creme de menthe liqueurs, all with raving success. Garnish with a couple of mint leaves and you're set. It's so easy it's ridiculous.\n\n*edit* I found these little Andes Mint mini chips at the grocer and used them in place of chocolate chips. Oh my goooood. So moist and minty, it was positively sinful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StephanieM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T03:25:47.797Z",
                "reviewBody": "Absolutely fantastic!  Used a devils food cake box, 1/4 cup Godiva and 1/4 Kamora(just like Kahlua but 1/2 the price!), and only one cup of chocolate chips (mini is best but not essential). Used cocoa to dust the pan, but you can also use a little of the chocolate cake mix if you don't have cocoa. Baked for 60mins. Had leftover chocolate ganache from a cake I made earlier in the week (that was WAY more work and not as good!) so poured that over the top, and it looked stunning! Have been experimenting with different liquors every time I make this - Baileys, Grand Marnier, dark rum...My favorite liquor in this cake so far has been Chambord (raspberry), although Grand Marnier is very good too. FYI: Tia Maria, Kahlua, Kamora and Cafe Ole are all coffee flavored liquors (the last two being the cheapest). Godiva and Creme de Cacao are good for the chocolate flavored liquors.  You could also make this non-alcoholic by using strong brewed coffee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BECALEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/734978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T15:23:44.263Z",
                "reviewBody": "Yes, this is a very rich, sweet, moist, dense cake.  Made this about 4 times and second time decreased chocolate chips to 1 cup, which is plenty sweet and taste better.  I also used 1 cup of Irish cream flavored liquer, which tastes much better and added more flavor.  Have also substituted 2 tablespoon instant espresso powder in place of the liquer and was fantastic.  Espresso really brings out the flavor of chocolate.  Have also used Andes Mint Chocolate baking chips and it was to die for!  Also, use room temp. eggs, which makes cake rise better.  (If in a pinch, soak cold eggs in  very hot tap water for 5 min.) No need for glaze or frosting or this will be too sweet.  Taste best with fresh strawberries/rasberries if available.  If not, dust with powdered sugar and you're good to go.  So easy and taste very homemade!!  **TIP - You can use other cake mix flavors, such as Vanilla, and add the sour cream to make a moist, dense yellow cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T20:58:24.797Z",
                "reviewBody": "Incredible cake! I almost break out in hives at the thought of baking a BOXED cake...but I must give credit where it is due. I tried using one cup of chocolate chips at the suggestion of other reviewers, and it's delicious. I prefer using the full 2 cups of mini chocolate chips though. I think it lends greatly to the gooey consistancy of the cake. Regular chocolate chips look like chips in cake...the minis seem to melt right in. I have also experimented with different liquors such as Kahlua and Godiva but try others for fun too. I think it's great with Bailey's which my husband liked, but when I used my Aramula cream liqueur...he declared it the best chocolate cake in the world. It needs no icing...try a light dusting of powdered sugar for asthetics. Make sure you dust just before serving. This cake is so moist...the powdered sugar is quickly absorbed (and may look less than appealing). Also, make sure you do flour the pan or use baker's joy. Once, I only used oil and the cake didnt fall out as neatly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYASH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T23:41:16.373Z",
                "reviewBody": "This cake is a Chocoholic's Dream! You'd really never know it was a boxed cake - it's that good! It's very dense moist rich and chocolately - what more could you ask for from such a simple recipe! You really don't even need frosting just a dusting of confectioners' sugar which provided a nice contrast and didn't ruin the flavor. I did cut back of the chocolate chips using only 1 cup. Other than that I wouldn't change a thing! This cake is perfect when you don't have time to make a scratch cake but want something that tastes like you did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-28T15:21:46.3Z",
                "reviewBody": "This is very good, but there are nearly identical recipes that are just as good and call for half the sour cream. Why double the sour cream if it doesn't really make the cake any better?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-15T12:58:32.517Z",
                "reviewBody": "Everybody loves this cake - they says its \"to-die-for\" and I get multiple requests for it. I replaced the coffee liquor with chocolate milk. Baked for exactly 1 hour and it turned out delicious and moist. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADIBAX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-10T18:33:51.14Z",
                "reviewBody": "awesome cake!!! moist chocolaty easy as pie (so to speak!) i swapped lite sour cream for the full fat and it is just as rich. i also dust my bundt pan with cocoa which is a nice touch. i've made it with a tray of water in the bottom of the oven and without--without works better. the cake rises up like crazy when it bakes--my boyfriend and i like to watch it cook. it does fall back down to normal size. it's a bit hard to test for doneness with all the melted chocolate chips in it--every time i've baked it for an hour it's turned out perfect. i've made it with baileys and i've made it with kaluha. both are wonderful and get rave reviews. next i plan to make it with an orange liquor. yum diddlie umptious! it needs no glaze or icing--we love it just the way it is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEANNELKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-05T11:26:36.937Z",
                "reviewBody": "This cake is incredible. I have tried for a very long time to find a recipe like this one. It is moist and full of flavour. The first time I baked this cake I followed the recipe exactly and the cake turned out wonderful. The second time I used milk instead of the liquer and topped it with a chocolate ganache glaze since I love a rich chocolate cake. This cake has made the Allrecipe website my favourite one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chocolate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1711366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T12:15:29.83Z",
                "reviewBody": "This cake was just okay for me. I'd say it definitely needs a frosting or a glaze to come close to the expectations raised by the recipe description and reviews. It really just tasted like a souped-up box cake... one with a little something added to it but a box cake nonetheless. I'd give it three stars but after all the ecstatic reviews I was pretty disappointed. I won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "DarkAngel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/208760/"
                }
            }
        ]
    }
]