[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/256/main-dish/meatloaf/",
                    "name": "Meatloaf Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/998/main-dish/meatloaf/beef-meatloaf/",
                    "name": "Beef Meatloaf Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14656/meatloaf-with-fried-onions-and-ranch-seasoning/",
        "name": "Meatloaf with Fried Onions and Ranch Seasoning",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2076460.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "1999-09-22T21:15:58.000Z",
        "description": "This is a recipe I created once I discovered the versatility of meatloaf!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ½ pounds ground beef",
            "2 eggs, beaten",
            "¼ cup ketchup",
            "¾ cup herb-seasoned dry bread stuffing mix",
            "½ (1 ounce) package dry Ranch-style dressing mix",
            "1 (6 ounce) can French-fried onions"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine meat, eggs, ketchup, stuffing mix, ranch dressing mix and fried onions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape into loaf and fit into 9 x 5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, covered loosely with foil, at 350 degrees F (175 degrees C) for 50 to 60 minutes, or until meat is thoroughly cooked.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Meatloaf Recipes",
            "Beef Meatloaf Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stefanie Sierk"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.485526315789474,
            "ratingCount": 760,
            "itemReviewed": "Meatloaf with Fried Onions and Ranch Seasoning",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "667.7 calories",
            "carbohydrateContent": "34.9 g",
            "cholesterolContent": "158.7 mg",
            "fatContent": "46.7 g",
            "fiberContent": "0.8 g",
            "proteinContent": "23.9 g",
            "saturatedFatContent": "17 g",
            "servingSize": null,
            "sodiumContent": "1012.7 mg",
            "sugarContent": "4.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-01-22T13:24:06Z",
                "reviewBody": "My husband and I loved this recipe we have tried several different ones and I think that this is going to be \"the one\" we will go back to.. The only changes I made were I added in some garlic powder and just a splash of worchestire sauce.. For a glaze I added a mix of ketchup and Heinz 57 and then  sprinkled some shredded mozarella cheese on top when it came out of the oven..DELICIOUS!!! \r\nKiki (Brampton,Ont,Canada)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IGLOOSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-06T17:07:37.797Z",
                "reviewBody": "I thought this recipe seemed to easy to be good but I was wrong. I now own the Best Meatloaf Recipe award in our house. I've made this several times but make sure you use meat that is 80/20 or you will have some floating grease that you will need to drain off. Very tasty very easy. I took the foil off for the last 8 minutes or so. EASY and EXCELLENT (my two favorite words when it comes to cooking).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1927952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-20T05:15:35.73Z",
                "reviewBody": "I used 90/10 ground beef, 2lbs, since I needed 2 loaves. I used the whole 1oz pkg of ranch mix. I used the entire 6oz can of fried onions. I also used about a cup and a half of dried cornbread stuffing mix. I topped both with a drizzle of maple syrup and ketchup and then a half can of fried onions (3 oz) on top. I wrapped them with foil before baking for 1 hour and 15 mintes. I sprinkled the meat mix with coarse ground black pepper and a little bit of Jalapeno Salt. I also added 1/4 cup of ketchup and 1/4 cup of heinz 57 sauce. I added about half of a yellow sweet onion and about 1/2 of a green bell pepper (grinded in a food processor into small pieces) for moisture, I sprinkled about half a can of more french fried onions on each and wrapped each pan in foil before cooking for about 1hour and 15 minutes.  I let them rest for about 30 minutes before serving and they were to die for.  What a great recipe! I will never make \"regular\" meatloaf again!!!  It's fun to experiment with regular recipes and I will tell you that coming from someone who does not always like meatloaf, this was to die for and it is now my NEW meatloaf recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rantallion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1821241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:50:29.827Z",
                "reviewBody": "I've made this meatloaf for both sets of parents and both my mother and mother-in-law asked for the recipe!  This is the best meatloaf recipe that I've ever tried.  I mix brown sugar and ketchup and brush the top of the loaf with it before baking.  Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/33330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-04T04:07:45.577Z",
                "reviewBody": "Wow this is the first meatloaf I've made that didn't fall apart! While I was very pleased with the overall presentation I thought it was rather bland. I wish I'd added the whole packet of Ranch plus it could have done with some additional seasoning (onion powder garlic powder etc etc). The FF onions were hardly noticeable too. I'll be making this again but with a few modifications.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:38:56.607Z",
                "reviewBody": "Based on the reviews and the interesting ingredients I thought this recipe was really going to \"wow\" us. Actually it tasted like any other meatloaf. The fried onions added nothing more than my fresh do the stuffing was no different than seasoned bread crumbs and the powdered ranch dressing added no more flavor than my own seasonings (minus the chemicals). The only \"wow\" part was \"Igloosgirl\" suggestion to top the meatloaf the the Heinz 57/catsup combo. That little addition made the whole recipe worthwhile.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-10T03:47:27.397Z",
                "reviewBody": "Really enjoyed making this simple recipe. As usual I forgot to follow the recipe exactly. I noticed the Worchester sauce after I popped the loaf in the oven. And I used a 50/50 combo of ketchup Jack Daniels Honey Smokehouse BBQ sauce. I did use the Worchester making a glaze with it ketchup and the Jack Daniels sauce which I applied when I removed the foil 10 minutes before the \"ding\". I used a 96/4 ground beef which was not at all greasy or messy after using non-stick spray on the loaf pan. Very moist very flavorful and unfortunately we ate it before we could take a picture. My wife suggested we cook a bigger loaf next time so we can get some leftovers out of it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "longtab",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2153028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-16T03:49:04.89Z",
                "reviewBody": "We did not like this recipe. I will stick with my old standby!!! Do not waste your time and ingredients. Patricia Lee",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICIA LEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T22:53:51.943Z",
                "reviewBody": "While I couldn't agree more with those reviewers who gave this recipe one or two stars or with those who might have given this more stars but still stated they didn't like it I didn't find their reviews would be helpful to anyone to understand WHY they didn't like it. So here goes... they say it's \"blah.\" It is. I knew I'd need to doctor this up but the idea of the ranch seasoning and the French fried onions interested me so I plowed ahead. But I should have known better. You couldn't taste the ranch seasoning. You couldn't taste the French fried onions. And there was so MUCH French fried onions coupled with the bread crumbs that this really wasn't meatloaf at all. It was filler with a little meat. And not even inexpensive filler! The French fried onions were nearly 4.00 so you're not really stretching a buck here by using so much filler. The meat was almost an afterthought. And even though I added Worcestershire sauce garlic powder and finely chopped onion and green pepper. even though I even used a combination of ground beef veal and pork and topped it with bacon slices as it baked none of these steps took this meatloaf beyond mediocre. With all this tweaking to improve flavor I can't even imagine what this would have tasted like had I made the recipe strictly as written. In my view this is not meatloaf. It's filler with a little meat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ]
    }
]