[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
                    "name": "Stuffed Cabbage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14597/slovak-stuffed-cabbage/",
        "name": "Slovak Stuffed Cabbage",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1102439.jpg",
            "width": 3264,
            "height": 1832
        },
        "datePublished": "1999-09-23T16:37:02.000Z",
        "description": "I received this recipe from my grandmother. It was passed down to her from her grandmother.  This can be made ahead of time and frozen for a few days prior to cooking. Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "1 pound ground pork",
            "1 onion, chopped",
            "1 teaspoon salt",
            "black pepper to taste",
            "1 teaspoon chopped fresh parsley",
            "½ cup cooked brown rice",
            "1 ¼ teaspoons garlic salt",
            "2 (10.75 ounce) cans  condensed tomato soup",
            "27 ounces sauerkraut, drained",
            "1 (29 ounce) can diced tomatoes",
            "1 medium head cabbage",
            "5 slices bacon",
            "2 tablespoons white sugar",
            "3 cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Bring a pot of water to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix beef and pork together.  Stir in onion, cooked rice, parsley, salt, pepper, garlic salt and 1/2 can of tomato soup. Mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Core head of cabbage, place in boiling water and boil until partly cooked. Separate leaves and trim stems. Reserve about 24 to 32 whole leaves. Cut remaining leaves and line the bottom of  large roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly pack a small handful of the meat mixture and place in the center of a cabbage leaf. Fold top part of leaf over mixture, then fold in the sides and roll until mixture is completely encased.  Lay rolls on top of torn cabbage leaves in pan. Place sauerkraut evenly over rolls. Lay bacon on top of sauerkraut. Sprinkle with 1 to 2 tablespoons of sugar. Mix chopped tomatoes and soup with water and pour over rolls. Add additional water to reach top of cabbage rolls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 1 1/2 hours or until cooked through.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed",
            "Stuffed Cabbage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kelly Berenger"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.518382352941177,
            "ratingCount": 272,
            "itemReviewed": "Slovak Stuffed Cabbage",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "556 calories",
            "carbohydrateContent": "31.6 g",
            "cholesterolContent": "101 mg",
            "fatContent": "36.5 g",
            "fiberContent": "6.9 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "13.5 g",
            "servingSize": null,
            "sodiumContent": "2095.7 mg",
            "sugarContent": "16.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-17T20:33:57.547Z",
                "reviewBody": "This recipe is so close to mine that I wanted to review it and give a few tips that I use when making my cabbage rolls.  First, not only should you drain the sauerkraut, but you should also rinse it thoroughly and squeeze the excess water out.  This removes the brine that seems to give sauerkraut it's bad rep.  A good old world recipe boils the cabbage head and the shortcut of freezing the head overnight leaves the cabbage leaves rubbery.  It's an old world recipe and shortcuts like this are not good unless you just hate cabbage and throw the leaves out anyway.  There is a large hard vein that runs down the center of the cabbage leaves near where it comes off the core.  This can be cut out so your cabbage leaf is tender.  That hard vein cannot be tenderized so get it our of there.  Use smoked bacon-as it cooks, it helps to further tenderize those cabbage leaves as the fat renders down on top of rolls, plus it adds a smoky flavor to the sauerkraut.  Last of all, (no offense to anyone) the flavor of pork mixed with beef cannot be replaced by ground turkey.  It does change the flavor and taste of this old world recipe and the fat content of the pork helps to tenderize the cabbage covering the rolls.  I suggest you try the recipe as directed to try it old world then review it.  (Most people don't go through the trouble of making cabbage rolls very often so live a little here. If you plan to fix this frequently, then add your ground turkey and make it more healthy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:38:54.357Z",
                "reviewBody": "FANTASTIC!!!  I am a huge fan of stuffed cabbage to begin with, but this recipe improved upon my already good stuffed cabbage recipe.  I loved the ground pork with the ground beef.  The sauerkraut was a great addition to the cabbage.  I may try adding an additional can of soup next time to thicken up the sauce so it is more like gravy.  Be prepared!  This makes a lot of food.  (Good for leftovers.)  I didn't have a big roasting pan so I had to split this up amongst two 9 x 13 size pans.  I am going out to buy the right size pan for the next time I make this.  Thanks for the recipe.  My whole family enjoyed it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANETP.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T16:56:41.903Z",
                "reviewBody": "I've been making stuffed cabbage for quite a few years but wanted to find something just a little different; and this was!  We absolutely loved it!  My husband loves sauerkraut, my kids hate it and truthfully, coming from a german family and eating is constantly while growing up I didn't care if I ever had it again.  Needless to say, my husband thought this was terrific, my kids didn't even realize they were eating sauerkraut and I thought the kraut, coupled with the bacon added a very wonderful flavor. I'll make stuffed cabbage this way from now on. Thanks!!\nUPDATE! Since my recent move to Kentucky, I found out that the love of my life hadn't had a cabbage roll since he was just a kid. With that I just knew I had to make this particular for him. Kelly, I wish I could tell you how much he loved this! He actually said this was the most delectable dish he's had in a very long time! Nice compliment for both of us! Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-09T18:39:33.023Z",
                "reviewBody": "This is very similar to a recipe I copied from the Chicago Tribune many years ago. It was the authentic stuffed cabbage a downtown Polish church made once a year to rave reviews. It adds 1-2tsp. of marjoram (wonderful), 2 garlic cloves instead of the garlic salt and a teaspoon of caraway seeds on top of the rolls before the sauerkraut. I think I just use 28oz of pureed canned tomatoes. I also put extra cabbage leaves on the top to protect the sauce and then discard them. Best thing, it improves with age. Just gets better and better!!! Fry up a little bit of the meat mixture and see if it is to your liking. You can then adjust seasonings to suit yourself.God Bless Grandmothers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen in Door",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2934579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T20:01:25.417Z",
                "reviewBody": "This recipe is a ton of work, but gets rave reviews. Allow yourself at least three hours total time. A couple of suggestions:  * Salt the cooking water for cooking the cabbage * Rinse the cabbage after boiling with cool water to make it easier to handle  * Double the rice and the parsley * Saute the onions before adding * Substitute 6 cloves of fresh garlic for garlic salt, and saute the garlic with the onions * Add 2 tbs. of Hungarian paprika to the meat mixture   * Substitute marinara sauce for the tomato soup * Substitute brown sugar for white sugar * Cook the bacon and crumble before adding * Rinse the sauerkraut and squeeze out any excess liquid before adding  That's my two cents. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SusannaB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6098366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-04T21:54:59.79Z",
                "reviewBody": "My grandmother was Slovak and made stuffed cabbage often when I was a child.  When she passed away, I thought the recipe lost forever, until I discovered my mother could duplicate it with ease-must come from years of practice at Grandmother's side.  However, since my mother didn't write most of her best recipes down, when she died I again thought the recipe lost forever.  This recipe is the closest thing to my grandmother's, and it brings back wonderful memories just making it. And Jason can't get enough of it.  Thanks for a really great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David Wasson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/davidlwasson/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-07T05:58:13.39Z",
                "reviewBody": "Wow...this was very good, especially considering the comedy of errors that occurred the first time I made it.  I make a few modifications based on advice from other reviews:  I half the recipe, and it fits perfectly in a 9x13 baking dish.  I use ground turkey instead of pork.  I steam the cabbage in my steamer instead of boiling it (didn't have a pot big enough.)  I use a whole cabbage on a half recipe - perhaps I roll them smaller than others do.  I use pasta sauce in place of the soup (because somehow between the store and my house, the can of tomato soup escaped the first time I made this, and it was great with tomato sauce.)  I use white rice instead of brown, and always increase the amount of rice because the first version I made was a little meatier/heavier than I wanted.  I don't add any water at all, and couldn't imagine needing more.  There is plenty of liquid and the rolls are always very tender.  Labor-intensive but very, very worth it!!  It's great leftover too - heats up well in the microwave.  \n\nBoyfriend just commented - \"I will eat that stuffed cabbage until I bust.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon Davis Frechette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1276722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-03T21:33:59.187Z",
                "reviewBody": "I made them in the crockpot (remember to cut the liquid down) and they were GREAT!  I will definitely be making these again!  Thanks for the recipe.  mel",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELBABY33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693153/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-06T12:10:32.687Z",
                "reviewBody": "I gave this recipe a try because of all the positive reviews. It was excellent! Like my grandmother's stuffed cabbage but even better! I substituted extra ground beef for the pork and used white rice instead of brown because that's what I had on hand but it was still delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KASUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/652298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-15T00:27:15.973Z",
                "reviewBody": "I love stuffed cabbage when I've had it at weddings etc.;that is why I tried this recipe. I have to say it was a lot of work for a so-so result. I wished I had followed suggestions and comments. I will try again but I will add more tomato sauce (not soup) more seasoning (ie: fresh cracked pepper some ground cayenne (maybe some fennel seed)to the meat mixture. Will not use the diced tomatoes or tomato soup but instead use tomato sauce or crushed tomatoes and no water. To save this dinner from no one eating I drained all the liquid (there was about 2 1/2 CUPS) into a large pot; sliced up some red potatoes baby carrots and polish sausages. I boiled in the broth until potatoes and meat was done. After draining the liquid off cabbage rolls I poured a can of tomato sauce over them and baked another 30 minutes until bubbly; was much better. We all don't like the same things for sure but I do appreciate the recipe so I have the basics to make my own. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            }
        ]
    }
]