[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19304/chicken-milano/",
        "name": "Chicken Milano",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7020136.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-09-26T17:19:51.000Z",
        "description": "A delicious pasta and chicken dish with garlic, sun-dried tomatoes and fresh basil. Use the dry packaged sun-dried tomatoes instead of the tomatoes packed in olive oil. The sauce can be kept, covered, for one day in the refrigerator; heat again over low heat. Try it with some crusty bread if desired.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "2 cloves garlic, minced",
            "½ cup sun-dried tomatoes, chopped",
            "1 cup chicken broth, divided",
            "1 cup heavy cream",
            "1 pound skinless, boneless chicken breast halves",
            "salt and pepper to taste",
            "2 tablespoons vegetable oil",
            "2 tablespoons chopped fresh basil",
            "8 ounces dry fettuccini pasta"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over low heat, melt butter; add garlic and cook for 30 seconds. Add the tomatoes and 3/4 cup of the chicken broth; increase to medium heat and bring to a boil. Reduce heat and simmer, uncovered, for about 10 minutes or until the tomatoes are tender. Add the cream and bring to a boil; stirring. Simmer over medium heat until the sauce is thick enough to coat the back of a spoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle the chicken with salt and pepper on both sides. In a large skillet over medium heat, warm oil and saute chicken. Press on chicken occasionally with a slotted spatula. Cook for about 4 minutes per side or until the meat feels springy and is no longer pink inside. Transfer to a board; cover and keep warm. Discard the fat from the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the same skillet, over medium heat, bring 1/4 cup chicken broth to a boil; stirring the pan juices. Reduce slightly and add to the cream sauce; stir in basil and adjust seasonings to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, bring a large pot of lightly salted water to a boil. Add fettuccine and cook for 8 to 10  minutes or until al dente; drain, transfer to a bowl and toss with 3 to 4 tablespoons of the sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut each chicken breast into 2 to 3 diagonal slices. Reheat the sauce gently if needed. Transfer the pasta to serving plates; top with chicken and coat with the cream sauce; serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.630450321658327,
            "ratingCount": 2798,
            "itemReviewed": "Chicken Milano",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "640.8 calories",
            "carbohydrateContent": "47 g",
            "cholesterolContent": "156.3 mg",
            "fatContent": "34.8 g",
            "fiberContent": "2.8 g",
            "proteinContent": "36.3 g",
            "saturatedFatContent": "17.1 g",
            "servingSize": null,
            "sodiumContent": "501.5 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-08T01:05:59.123Z",
                "reviewBody": "Restaurant quality for sure!  First I marinated my chicken(6 breasts) in buttermilk for a few hours as I do with all my chicken(1cup milk 1 TBS vinegar or lemon juice if no buttermilk) for that extra moistness. Then I mixed 1/2 cup flour with 1 tbsp paprika and dredged chicken in before frying. I did it all in one skillet-why dirty more than one pan!  I sauteed garlic in 4tbsp butter(instead of oil) on low heat then I raised heat to med and added chicken which I cut into strips and browned on all sides.  Then I added sundried tomatoes and 1 cup mushrooms and sauteed a little longer.  I followed others and doubled sauce so I added 1 cup chick broth and 1 cup white wine(for a greater flavor) salt, pepper and reduced to low, covered and cooked for 30 minutes.  I removed chicken added heavy cream with 2 tbsp cornstarch(I like thicker sauce)and fresh basil and cooked to my desired thickness then added chicken back in and tossed on fettuccini.  WOW what a dish..Yummy! Fattening but a much deserved treat.-don't pass it up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-11T02:37:26.547Z",
                "reviewBody": "This is a very rich and creamy pasta recipe that was almost sinful!  I tried to simplify the recipe as a few other reviewers have done and only use one sautee pan.  First, I pounded out my chicken breasts to make them all even thickness then I dipped them in seasoned flour (smoked paprika, salt and pepper)and cooked them in a mixture of olive oil and butter until cooked through (about five minutes a side).  I removed the chicken and added the garlic and about 1 1/2 cups chicken broth to deglaze the pan.  I then added my chopped up sundried tomatoes and let them cook until tender.  Then I added 2 cups of cream and about 1 cup of freshly grated parm cheese.  I let this cook for about 8 mins and then added my chicken which I had sliced into three pieces each and let the chicken heat back up in the sauce and added the basil.  This was soooo good - like a meal at a restaurant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mam62505",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-23T11:37:20.78Z",
                "reviewBody": "This will be added to my list of restaurant quality dishes. The sauce is creamy and velvety delicious and the whole dish makes for a beautiful presentation on the plate. I used two chicken breasts (for the two of us) but kept the amounts of the rest of the ingredients the same. I added white wine to the sauce, which must be reduced a good long time to get the thick, rich  consistency I was after. After sauteeing the chicken breasts I sauteed shallots and fresh mushrooms, then added them to the sauce. I served this with whole wheat fettucine and roasted asparagus. We really enjoyed this, however, when I make this again I will stick with doubling the sauce, but keep the amount of tomatoes the same, as the amount of tomatoes meant for four breasts was a bit much for two.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-25T16:45:51.61Z",
                "reviewBody": "Simple and Delicious!  I started all three pots at the same time and I am glad I did because everything finished at the same time.  Although I was hesitant of the amount of sauce based on previous reviewers I made the recipe as stated.  I found the amount of sauce to be perfect for the meal.  My personal opinion is doubling it would make too much - overwhelming the dish.  I did make minor changes based on personal taste and what I had on hand.  I seasoned my chicken with salt, pepper and poultry seasoning after pounding it thin.  I'm glad I pounded it down - it took longer to cook then the recipe states.  When cooking the chicken I used about 1-1/2 tbsp oil from the sun dried tomatoes for added flavor with the other 1/2 tbsp of olive oil.  I made everything else as stated except used 1-1/2 tsp of dried basil because I didn't have fresh on hand.  Watch your sauce and don't cook it on a high heat it will reduce quickly and you don't want to have the problem other reviewers had with too little sauce.  Also you don't want the sauce to thicken a whole lot which may be causing the complaint of lack of sauce...As the recipe indicates you want it to be able to coat a back of a spoon.  It's not an alfredo sauce so you don't need that texture.  Anyways...My whole family enjoyed dinner even my picky eaters.  Next time I may cook the chicken in the sauce after browning for some added flavor but it is perfect as stated.  Thank you for the recipe it will definitely be a repeat in our home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandy L",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1732445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-04T05:48:02.263Z",
                "reviewBody": "yum Yum YUM! I usually never leave reviews, but this recipe was too EXCELLENT to not post something. I tasted a spoonful and I was surprised at how good it was! My brother said it was better than something you would order in a restaurant. Next time, I would double the sauce recipe and use 2 cups of heavy cream and an entire can of chicken broth (14 oz), which makes it easier to use up all the ingredients. I also followed other suggestions and added chopped portabello mushrooms and a little white wine with the sundried tomatoes (the kind packed in oil--this gave the sauce a wonderful flavor). I added about a spoonful of cornstarch to thicken the sauce up a little. I used olive oil instead of the butter and vegetable oil. I cut the chicken into pieces before cooking, and added the broth directly to the chicken instead of putting it aside. Finally, I added about 1/3 cup parmesan cheese with the basil. I made it with bowtie pasta..I think it goes better with shorter pasta instead of strand pasta. YUM...i'm gonna make it again tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMAILPAULINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310949/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T22:56:58.623Z",
                "reviewBody": "Let me start by saying that this recipe is DELICIOUS. If you're having company over, or want to impress a date with a fabulous dinner - this is the meal to make. Having said that, there are a few steps I would change when making this dish. My sauce was done long before the chicken and pasta and reduced down to almost nothing. I didn't really have enough to serve. Pound your chicken breast flat and season it first.(WATCH THE SALT - YOU DON\"T NEED MUCH)Before you start to cook it, get your pasta going because it takes the longest to finish. Right after you get the chicken on, start your sauce. If you're like me and like a lot on your pasta, please consider making double the recipe - it reduces quickly. Thanks for the restaurant - quality dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spicymama29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/783195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T16:30:06.39Z",
                "reviewBody": "Oh My God!!!  SOOOOOO good!  This was absolutely incredible and not difficult at all.  I know other reviewers thought it messed up too many pots, however, I kept the chicken in the pan and added the sauce to that to let it absorb the flavors and saved myself an extra plate and pot by doing so.  It's TOTALLY worth the dirty dishes.  My husband and I were fighting over today's leftovers.  I added mushrooms and I used 1/2 and 1/2 rather than the heavy cream (to save on fat and calories) and it was still AMAZING!  This will be a regular in my house.  Thank you for the great recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SusanD??",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/539736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-09T12:58:37.22Z",
                "reviewBody": "This is a very good recipe. I cannot understand why so many feel the need to change/add other ingredients. Why not submit your own recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DeeLee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-23T15:24:38.437Z",
                "reviewBody": "This was so good I was inspired to write a review. This recipe tastes even better the next day. Next time I make this I will make the sauce the day before. I also reccomend putting a little bit of cream aside and mix with a little cornstarch to thicken the sauce a bit. This was fantastic and probably one of the best recipes I've tried on here so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "reggie b.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-10T20:29:21.543Z",
                "reviewBody": "ok chicken a bit dry. nothing special",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2412762/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Milano",
            "description": "See how to make a tasty Italian-influenced chicken dish.",
            "uploadDate": "2012-08-10T18:12:15.870Z",
            "duration": "PT4M1.074S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd0b5b4cb-2f99-4a7c-994a-66b67d822632%2F5562ae6c-c862-4804-b52e-9de89931f983%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1780260128001"
        }
    }
]