[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18068/winter-squash-rolls/",
        "name": "Winter Squash Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F784483.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "1999-09-29T16:55:05.000Z",
        "description": "This recipe is always a real hit! Every time I make these I get asked for the recipe. People can't believe it when I tell them that they're made from winter squash. These delicious rolls taste best fresh out of the oven.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "1 ½ cups cubed <a href=\"https://www.allrecipes.com/article/types-of-winter-squash/\" aria-label=\"winter squash\">winter squash</a>",
            "1 cup scalded milk",
            "2 (.25 ounce) packages active dry yeast",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "6 cups all-purpose flour",
            "½ cup white sugar",
            "2 teaspoons salt",
            "½ cup shortening"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). In a small saucepan, cover squash cubes with water. Bring to a boil and cook until tender, about 15 minutes. Drain, cool and mash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast in warm water. In a large bowl, combine 5 cups flour, sugar and salt. Stir in the yeast mixture, shortening, squash and milk. Mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into twelve equal pieces and form into rounds. Place the rounds in a lightly greased 13x9 inch baking pan. Cover with a damp cloth and let rise until doubled in volume, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (200 degrees C) for 10 to 15 minutes or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TRACEY_MITCHELL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.706382978723404,
            "ratingCount": 235,
            "itemReviewed": "Winter Squash Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "363.2 calories",
            "carbohydrateContent": "61.2 g",
            "cholesterolContent": "1.6 mg",
            "fatContent": "9.6 g",
            "fiberContent": "3.1 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "399.1 mg",
            "sugarContent": "9.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-12T17:04:18.31Z",
                "reviewBody": "My kids love these rolls. I usually prepare the dough in my bread machine rather than by hand. To do this the recipe must be resized to fit your bread machine. For my medium-sized machine I resize the recipe to make 7.3 servings (though I then actually make 12 rolls out of the dough. The original recipe makes rolls that are too big for my liking.) The pureed squash is added along with the other liquids at the bottom of the bread pan. Remember to use bread machine yeast (\"instant\" yeast) instead of active dry yeast. The recipe also seems to work very well with other vegetables. I have tried butternut squash carrot and beetroot (which makes great \"Red Nose Day\" rolls!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAVIMAHARAJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1373477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T14:46:50.623Z",
                "reviewBody": "After many failed attempts at using whole wheat to make dinner rolls I was looking for a way to prepare rolls that were light and had fiber and these are it! They're as light as regular dinner rolls more tasty moist and perfect. I've been recommending this recipe to all of my baking friends. However be forewarned that this makes 12 HUGE dinner rolls. Cut the recipe in half unless you're having a dinner party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KGREEN39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T18:05:56.48Z",
                "reviewBody": "Moist,light,tasty and a wonderful golden color if you use butternut squash.I baked at 375 degrees for 30 min.They tend to over brown at 400 degrees.I got two large pans(32 rolls)with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KANSPAT13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T23:55:18.89Z",
                "reviewBody": "I'm not sure where this recipe originated, by my mother made squash rolls almost exactly the same. Just as they come out of the oven, if you rub a stick of butter over the tops of them, it keeps them soft and makes them just that much better. Also, substituting up to half of whole wheat flour for white gives them an added health kick without ruining the texture. One more note--this is a bread that you can make ahead of time. Stick dough balls in a greased casserole dish, seran wrap, freezer bag, then thaw and bake whenever you want! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmyJean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2610348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-24T16:38:05.613Z",
                "reviewBody": "I cut this recipe in half. Because I did not have winter squash on hand, I used Trader Joe's organic canned pumpkin. I used my Kitchen Aid mixer to make these rolls. I proofed the yeast with the slightly-cooled scalded milk, warm water and sugar for ten minutes, then added the cooked squash, melted butter, and all the dry ingredients. I did need just a touch more flour than the recipe stated to get it to form into a ball and jump on the bread hook, almost another full cup. I kneaded it in the Kitchen Aid with the dough hook for about five minutes or more, adding more flour when the dough would stick to the bottom of the mixer bowl (which it did because the dough was rather sticky). I set it to rise in a greased bowl on my heating pad for an hour, then formed them into rolls and plopped them into greased muffin tins (about a heaping 1/4 cup for each roll?), covered them and set them to rise on my heating pad until they doubled. Right before baking, I lightly brushed them with a little melted butter. 400* for 12 minutes was absolutely perfect. Good sized dinner rolls that were soft, fluffy and absolutely wonderful. What a fantastic recipe and really, the pumpkin adds a pretty color and adds a little something to the roll that's really fantastic. I think this would make a great sweet roll dough. NOTE: Watch these in the oven, they do have quick minute or two where they could burn. I almost had that happen but I caught it just in time. HALF RECIPE for me was exactly 12 rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T22:51:08.183Z",
                "reviewBody": "DELICIOUS. I made these to go with pot roast. Glad I cut the recipe in half as it was just my husband and I and it made 6 giant rolls. Toasted some the next morning and had them with the All Day Apple Butter I made the day before and they made a great breakfast too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TERRY62941",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/462038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-24T03:19:47.903Z",
                "reviewBody": "These are excellent!!! They stand out of the crowd!!! Delicious rolls. I used acorn sqaush and my \"squash hating vegetable hating don't ever try anything new\" husband loved them!! No one believed thats where they got their lovely yellow color. They ate all of these and barely touched the white dinner rolls I made. They thought they tasted gourmet like what you would get at a restaraunt!!! I will definately make these again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Christy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1646854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T18:06:00.857Z",
                "reviewBody": "Very moist and soft bread. My mother wanted seconds of it instead of dessert at Thanksgiving dinner. Very good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lucy Dennison Tedder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/125687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-22T14:50:07.327Z",
                "reviewBody": "Very moist and fluffy. I used Japanese pumpkin instead of winter squash because I can't find them in Tokyo. The pumpkin gave the roll a nice color. I baked them at 375F for 15 minutes. Even husband who said \"yuck dinner rolls\" ended loving them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T23:46:32.59Z",
                "reviewBody": "Very moist and quite good! I only gave them three stars though because I'd prefer something with a more interesting flavor and texture. I think these would be better with a little more grit so if I make them again I'll use half wheat flour next time. I might also toy with using butter instead of crisco. I followed the recipe exactly this time except that I cut back the sugar to 1/3 of a cup and they still seemed plenty sweet to me. Sweet moist and HUGE. The other reviewers weren't kidding. I should have halved the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisabeth Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3683861/"
                }
            }
        ]
    }
]