[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14621/beef-pot-roast/",
        "name": "Beef Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F23%2F385711.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-09-30T15:44:12.000Z",
        "description": "This is the best and easiest recipe for pot roast I have ever tried. It is best to make it a day ahead. Serve with oven roasted vegetables, potatoes, carrots, onions, or your favorite side dish.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 teaspoons olive oil",
            "4 pounds boneless chuck roast",
            "1 onion, chopped",
            "2 cloves garlic, minced",
            "2 bay leaves",
            "1 teaspoon salt",
            "½ teaspoon freshly ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a heavy Dutch oven on top of the stove over medium high heat.  Add oil, and sear meat in the center of the pan for 4 minutes. Turn meat over with tongs; sear all sides for 3 to 4 minutes on each side.  Remove meat from pan.  Arrange onion, garlic, and 1 bay leaf in the bottom of the pan, and sprinkle with salt and pepper.  Return meat to pan, place remaining bay leaf on top of meat, and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook in the oven for 30 minutes at 325 degrees F (165 degrees C).  Reduce the heat to 300 degrees F (150 degrees C), and cook for 1 1/2 hours.  Remove roast to a platter to rest for 10 to 15 minutes. Slice, and top with onions and gravy.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Teresa C. Rouzer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.544097693351425,
            "ratingCount": 737,
            "itemReviewed": "Beef Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "550.6 calories",
            "carbohydrateContent": "1.6 g",
            "cholesterolContent": "161 mg",
            "fatContent": "41.9 g",
            "fiberContent": "0.3 g",
            "proteinContent": "39.4 g",
            "saturatedFatContent": "16.6 g",
            "servingSize": null,
            "sodiumContent": "445.7 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-05T18:50:39.297Z",
                "reviewBody": "I tried this recipe on my first attempt at pot roast, mostly because the technique seemed easy.  But I put my own touches on it.  I used the chuck roast and seasoned it w/ salt, pepper, garlic powder, and a little italian seasoning.  Make sure you sear the meat well, but not burned.  After searing, I put the onions in the pot with a diced bell pepper, a few cut up baby carrots, a can of sliced mushrooms, a dash of Worcestershire, and half a can of beef broth.  I let it come to a boil, then put the roast back in the pot and put it in the oven.  Last thing was to thicken the liquid with a little flour.  This pot roast tasted so homemade, my husband and daughter cleaned up for me!  Make sure that you add some type off liquid (broth, wine, water, or combination), otherwise yours will be very dry.  Hope this helps, I now have a pot roast recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne Harris Parks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1544975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T22:10:56.17Z",
                "reviewBody": "My husband said, \"He couldn't have ordered a better meal in a restaurant.\"  Given my lacking culinary abilities and his finicky palate, this was quite the compliment!  This recipe makes a beautiful presentation and the juices and onion and garlic makes it's own gravy/sauce.  The key to it not coming out dry (as one reviewer complained) is searing the meat for the full 4 minutes on each side.  I set the kitchen timer and left it alone.  Also do not add salt (just like the recipe states) until the meat is seared.  This keeps the juices from running.  I was also able to use a less expensive piece of meat and it turned out fabulously!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAWNMONAHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/629775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-26T04:20:21.173Z",
                "reviewBody": "This is one of the first recipes I found on allrecipes.com several years ago and I've been making it ever since.  My recommendation:  DON'T CHANGE ANYTHING.\n\nWhen people complain that it's tough, but they added water, it's their own fault!\n\nDon't add water or broth.  Don't add potatoes or carrots.  Don't even change the amounts on the salt and pepper.  Just do exactly what the recipe says and you will be happy with the results!  I always am...but when I don't follow it exacyly, I'm disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy Beller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/128242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T17:50:44.923Z",
                "reviewBody": "This was a big hit with my family!  I did make a few changes and it was juicy, delicious, and flavorful.  I seared it on all sides, 4 min. each side. Meanwhile, on the bottom of my Dutch Oven I put carrots, celery, 4 cloves of garlic, onion wedges,and quartered potatoes. I made a rub of lemon pepper, garlic salt, pepper and paprika. After searing, using disposable gloves, I rubbed the seasonings on all sides of the roast. I also stuck 5 cloves of garlic in slits in the roast. I added 1/2 can of beef broth over the vegies.  Covered tightly with heavy alum. foil and cooked following the recipe. Wonderful! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeri Davini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1923049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-10T00:24:05.797Z",
                "reviewBody": "I picked this recipe because I wanted a plain pot roast without added vegetables, wine, beef broth etc. -- a recipe that allows one to savor the flavor of the beef. This is it! Followed the recipe as given, although my chuck roast was only 3 lbs. The roast came out very juicy and tender with a delicious flavor. There was a lot of juice in the pan, but it's a stretch to call it 'gravy'. You'll have to thicken and season it to get a traditional brown gravy but there's plenty of juice to work with. For those who have problems, two suggestions: 1) chuck roast is one of the cheapest beef roast cuts and I've only been satisfied when purchased at a good butcher shop. The one's found in the grocery store usually cook up pretty tough and/or dry. I've also had good luck with chuck roasts from Whole Foods. 2) Make sure your roaster/dutch oven has a tight fitting lid AND is sized for the roast. If the lid is loose or you use a roaster that holds a 25 lb turkey, the pot roast will turn out dry. Great and easy recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MuscleMan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/muscleman/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T18:24:30.57Z",
                "reviewBody": "This was excellent...but I'm happier with the success of the gravy that was produced from this!! Thanks to the tips from the \"gals\" (wink) I added some beef broth to ensure moisture and per another reviewer added 1/2 pkg dry onion soup mix. I did have to thicken a little by adding some cornstarch (very little) but I assume its b/c I added a little too much beef broth. Excellent taste texture and overall was much easier than I thought it would be!! Very excited to make this again!! Thanks Teresa!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-03T11:47:38.14Z",
                "reviewBody": "My family loved everything about this recipe.  The flavor was outstanding.  I agree with others, FOLLOW THE RECIPE AS WRITTEN.  Go ahead and add some other spices per your taste but sear the meat as directed and then season.  I added some flour to the strained meat drippings and the gravy was wonderful.  My hubby commented that it was the best roast I've ever made.  I normally do a roast in the crockpot but not anymore!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEXI70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/618623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-19T16:55:44.173Z",
                "reviewBody": "Great recipe! I used about a 3 1/2 lb Boneless Chuck Roast and I cut away the largest parts of fat.  I seared the meat as directed and added 2 cups of beef broth (I use the powdered bouillon, so I used 2 packets to make the 2 cups of broth) and put it in the oven for the first 30 minutes. When I turned down the temp, I added the seasoning and veggies. I used 1 onion, about 2 teaspoons chopped garlic, 1 green bell pepper, 1 whole bunch of celery, baby carrots, red potatoes and 1 packet Onion Mushroom Soup Mix. I seasoned the meat with pepper, Tony Chachere's Seasoning, Worchestershire and a shaking of red pepper flakes.  I didn't use the bay leaves.  I just covered the Dutch Oven with foil and let it go for the next 1 1/2 hour.  It was FABULOUS!!!  I can't wait to eat it tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShannonS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-16T21:06:03.983Z",
                "reviewBody": "This recipe is FANTASTIC!! Easily the best pot roast I've ever made! This also freezes quite well - just cool and slice and package with a little of the \"gravy\" in a freezer zip-top bag.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jekl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:02:04.637Z",
                "reviewBody": "Followed instructions as described with a 5 pound roast. Came out with lots of juices however it was well overdone. After cutting and slicing the meat only tasted good for about the first 2 minutes. Then it quickly became dry and chewy without it sitting in the gravy/roast pot. I also thought it lacked flavor. I added lots of onions and garlic at the bottom to compensate for bigger roast compared to recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "chris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6157557/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Beef Pot Roast",
            "description": "This delicious pot roast is best made a day before serving.",
            "uploadDate": "2012-06-01T01:45:07.491Z",
            "duration": "PT2M30.233S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F73df76ba-d170-451d-baf9-6ef9cd989c9a%2F52858acb-5d4b-4f1f-b03d-a1b67ce1a59f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1666247076001"
        }
    }
]