[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14728/pork-and-dumplings/",
        "name": "Pork and Dumplings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1104177.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-10-02T11:40:59.000Z",
        "description": "A down home favorite for the whole family. This is comfort food!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 to 8 servings",
        "recipeIngredient": [
            "8 pork chops",
            "2 quarts water",
            "salt and pepper to taste",
            "3 cups all-purpose flour",
            "3 tablespoons shortening",
            "1 teaspoon salt",
            "¾ cup hot water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pork chops in an oven-safe pan, pour in 2 quarts water and season with salt and pepper to taste. Cover and bake for 1 1/2 hours. Remove pork from broth and set aside and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the shortening in the flour and 1 teaspoon salt until the mixture resembles coarse crumbs. Gradually add hot water until it forms ball. Place dough on a floured surface and roll out to 1/8 inch thick. Cut into 2 inch squares.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pan full of broth on medium-high heat and bring to a boil. Drop biscuits in and cook over medium heat for 15 minutes. Serve spooned over cooked pork chops.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dorsey Marshall, Jr."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5833333333333335,
            "ratingCount": 12,
            "itemReviewed": "Pork and Dumplings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "382.1 calories",
            "carbohydrateContent": "40.9 g",
            "cholesterolContent": "74.1 mg",
            "fatContent": "10.3 g",
            "fiberContent": "1.4 g",
            "proteinContent": "28.8 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "404.8 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2002-11-23T02:23:06.543Z",
                "reviewBody": "My family did not like this recipe at all. I promise I followed the directions to a \"T \" but the pork turned out bland. The dumplings which I thought would be a hit with my kids were too sticky and they did not care for them. When trying this recipe I would recommend adding additional spices and perhaps some veggies to the broth. Hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sahmoftwo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-27T23:26:53.06Z",
                "reviewBody": "This recipe turned out pretty well. I added a bit more spice to the water that I cooked the pork chops in (onion salt a fresh minced garlic clove and some paprika). Also my Fiance was about 2 hour late getting home so I had cooked the pork chops at the full temp for the full time then reduced the temp to about 100 then to 50 C. I don't know if it was the extra cooking time or if it would have happened from the normal cooking time but the meat just fell away from the bones and was SO tender. My Fiance really liked the taste and textrue of the meat. I also made some gravy with some of the water from the pan before I put the dumplings in. The dumplings were a litte much (maybe because I didn't have my rolling pin and had to flatten by hand and couldn't quite get them to 1/8 inch). Instead of 2-inch squares next time I'll make them a little smaller. I wasn't sure what to expect from the dumplings - but they were good - your basic noodle! My Fiance said that he could do without the noodles (not a huge noodle fan) but added that if you are a fan of noodles you would probably really like it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara Butler Harris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/488223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:54:59.373Z",
                "reviewBody": "Oh my goodness. Thank you for this recipe. My family flipped for it. My daughter rarely eats meat and she asked for seconds. The dumplings are so easy and flavorful. A terrific EASY winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDREAHYDOCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/128381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-09T18:51:21.077Z",
                "reviewBody": "Yummy! Very tender pork.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ClaireSalgado",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5920852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-10-02T22:52:10.357Z",
                "reviewBody": "It is pretty bland and the gravy is a watery mess. I may play around with it if I make it again but next time I will not be cooking the pork in water, that removes ALL the flavor. I did add some onion soup mix as well as other spices but it didn't really help this.  I'll probably either bake it or pan fry it and use the drippings to for a base for the gravy. Loved the dumplings, but really not necessary to cook it in the pork water, you can just use normal water to cook. I might add some mushroom soup to the gravy mix too.  It's a good concept but just not really there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Eddy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8237795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-27T20:40:53.5Z",
                "reviewBody": "Ok a couple of things...#1 this is not a pretty dish. I know that we eat with our eyes before we even pick up a fork. That being said you do need to pick up that fork and try it. #2 It is bland. You need to put in spices that appeal to you. I fo0und it to be quite bland until I added in some dried spices; basil parsley etc. It gives it a much more complex flavor. Other than adding in the spices this dish is delish. just not pretty. This dish reminded me of chicken and dumplings because I didn't roll the dumplings out and cut them I simply dropped them into the broth. I also used slices of the pork shoulder roast I recently made in place of the chops which I think lended itself to its tenderness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracey Ferrari Posner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6476442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-08T09:30:59.503Z",
                "reviewBody": "I have never been more impressed with myself as I was at dinner tonight! I used a suggestion made by another reviewer and added onion powder 2 diced garlic cloves paprika salt and pepper to the water. OK a lot of pepper I like a little kick! I had 2 boneless pork chops about 1.5\" thick (Thank you Costco) and sliced them in half giving me 4 to work with. The dish I used was small enough that all 4 pieces had their own space and the liquid completely covered them. Cover with tinfoil and bake 375 for 1.5 hours. Following the rest of the recipe I used a shot glass to cut the dough making perfect bitesize dumplings. After the 15 minutes I emptied all the juice into a second pot (leaving the dumplings behind) added a cornstarch/water mixture and let that return to a simmer to thicken up the 'gravy'. After a few minutes I returned the dumplings to that second pot. I am still so pleased with myself. What a great recipe! Will cook again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookieMonster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11095313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-02T19:35:41.687Z",
                "reviewBody": "The recipe as is would be pretty bland with a few additional spices it's pretty good. I added half of a chopped onion to the broth and some garlic powder also added some veggies before I put the dumplings in ( I only had peas and carrots but anything on hand could be added). Might try making it with chicken stock next time too or bone in chops for additional flavour. As for the dumplings reason for only giving it three stars only three tablespoons of shortening for 3 cups of flour does not make the flour crumbly. Maybe it's just me but I ended up having to make two batches of dumplings because the first batch ( the one where I followed directions to a \"T\") came out dry crumbly and wouldn't even stick together to make a ball of dough. So I made them again adding probably 7 Tbsns of shortening and a full cup of water and they came out ok. I also live in a very dry climate right now so maybe that had something to do with it. Will keep tweaking but a decent base recipe for some good old fashioned comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chrissysayshi2u",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2005641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-26T11:29:03.563Z",
                "reviewBody": "I made this according to the instructions. I used pork neck bones and I got a lot of meat. After 2.5 Hours, I took lot the pork bones, let them cool, And drilled the meat off the bones. I made the dumpings as",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tiggerknit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tiggerknit/"
                }
            }
        ]
    }
]