[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/172/soups-stews-and-chili/soup/cream-soups/",
                    "name": "Cream Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14777/soups-stews-and-chili/soup/cream-soups/cream-of-chicken-soup/",
                    "name": "Cream of Chicken Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15021/cream-of-chicken-with-wild-rice-soup/",
        "name": "Cream of Chicken with Wild Rice Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F24439.jpg",
            "width": 1408,
            "height": 1056
        },
        "datePublished": "1999-10-03T09:12:05.000Z",
        "description": "This makes a lovely chicken and wild rice soup.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ⅓ cups wild rice",
            "1 (3 pound) whole chicken, cut into pieces",
            "7 cups water",
            "1 cup chopped celery",
            "1 cup chopped onion",
            "2 tablespoons vegetable oil",
            "1 cup fresh mushrooms, sliced",
            "2 tablespoons chicken bouillon granules",
            "¾ teaspoon ground white pepper",
            "½ teaspoon salt",
            "½ cup margarine",
            "¾ cup all-purpose flour",
            "4 cups milk",
            "¾ cup white wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook the wild rice according to package directions, but remove from heat about 15 minutes before it's done. Drain the excess liquid, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a stock pot over high heat, combine the chicken and the water. Bring to a boil, and then reduce heat to low. Simmer for 40 minutes, or until chicken is cooked and tender. Remove chicken from the pot, and allow it to cool. Strain the broth from the pot, and reserve for later. When chicken is cool, remove the meat from the bones, cut into bite size pieces, and reserve. Discard the fat and the bones.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the same stock pot over medium heat, saute the celery and onion in the oil for 5 minutes. Add the mushrooms, and cover.  Cook for 5 to 10 minutes, stirring occasionally, until everything is tender. Return the broth to the stock pot, and add the partially cooked wild rice. Stir in the bouillon, white pepper and salt; simmer, uncovered, for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt margarine in a medium saucepan over medium heat. Stir in the flour until smooth. Whisk in the milk, and continue cooking until mixture is bubbly and thick. Add some of the broth mixture to the milk mixture, continuing to stir, then stir all of the milk mixture into the broth mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the reserved chicken meat and the white wine. Allow this to heat through for about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Cream Soup Recipes",
            "Cream of Chicken Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Thomas"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6372239747634065,
            "ratingCount": 317,
            "itemReviewed": "Cream of Chicken with Wild Rice Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "571.6 calories",
            "carbohydrateContent": "38.1 g",
            "cholesterolContent": "84.5 mg",
            "fatContent": "29.6 g",
            "fiberContent": "2.7 g",
            "proteinContent": "33.6 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "431.7 mg",
            "sugarContent": "8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-08T01:15:29.593Z",
                "reviewBody": "This is a wonderful, thick and creamy, tummy pleasing soup, but I did make a few changes to the recipe. Too lazy to make homemade broth, I used boxed chicken broth instead of the water, and added leftover cooked chicken I had in the fridge. Not a fan of vegetable oil, I sauteed the onions and celery in butter. I didn't have any wild rice on hand, but I did have a box of Uncle Ben's long grain and wild rice, and I found the accompanying seasoning packet provided a bonus of flavor. The wine is a must and should not be omitted. This is a keeper recipe, with room for personal touches and variations. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-01T18:41:10.61Z",
                "reviewBody": "I added flavor in my preparation, hence the 3 star rating on the basic recipe which I thought would be too bland as written...I need my garlic. The end result was amazing (better than any restaurant version) and well worth the time. My significant changes: 1)Three dried bay leaves added to simmering chicken; 2)replaced fresh mushrooms with 1/2oz of dried chopped up porcini mushrooms to the soup,the flavor was amazing; 3)sauted four chopped garlic cloves with veggies, 4)added wine right after sauteing veggies rather than at end of recipe; 5)added a handful of fresh sage leaves towards end of cooking because I have them (dried sage, thyme, rosemary or other aromatic herb would be great, but added earlier); 6)increased salt and black pepper to taste.  7) I used 3 bone-in chicken breasts (plenty of meat) and substituted 5 cups of homemade stock and 2 cups for remaining water in recipe 8) butter instead of margarine.  This recipe is a great starting point, but needs your personal touch to make it truly spectacular!  I've made this with and without wine, it really makes a difference. So does the dried porcini. Regular mushrooms just don't add the drool-worthy flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "FoodSlave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1392175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-01T18:01:31.597Z",
                "reviewBody": "My husband and I LOVE this recipe!  It reminds me of the soup at Panera Bread.  I made a couple of changes.  I use boneless chicken breasts, which I cook the day before to make it less time-consuming.  I couldn't find wild rice by itself, so I buy two boxes of Uncle Ben's and cook it without the butter or seasoning packets.  I use 3 cups whole milk and one cup heavy cream, and 4 cups store-bought chicken broth with 3 cups of water from boiling the chicken.  I serve it with Pepperidge Farm Sourdough Artisan bread and salad.  It takes a while to make the soup, but it's totally worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "H@ppy2BHere",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1489006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-16T13:31:26.79Z",
                "reviewBody": "I liked this recipe though it was labor intensive. For those who had trouble with the soup not being thick enough keep in mind you really have to stir the milk in the flour/butter roux for quite a while on medium heat. It takes about 15 minutes for it to get thick enough and it should get so thick that it's tiring to keep whisking it. It might not seem like it's going to thicken but keep at it and it will. I didn't use bouillon but seasoned the water that I boiled the chiken in with lots of celery garlic cloves salt and pepper. It was still a little bland so I added a few dashes of worcestishire sauce and it was fine. I might put a little less wine in mine next time it was a bit overpowering. I used Sauvignon Blanc but I think sherry might taste better. Real wild rice is the key in this I think. Very nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hp212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1786224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T18:44:32.45Z",
                "reviewBody": "I LOVE this recipe and have made it again and again. My friends also request this recipe when I make it. I substitute two cans of mushrooms for the fresh mushrooms and then I cook the wild rice in a chicken broth. I also sautee the onions and celery in butter instead of oil and add some extra salt and it is WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LGURT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T01:29:38.24Z",
                "reviewBody": "Yum! I love a good thick soup... and this one did not disappoint... great flavor and consistancy...I did add a little garlic to the oil...and then added the vegies. (what can you do I am an Italian stereo type) I also used fresh cracked black pepper instead of white ground pepper. To speed up the recipe... you can use boneless skinless chicken breasts...boil those...and use 7 cups of chicken broth instead of the boullion cubes and reserved stock.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2142094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-05T12:23:32.89Z",
                "reviewBody": "This was the best tasting chicken wild rice soup I have ever had other than going to a fine restaurant. My family loved it. However instead of 4 cups milk I added 3 cups milk and 1 cup half and half. Instead of 1 cup chopped onion (we don't like onion) I added 1 tablespoon dried minced onion. I added 3 tablespoons chicken base instead of 2 tablespoons chicken bouillon. It was truly outstanding!!!! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHMAJO39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-10T14:24:18.997Z",
                "reviewBody": "I absolutely loved this recipe! My fiance is a huge chicken/wild rice soup fan. When we go out to eat it's his soup of choice. I tried this recipe out on him and he said it was as good if not better than the places we eat out at. It's in my recipe box already!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ERICAJOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/620238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T20:56:45.64Z",
                "reviewBody": "Great recipe but a bit bland. I used 4 cans of chicken broth instead of 7 cups water and that absolutely did the trick. I also used 5 minute wild rice which I cooked for two minutes drained and added at the very end. I omitted the wine but I'm sure it would be great with it as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DBlairx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683180/"
                }
            }
        ]
    }
]