[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14606/beef-tenderloin-with-roasted-shallots/",
        "name": "Beef Tenderloin With Roasted Shallots",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2946884.jpg",
            "width": 1386,
            "height": 960
        },
        "datePublished": "1999-10-05T01:29:42.000Z",
        "description": "The shallot sauce takes some time, but is well worth the trouble. This is definitely a company dish, and the recipe doubles well for a larger party. Serve with a green salad and roasted vegetables.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "¾ pound shallots, halved lengthwise and peeled",
            "1 ½ tablespoons olive oil",
            "salt and pepper to taste",
            "3 cups beef broth",
            "¾ cup port wine",
            "1 ½ teaspoons tomato paste",
            "2 pounds beef tenderloin roast, trimmed",
            "1 teaspoon dried thyme",
            "3 slices bacon, diced",
            "3 tablespoons butter",
            "1 tablespoon all-purpose flour",
            "4 sprigs watercress, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).  In 9 inch pie pan, toss shallots with oil to coat.  Season with salt and pepper.  Roast until shallots are deep brown and very tender, stirring occasionally, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, combine beef broth and port.  Bring to a boil.  Cook over high heat until the volume is reduced by half, about 30 minutes.  Whisk in tomato paste.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pat beef dry; sprinkle with thyme, salt and pepper.  In a large roasting pan, set over medium heat on the stove top, saute bacon until golden.  Using a slotted spoon, transfer bacon to paper towels.  Add beef to pan; brown on all sides over medium high heat, about 7 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer pan to oven.  Roast beef until meat thermometer inserted into center registers 125 degrees F (50 degrees C) for medium rare, about 25 minutes.  Transfer beef to platter.  Tent loosely with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon fat off top of pan drippings in roasting pan.  Place pan over high heat on stove top.  Add broth mixture, and bring to boil; stir to scrape up any browned bits.  Transfer to a medium saucepan, and bring to simmer.  Mix 1 1/2 tablespoon butter and flour in small bowl to form smooth paste;  whisk into broth mixture, and simmer until sauce thickens. Whisk in remaining butter.  Stir in roasted shallots and reserved bacon.  Season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut beef into 1/2 inch thick slices.  Spoon some sauce over, and garnish with watercress.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christine L."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.835471698113207,
            "ratingCount": 1325,
            "itemReviewed": "Beef Tenderloin With Roasted Shallots",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "653.1 calories",
            "carbohydrateContent": "11.9 g",
            "cholesterolContent": "132.1 mg",
            "fatContent": "50.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "31.6 g",
            "saturatedFatContent": "20.4 g",
            "servingSize": null,
            "sodiumContent": "645.2 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:07:39.39Z",
                "reviewBody": "Believe all these raving reviews.  It really is that good!  I made this for a dinner party of 15 people last night with a 5 1/2 lb. tenderloin.  I was worried about timing the preparation of the meat along with the other sidedishes, so I prepared some of this ahead of time.  I roasted the shallots & boiled the wine/broth combination the day before and stored these in the refrigerator.  Then I cooked the bacon a couple of hours ahead of time, set it aside to cool and allowed the pan it cooked in to sit on the stovetop.  I took the suggestion of a couple of other posters and put the wine/broth mix, the bacon & shallots into the blender to make a smooth sauce.  This was really wonderful!  After roasting the tenderloin, I poured the smooth sauce into the same pan, whisked in the butter and flour and Voila! - an incredible tasting gravy to spoon over a moist & tender cut of meat.  I did roast the tenderloin longer because many of my guests like beef more well done.  Even with that, it still could be cut with a fork.  My husband and I can't wait to try this again with a more medium rare piece of meat.  I've tried many wonderful dishes from Allrecipes, but this one is the very best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri McAlister",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17538621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:09:03.31Z",
                "reviewBody": "I served this for xmas dinner. I was very nervous because I've never served beef tenderloin. Everything turned out perfect. One guest called the next day and told me it was the best, most tender meat he and his wife ever had. I had a 4.5 pound tenderloin instead of the 2 pounds that the recipe called for but I did NOT double the amount of the sauce. I still had leftoever sauce. (the sauce was wonderful on the garlic mashed potatoes which I prepared the night before...I also made a broccoli casserole I found on this site and prepared the night before, too...just heated the side dishes 45 min. before serving time and they tasted great). I had six adults total and I had some leftovers of the tenderloin which is always better to have more than enough. One male guest must have had four slices of it...he raved about the meal. I made beef stew with the leftovers. I did take other suggestions and blended the shallots/bacon/sauce ahead of time. I fried the bacon earlier in the day and kept the grease in the pan and left the pan in my cooled garage for the day, and heated it up when I was ready to brown the tenderloin. Make sure you do some steps ahead so you're not spending all the time in the kitchen while your guests are there. All I can say is...if you really want to impress someone...make this meal! Just remember as many steps ahead as possible to save time! Expensive, but worth it for a special occasion!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNYBEEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/618393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-27T23:46:02.533Z",
                "reviewBody": "I made this for Christmas dinner this year & it was great.  I bought a 5 lb. beef tenderloin from Costco, cut it in half & froze the 2nd half.  I was serving 6 people & 2-1/2 lbs. was plenty.  While I was roasting the shallots I also roasted 3 heads of garlic with the tops trimmed off, drizzled with olive oil & some salt.  The garlic needs about 15 minutes more than the shallots to get really tender. I roasted the meat as directed but it took my piece closer to 45 min. to reach the desired med. rare temp.  The sauce worked beautifully.  I used ruby port.  I added the chopped bacon back to the sauce but opted to serve the shallots and roasted garlic next to the sliced beef on a platter so the kids(who don't like shallots) could enjoy the sauce on the garlic mashed potatoes.  This was my first beef tenderloin and it was as so tender you could cut it with a butter knife & extremely flavorful.  I saw some other reviewers recommend that you puree the sauce but I think that the texture of this sauce is intended to be somewhat thin and blending the shallots in would make it thick and lumpy.  I will definitely use this recipe when I cook the 2nd half!  UPDATE:  This sauce is my new favorite sauce recipe for any type of roasted beef.  It's very simple and you don't even need the bacon or shallots.  The last time I made it I used Zinfandel instead of Port.  I used it for sliced tri-tip and it was incredible.  It even reheats really well if you thin it just a bit with some water.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-16T15:21:23.313Z",
                "reviewBody": "The 1st time I made this was on 12/24/03 for 7 adults and 2 children. Everyone loved it! My 2 yr couldn't get enough.  Using 7 1/2 lbs of meat I had abt 1/3 leftover.  I read all the reviews & made some changes based on them.  I made the sauce the day before & I was glad I did b/c it had time to flavor through. I used cabernat instead of port and added a 2 TBLS of brown sugar to it. Definitely double the sauce.  I tripled it & had just enough.  DEFINITELY use as many shallots as the recipe calls for if not more, they are wonderful.  They MAKE this recipe.  I pureed half of the shallots after I had roasted them as others suggested and was happy with the outcome.  I added some minced garlic to the sauce as well. It was wonderful.  I did NOT add any salt.  Be sure to let your meat sit 15 min after coming out of the oven (tented) so the juices can reabsorb.  I served it w/ garlic roasted mashed potatoes & glazed carrots. I will defintely make it again EXACTLY as I made it this time.  Mushrooms would make a great addition for those who like them.  If you don't want to spend the cash on the tenderloin, the sauce would be fantastic on just abt anything.  I have made it many more times since then & it always turns out fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Makowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:09:32.64Z",
                "reviewBody": "This a wonderful recipe. I changed 2 things. I pulsed the roasted shallots in a blender for a few seconds so that the texture of the gravy was smoother and I made the gravy in advance and added the drippings from the roasting pan when the meat came out of the oven",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANCY THOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/244262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:07:57.857Z",
                "reviewBody": "Made this for a dinner party for ten. Used a \"prime\" tenderloin that was stratosphereicly priced but worth it for those special parties. I took the advice of other reviewers and served this with Jasmine rice to fully capture the sauce and a medley of steamed vegtables that were finished with \"burnt\" butter over the top just before placing on the plate. I also used beef broth with 50% less sodium. Much better with less salt than my trial run with this receipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GUYCHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-05T16:38:54.327Z",
                "reviewBody": "This was fantastic! The recipe sounds difficult but don't let it scare you. The first time around it takes some time to prepare but once you've familiarized yourself with the directions it's not hard at all! Also while tenderloin is great those of you on a budget can use any type of beef. Just let the salt and spice mixture sit longer so that it tenderizes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joel Perry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1784899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-08T04:34:45.593Z",
                "reviewBody": "This recipe was great! Everyone loved it. I also used red wine and brown sugar instead of port wine. I also put roasted mushrooms in it. I had a couple of people literally licking their plates! I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AANCIRA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/894576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T02:08:15.763Z",
                "reviewBody": "I just served this tonight for a dinner party and it was THE HIT!  My guests went crazy and said this was better than any fine restaurant.  I splurged and went with a beautiful tenderloin and it was worth it.  I served the filets with rice pilaf and roasted veggies.  This is a major winner and a definite keeper!  Oh, and I didn't have port wine, so I used a non-alcoholic red wine and a touch of brown sugar and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20753/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T22:11:43.047Z",
                "reviewBody": "The meat was tender but that's because it's 6 per pound tenderloin. The sauce was overrated. The shallots were yummy but I didn't like the port wine flavor at all. It was too overpowering. I cooked it down as stated and added it to the meat's drippings but my drippings did not amount to much since it seemed to evaporate as it cooked. Perhaps covering the meat or adding some (more) broth to the drippings would have diluted the strong grape flavor of the wine. Next time I'll opt for regular au jus.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DawnaForschler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5644870/"
                }
            }
        ]
    }
]