[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14608/slow-cooker-barbeque/",
        "name": "Slow Cooker Barbeque",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F517336.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-10-08T22:41:23.000Z",
        "description": "This is an old recipe my mom used to make for us kids. It is so good it almost melts in your mouth!  Serve on sub rolls.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT9H0M",
        "totalTime": "P0DT9H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (3 pound) boneless chuck roast",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "salt and pepper to taste",
            "1 (18 ounce) bottle barbeque sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place roast into slow cooker. Sprinkle with garlic powder and onion powder, and season with salt and pepper. Pour barbeque sauce over meat. Cook on Low for 6 to 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove meat from slow cooker, shred, and return to slow cooker. Cook for 1 more hour. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brandy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.583892617449664,
            "ratingCount": 745,
            "itemReviewed": "Slow Cooker Barbeque",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "343.5 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "73.6 mg",
            "fatContent": "17.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "20.5 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "895.2 mg",
            "sugarContent": "16.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-03-14T20:36:55.907Z",
                "reviewBody": "I make this all the time but keep meaning to rate this so here goes. I rate this a 5 with my alterations, otherwise it is a 4. I usually use a 4-5# roast, I use the recipe as listed plus I place a sliced onion on top. After this has cooked 6 - 8 hours or so, I take it out, drain the juice out, shred the beef and return to the crock pot. I then add another 18 oz of barbecue sauce and simmer it until whenever we are ready to eat, usually another one to three hours. Sometimes I buy the economy 32 oz of barbecue sauce and use 1/2 in the beginning and 1/2 after shredding. I have had best results with KC Masterpiece. I have one son that likes Sweet Baby Ray's but that is a bit sweet for most people's tastes. For work functions I cook this in the crock pot all day, come home, drain and shred, place meat in fridge. Next morning I add the meat plus the extra jar of barbecue sauce, take to work and put in slow cooker on low and it is served for lunch approximately 4 hours later. It gets RAVE reviews! This is highly requested and so simple! I can usually find roasts on sale for 1.79/lb plus so it is economical when feeing large crowds. Try this, I don't think you will be disappointed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-29T22:47:43.39Z",
                "reviewBody": "This recipe, was a HUGE hit with everone (60 ppl) at my party recently, and was the most requested recipe of all time for me.  For absolute success, I have two tips:  USE EYE ROUND ROAST! It's leaness allows the meat to slow cook for 8 hours without diluting the BBQ sauce with liquids from fat. After the meat is cooked and cooled, slice it thin and return it to the crockpot on low.  I used (4) 4 lb roasts cut in half. (Remember, 60 people and 4 crockpots!).  Half way through cooking time, I turned the sections over to allow them to cook evenly in the sauce.   Second, if you haven't spotted the Bourbon Whiskey BBQ Sauce recipe submitted by Kevin on this site yet, you should.  It's better than great.  This combination made the dish to die for.  All I could hear in the crowd was \"the barbeque beef is sooooo good\".  If you really want your cooking to please, this combo does the job.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T02:13:31.497Z",
                "reviewBody": "I used pork tenderloin instead of chuck roast.  I've used chuck roast for these types of recipes in the past and thought they were too fatty.  You end up having to pick out the pieces of fat and a lot of it cooks off into the sauce making it greasy.  I believe this is why a lot of reviewers felt they needed to replace the cooking sauce.  With the pork tenderloin there is almost no fat at all and the meat comes out super tender and easy to shred.  You can put it right back into the bbq sauce it cooked in which adds additional flavor.  No need to drain.  Perfect and easy!  Mine was tender enough to shred easily after 8 hours on low.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-17T20:23:19.42Z",
                "reviewBody": "So easy and if you follow other reviewers' tips (drain fat and a lot of the juice towards end of cooking time add new bbq sauce to the shredded meat then finish cooking for the last hour or half-hour) you'll have a great meal with little effort. You can use pork or beef and vary the kinds of bbq sauce for variety. Try one of the mustard-based sauces -- yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IHAVE2BOYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-26T02:28:55.58Z",
                "reviewBody": "TRY THIS! I bought a 3.5lb chuck roast, put it in the crockpot and seasoned with the onion and garlic powder and pepper as the recipe states. THEN, I poured Dr. Pepper (really!) over the roast until it was covered completely.  I then added a generous amount of salt to the liquid. The combination of the salt and Dr. Pepper really tenderizes the meat. Cook on low for 8 hours WITHOUT any BBQ sauce. Once the 8 hours is up, the meat literally falls apart on it's own! I discard all of the liquid mixture and shred the beef. Then, I add my BBQ sauce and mix together and leave the cooker on warm until it is ready to be served. It is phenomenal-a must try! I made my own BBQ sauce which is great too! Recipe for that follows: 1/2 tsp oil, 1/2 onion(minced), 1 clove garlic (minced),1/2C ketchup, 2 Tbsp worcestershire, 2Tbsp apple cider vinegar, 1/8 cayenne pepper, 1/2 cup Dr Pepper, brown sugar (if desired).  Heat oil in pan on medium. Sautee onion and garlic til soft & fragrant then add rest of the ingredients. Simmer for about 45 minutes (sometimes longer) until sauce thickens.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jlynns11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6380852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-25T21:20:39.827Z",
                "reviewBody": "We make this at least every two weeks, because its delicious and so easy. It makes the whole house smell good. If you live in or near Texas, I'd definitely recommend Stubb's Barbecue Sauce. I put half of a bottle in it all day.. then I pour most of this down the sink because there's alot of grease after it cooks all day. Then I shred it and pour the other half of the bottle on it at the end. Its delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "New Wife Julia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1473681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T14:40:55.443Z",
                "reviewBody": "I would give this more than 5 stars if I could! It is THE BEST recipe ever! Very easy and so delicious! I used about 4lbs of brisket and onion soup mix along with the bbq sauce and garlic salt. I live in the UK and it's hard to buy decent bbq sauce but I found some called New Orleans Smokey Blues and it's fan-tab-u-lous! I put it all in the slow cooker this morning before work and the house smelled so good when I got home! I'm actually still cooking it cause my husband wont be home until late. It's been in the cooker now for 13 hours and it seems the longer I leave it in the better it gets! (I've been picking it at all evening!) Thank you so much for an excellent recipe that if it weren't for my diet I'd make ALL the time!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAIDJILLIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-31T19:23:24.983Z",
                "reviewBody": "my boyfried loved this recipe!! i added real onions and minced garlic. I served it on onion rolls with cole slaw and provolone cheese! yummm! It was so easy...will make again soon!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TLMACK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T19:56:44.733Z",
                "reviewBody": "Superb! My husband took the leftovers to work heated it up in a bowl in the microwave and spooned it onto some crusty sub buns- he said the guys at work just freaked. The easiest tastiest thing in the world. I usually add my spices near the end; I find that the long cooking time destroys especially the garlic powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "meatball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-05T22:46:50.86Z",
                "reviewBody": "This just didn't turn out for me. I think it's all about the sauce & meat you use. I used Jack Daniel's and maybe it is just too thick to not have extra liquid. Also my meat was a leaner cut. After about 7 hours I had a burned sticky pile of inedible expensive ingredients. It was SO disappointing. It seems to have worked for others & my crockpot is not usually hotter than average so I think it comes down to the sauce & meat selected. I recommend making this (the first time) when you are able to check on it after 4 hours and adjust the liquid if needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Choculita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3346050/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Barbeque",
            "description": "See how to make super-easy, melt-in-the-mouth BBQ beef.",
            "uploadDate": "2014-05-22T21:08:46.597Z",
            "duration": "PT1M48.475S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2dbb27d4-f421-4098-9c71-260fcf13ea75%2Fdacd4d4f-68a6-4e9c-b0bd-8816984d026a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3582887113001"
        }
    }
]