[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14655/cola-pot-roast-i/",
        "name": "Cola Pot Roast I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F507811.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-10-11T18:03:32.000Z",
        "description": "Do not be intimidated by the time it takes to prepare a good pot roast.  After you get it simmering, it requires little attention. For a busy weekday meal, make it the night before, and simply reheat the next day. It will taste even better.  Thicken drippings as desired to make gravy.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (14.5 ounce) can stewed tomatoes",
            "1 cup cola-flavored carbonated beverage",
            "1 packet dry spaghetti sauce mix",
            "1 cup chopped onion",
            "¾ cup chopped celery",
            "1 ½ teaspoons salt",
            "½ teaspoon garlic salt",
            "3 pounds beef chuck roast",
            "2 tablespoons vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, break up tomatoes in their juice.  Stir in cola, spaghetti sauce mix, onion, celery, salt, and garlic salt. Stir until spaghetti sauce mix is dissolved.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a Dutch oven, over medium high heat, brown meat in oil about 10 minutes on each side. Drain off all fat. Pour tomato mixture over meat. Cover, and reduce heat to low. Simmer slowly for about 2 1/2 hours, or until meat is tender.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHRISTYJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4520547945205475,
            "ratingCount": 292,
            "itemReviewed": "Cola Pot Roast I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "324.2 calories",
            "carbohydrateContent": "12.2 g",
            "cholesterolContent": "77.3 mg",
            "fatContent": "21 g",
            "fiberContent": "1.2 g",
            "proteinContent": "21.1 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "1166.1 mg",
            "sugarContent": "6.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-11T16:24:50.95Z",
                "reviewBody": "I only used this recipe because I had all the ingredients on hand not because I thought it sounded good. My expectations were low thinking it would taste like spaghetti flavored pot roast. Oh my goodness was I ever wrong. This is a new family favorite and we eat it at least once a month with mashed potatoes and a salad. Picky eaters in our family approve as well. I cook mine in the crock pot on high for 4 or 5 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AllyJo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1130395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T13:26:15.793Z",
                "reviewBody": "Corrected-This recipe works folks.  My five guinea pigs were all pleased...and that's not easy to do!  Here's the options:  fresh tomatoes rather than stewed, they stew fine during the two hour+ cooking time.  This last time, I used three large juicy red tomatoes, chopped (for those of you gardener-cooks, you will be pleased to note that yellow pear, sweet grape, and heirloom orange all work wonderfully; tomato paste 3-6 TBLS, 1-2 tsp. italian seasoning, + S&P work well instead of a spaghetti packet; 1/4 cup dried minced onion, and add 1/2 cup water or cola instead of fresh onions if there are none available in your pantry.  However if you use fresh onion, chop them nice and small so they cook thoroughly...it's not very nice to chomp into rubbery onion; and I have found it best to use a non-stick dutch oven with a very low simmer(careful those of you with propane),unless you like a black-eyed pot roast! Your other option is of course the crock pot! 8-9 hours on low, 5-6 hours on high, no blackening required. For my LOW CARB cook mates: Count your spaghetti packet as carbs, or use the above tomato paste option; exchange the one cup regular cola with a splenda sweetened cola like Diet Rite, which keep the cola and sweet taste during the simmering.  Neither Aspartame, nutrasweet,or equal will simmer. Enjoy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "a pinch of this..",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/969470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-07T21:59:32.61Z",
                "reviewBody": "Superb!  I didn't substitute any ingredients at all.  I did use my crockpot, though.  Just dumped everything and let it go without bothering to brown the meat or anything.  It was soooo good!  Best pot roast I've ever had!  I've made this several times now and it always gets my family's rave reviews!  Couldn't be easier or tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OneSweetShannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-10T03:18:06.06Z",
                "reviewBody": "This was delicious but I went Mexican instead of Italian. Instead of dry spaghetti mix I added dry taco seasoning deleted the celery and added minced garlic. When the meat was falling apart I shredded it and mixed it with green chilis sour cream green onions and cheese. I made enchilada sauce with the remains from the braised meat. I blended it up with some hot sauce and it was delicious. I poured the sauce on the bottom of a baking dish and then rolled the meat mixture into tortillas covering it with the sauce and some extra cheese. I baked it for about 30 minutes at 350. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KWALTON24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1347416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T21:30:07.373Z",
                "reviewBody": "Made this the day before( because at the last minute we got a chance to go out to dinner!)\r\nA while before serving I took out meat and cut up and then put back in the sauce. I had also added some lonely carrots when I chopped other veggies for the sauce. There is no taste of spagetti sauce in the end.I also used spicy tomatoes (like Rotel). Boiled new potatoes and then smashed them with garlic and butter and served meat and gravy over them. My husband was in a swoon. He took it to work the next day for lunch and called me after he ate it to compliment me. In 31 years that has never happened before!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EUROMOM98",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/505858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-21T01:38:15.39Z",
                "reviewBody": "This was awesome!  I don't even like pot roasts, but I try to make them for my family because they're easy to do.  Mine usually come out dry--even in the crock pot.  This was so moist and had a great flavor.  It does make a lot of gravy, so I'm thinking you could even use a 4 or 5 lb roast with this. As mentioned by some other reviewers, I thought this was going to end up like a roast in spaghetti sauce, but I couldn't have been more wrong.  Give this one a try!  This one will definitely be in my recipe rotation from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missy1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/735878/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-27T17:37:35.623Z",
                "reviewBody": "This recipe was so easy and delicious. I baked it in 9x12 glass baking dish covered tightly with aluminum foil for 4 hours at 275 degrees and it came out perfect falling apart and juicy. When the meat was done I removed it from the glass dish strained juices into skillet I browned the meat in added about 2 tablespoons flour and made a fantastic gravy. I would definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jamielee89",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/265485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-09T19:04:15.263Z",
                "reviewBody": "This was very good and extremely easy to make. It does have quite a sweet sauce which doesn't go over well with everyone (I made a side of brown gravy to placate the finicky). I also found the sauce it a tiny bit salty - a little goes a long way. All in all a great recipe and may try it again using ribs instead of the roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bronte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/958857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-11T21:49:43.81Z",
                "reviewBody": "Even though this recipe requires more than two hours I find it easy and quick. I don't have to stand by the stove for two hours it only takes about half an hour to prepare and the remainder of the cooking time can be used to prepare other dishes (potatoes bread etc.). The time can also be used to fix up the place before dinner. I also like that I only use two large dishes one to mix the sauce and the pot to brown/cook it. Most of the people I served it to including the kids liked the roast because it was not too spicy and the flavor of the meat was not overpowered by any one ingredient.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANAMOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/83721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T21:37:35.113Z",
                "reviewBody": "I was a bit adament about trying this recipe. I did out of curiousity more than anything. Although I appreciate the recipe submission this is one I will not be making again.I followed the recipe to the letter but unfortunately I found it to be way to sweet. I will keep making my pot roast the way I always do until another one recipe strikes my fancy....Thanks again for the recipe as others have odviously enjoyed it...:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "BlyJean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2493776/"
                }
            }
        ]
    }
]