[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14611/spicy-orange-beef/",
        "name": "Spicy Orange Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3991750.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-10-11T19:03:21.000Z",
        "description": "This stir-fry is a good weekday dinner recipe. It can be made in about the time it takes to make a pot of rice to serve with it.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "1 pound round steak, cut into thin strips on the diagonal",
            "¼ cup orange peel, cut into slivers",
            "1 clove garlic, minced",
            "½ teaspoon ground ginger",
            "2 tablespoons cornstarch",
            "1 cup beef broth",
            "¼ cup soy sauce",
            "¼ cup sherry",
            "¼ cup orange marmalade",
            "½ teaspoon crushed red pepper flakes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a wok or skillet, heat oil over medium-high heat. Add beef strips 1/3 at a time. Stir-fry for 3 minutes or until browned, removing the done pieces to a plate lined with paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return all the beef to the wok. Stir in orange peel, garlic, and ginger; stir-fry 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine cornstarch, broth, soy sauce, sherry, marmalade, and red pepper. Pour this mixture into the beef, stirring constantly. Bring to a boil over medium heat and cook for 1 minute. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "CHRISTYJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.042763157894737,
            "ratingCount": 304,
            "itemReviewed": "Spicy Orange Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "397.3 calories",
            "carbohydrateContent": "22.7 g",
            "cholesterolContent": "72.6 mg",
            "fatContent": "22.3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "24.9 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "1263.3 mg",
            "sugarContent": "12.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-22T16:22:10.45Z",
                "reviewBody": "This was one of the best things I have ever made.  My husband kept commenting on how good it was through the whole meal.  I read all the reviews and made some changes:  I omitted the orange peel, substituted 2 tsp of sesame oil for the 2 tbl vegetable oil, used 3 cloves of garlic, substituted 1 tsp candied ginger (minced) for the 1/2 tsp of powdered ginger, I used orange juice in place of the sherry, used \"sweet orange marmalade,\" and added 2 tsp brown sugar to the sauce.  I marinated the beef in 1 cup of orange juice for several hours (this helped tenderize it).  I drained the beef and then stir fried it in 1 tsp sesame oil.  I removed the beef, drained out the juices, added another tsp of sesame oil to the pan and then stir fried red bell pepper (cut in strips), broccoli, and carrots (cut in strips) until just tender, then I added the garlic and ginger, stirred, then added the beef back to the pan.  I immediately poured in the sauce.  Just before removing from the heat, I added snow pea pods and green onions.  I served it over brown rice.  This was an awesome one dish meal.  I used about 9 ounces of meat, so my version served two large portions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Miller Motley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cook4mycrew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-19T23:52:00.81Z",
                "reviewBody": "I'm so glad I read the other reviews because with a couple slight changes this is an awesome dish!! I left out the orange zest used stated amount of marmalade. I upped the garlic slightly and doubled the amount of red pepper because we like very spicy food. And I added fresh mushrooms and carrots after the meat was done cooking. The orange flavor is subtle and the sauce is thick sticky and delicious over rice. I would like to know if there's a reason you're supposed to cook the beef in batches? I cooked it all at once then drained the liquid from the wok then returned the beef and veggies to the wok and finished cooking and it was fine. BTW this would be even better with chicken. I think another reviewer said this was like eating at a good Asian restaurant -- I got that same impression! You have to try this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Magill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/477960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-05T20:26:05.92Z",
                "reviewBody": "A really great recipe though I did make a few modifications. Firstly the 1/4 cup of orange peel seemed a bit scary so I took a prior reviewer's advice and made very wide strips of peel so their flavor came through but you didn't get mouthfuls of peel in every bite. I used fresh ginger instead of ground. After browning the beef and before adding in the peel garlic and ginger I added 1/2 cup of sliced onion and cooked a few minutes before continuing with the rest of the recipe. And finally I threw some snow pea pods in at the end to add some color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-15T17:15:10.483Z",
                "reviewBody": "I read the previous reviews and sort of incorporated all types of things. I used round steak and I cut it into thin strips marinated it in soy sauce garlic red pepper flakes and the juice of one orange. I then stir fried it adding in the ginger and 4 big chunks of orange peel. Then I added the broth soy sauce red pepper flakes cornstarch and orange marmalade mixture. This was OUTSTANDING!!!!!! Next time I think I will use a different cut of meat but other than that...oh and I also added shredded carrots and water chestnuts...very VERY good. I will also add broccoli next time as that would just make it over the top wonderful. Thank you so much for this recipe and the suggestions by those who came before me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "YAHMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/406864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:38:40.14Z",
                "reviewBody": "If I make this again I'll skip the orange zest-it made the orange flavor very overpowering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-31T16:59:58.937Z",
                "reviewBody": "This recipe was very good.It sure was easy and fast. Perfect for during the week. The only thing I did not add was the orange zest my husband loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLSON7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/60640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T21:04:41.48Z",
                "reviewBody": "I have to go with the majority on this recipe I thought it was just wonderful. I too did not put in the orange zest as suggested by many of the other reviewers and I think the orange taste was strong enough. I fried the beef in a little sesame oil and added in some thai chili paste (hot hot hot! I add this to almost every meat I stir fry) and only added scallions for vegetables. I doubled the amount of sauce next time I will probably just do 1 1/2 times the sauce unless I add more vegetables. The sauce thickened up immediately after putting it in the hot pan definitely do not walk away from it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-30T17:44:24.28Z",
                "reviewBody": "This recipie was great. I followed the advice of others and just used large chunks of orange peel. I stir fryed the orange peel with fresh grated ginger garlic onions and carrots. Then I pulled out the orange peel and added the remaining ingredients. I also didn't have any cornstarch and just used a couple of spoons of flour to thicken it up. Will definately make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZKANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1161686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-28T05:07:38.153Z",
                "reviewBody": "We all really loved this recipe. I left out the zest and doubled the marmalade. I also added green onions and sugar snap peas and served it over white rice...it was delicious! I also printed out the recipe and gave it to my grandmother (she's an awesome cook) and her whole household loved it as well. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOLFANCHICK1027",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/77060/"
                }
            }
        ]
    }
]