[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/650/meat-and-poultry/chicken/fried-chicken/",
                    "name": "Fried Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16573/chicken-fried-chicken/",
        "name": "Chicken Fried Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3651781.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-10-14T22:57:33.000Z",
        "description": "A fun chicken recipe the kids can help prepare. They love crushing the crackers. It does not matter if the measurements aren't perfect, just wing it!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "30 saltine crackers",
            "2 tablespoons all-purpose flour",
            "2 tablespoons dry potato flakes",
            "1 teaspoon seasoned salt",
            "½ teaspoon ground black pepper",
            "1 egg",
            "6 skinless, boneless chicken breast halves",
            "2 cups vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place crackers in a large resealable plastic bag; seal bag and crush crackers with a rolling pin until they are coarse crumbs. Add the flour, potato flakes, seasoned salt, and pepper and mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg in a shallow dish or bowl. One by one, dredge chicken pieces in egg, then place in bag with crumb mixture. Seal bag and shake to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry chicken, turning frequently, until golden brown and juices run clear, 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Fried Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CASSJW"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.644844517184943,
            "ratingCount": 2444,
            "itemReviewed": "Chicken Fried Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "886.6 calories",
            "carbohydrateContent": "14.2 g",
            "cholesterolContent": "102.9 mg",
            "fatContent": "79.6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "29.2 g",
            "saturatedFatContent": "11 g",
            "servingSize": null,
            "sodiumContent": "389 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-18T01:59:12.23Z",
                "reviewBody": "I like the flavor of the coating!  I do have one suggestion.  I tried applying the coating the way the recipe calls for (just dip in egg then coating), and also the way I learned in culinary school (dip in flour, then egg, then coating).  The latter method was much better the chicken was crispier and much juicier.  I will probably make again - thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "carla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1705347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-26T15:45:22.513Z",
                "reviewBody": "This is better than the fried chicken from this site's Hall of Fame fried chicken recipe.  The crust was thick; it stuck too the chicken and browned beautifully.  I added extra spices like recommended by other reviewers: 1T seasoned salt (probably any salted spice would work that had paprika and spices), 1T of garlic powder and several variety of crackers (I didn't have any saltines).  Taste the coating, if it is pungent then it probably won't fade.  I used 2 eggs and probably 10 skinless boneless breasts.  I pounded the breasts in a plastic ziplock bag with a little water so they cooked more quickly.  I think one of the KEYS is to keep the oil hot like the recipe states, then turn it down.  Every time I added new cold pieces of chicken I would turn the flame up to high, get the oil rolling then turn it down to 3.  Also cook the chicken to a dark brown, not light golden brown.  Fried chicken is not a quick and easy thing to do so I would recommend doubling this recipe because this chicken is great the next day cold.  I always double the size of my recipes, so if you too want some good recipes that are for a large family look to my other reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/892455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-20T23:17:07.47Z",
                "reviewBody": "Yum! In case you are wondering, a regular box of saltine crackers has approximately 36 crackers in a sleeve. I put all 36 crackers from the sleeve into my food processor and ground them fine. I added this, the flakes, flour, 1 T of seasoning salt, 1 tsp of pepper, 1 tsp of parsley, 1 tsp garlic powder, 1/2 tsp paprika. I pounded the chicken breasts between two pieces of wax paper on my cutting board, dredged the chicken in 2 beaten eggs and then coated them with the cracker mixture. I placed them in a 13x9 glass dish and baked for 45 minutes. I then melted one stick of butter and poured over the chicken breasts and baked for an additional 5 minutes. We like our chicken extra done. This had a great taste and texture without the bad for you frying! Thank you. Note: This chicken tastes delicious leftover cold the next day!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-13T08:52:14.063Z",
                "reviewBody": "Fabulous! I can't stand it when people complain about \"lacking flavor\" with recipes such as this; common sense would tell me that not everyone's idea of \"flavor\" is the same and if it's \"lacking flavor\" then do something about it... salt, pepper, hot sauce, etc. I don't think it's right to give something a low rating just because it isn't EXACTLY how one person expects it to be... sorry, I just HAD to finally say something! LOL. I used all the ingredients called for and as per one user's suggestion about NOT turning frequently, I took their advice and let the chicken cook for a full 5 or 6 minutes before turning over. I then flipped the chicken and cooked for another 5 or 6 minutes and then continued to flip the chicken over for another 3 minutes on each side. The end result was juicy and evenly coated chicken that turned out to be the best tasting chicken I've ever had. My entire family is now in love with the taste and I definitely look forward to making time and time again! Aside from the great taste, I thoroughly enjoyed the mess-free factor of using the ziploc bag to do all the coating and the crackers of course were so much easier to deal with than just a basic flour coating. I think at some point in the future I will perhaps try adding a bit of a ranch powder packet in with the rest of the coating mix. This is definitely a 5 star recipe that I highly recommend trying! **Note, I used thinly sliced chicken tender type slices**",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lonnarific",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T23:07:45.077Z",
                "reviewBody": "Great recipe. I like my chicken thin- so the secret of pounding the chicken breast is to take a plastic bag-(gallon sized is good )& sprinkle the inside with a little water. Then place the chicken breast inside & close the seal & then you can use a mallet to pound it down with no mess. Works like a charm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/180204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-15T16:44:19.61Z",
                "reviewBody": "Whoa, there Nellie!  This is GREAT!!!!  Had CFC from the local Chili's and looked for a recipe on this website and honestly...it's just as good.  You do need to add a little more seasoning to the flour/crax mixture though.  I added another couple of tblspoons of potato flakes, tripled the seasoning salt, added garlic powder and a tad bit of poultry seasoning.  Have made this twice in three nights (per boyfriend's request!).  First time, really pounded down the chicken - cooked very quickly and was really good.  Didn't pound chicken quite so thin second time and it was more juicy, although definitely need to turn it over several times while cooking.  Play around with the spices....don't leave the potato flakes, crackers or flour out...it makes a very tasty, crunchy crust!  Will add to my \"favorites!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1927952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-19T03:37:09.78Z",
                "reviewBody": "I don't think this chicken could be any better. Another reviewer compared this to Chili's chicken fried chicken -- no way-- this is better! I made it for a dinner party tonight and was so proud of it. Everyone raved about the chicken, and one person left with the recipe.\nI pounded the chicken thin the night before and seasoned it with seasoned salt before soaking it in buttermilk overnight (makes it really juicy).\nI didn't think the breading was enough so I added another half sleeve of crackers, more potato flakes, lots more seasoned salt, garlic powder, and pepper. Good thing I did-- I had just enough.\nGreat served with garlic smashed potatoes and green beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EChambers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2000978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-16T02:05:29.937Z",
                "reviewBody": "This recipe is amazing!!!  I made it last night for dinner and my husband said \"ummmm----\" with just about every bite.  I used cracker meal sold in the store near the shake and bake.  It is a box full of crushed crackers, so that helped me save on prep time.  I had two zip lock bags, one with flour and seasoning and one with the mixture of cracker meal, potatoe flakes and seasoning.  I just kind of eye-balled it, but I used enough flour and cracker/potatoe mixture to completely coat the chicken.  The chicken breast I used were thick, so I sliced them down the middle to butterfly them and beat them like some people recommended until they were thin.  (The only thing I could think to beat it with was the back of a cookie scooper, since I don't own a meat mallet.) I was surprised that the chicken coating stayed in tack.  The secret is the order that you use to bread the chicken as stated by a few members.  1. Cover in flour 2. Cover in egg 3. Cover in cracker meal/potatoe flakes.  It was absolutely delicious.  Thank you very much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Q2GGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T15:41:55.167Z",
                "reviewBody": "Excellent.  I used skinless on the bone chicken.  I had already made the coating when I realized I did not have eggs to coat the chicken so I used RANCH.  The chicken turned out wonderful.  The coating stuck so well you would have thought the chicken had skin. Very tender meat. I will make again and again, my kids and husband loved this...said it was their favorite.  We are health freaks so I liked that this used very little oil.  Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Learning2CookInSC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2258372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-28T18:17:07.530Z",
                "reviewBody": "People, don't do skinless, boneless. That is another way to say 'tasteless and dry'. Use cut up pieces, with bone and skin. Season it lightly first with salt and pepper. Then do this: \n\nIn bowl, put 2 cups flour and add 1tsp salt, 1tsp garlic powder, 1tsp pepper. \n\nIn another bowl, beat 3 eggs, 1/3 cup milk and 1/3 cup water. \n\nIn a third bowl, put 2-3 cups panko or seasoned/unseasoned bread crumbs.\n\nIn large deep skillet, heat 1 cup oil till hot. \nDip chicken in flour, then egg, then crumbs. Let sit for 3-5 minutes.\n\nAdd to skillet - don't crowd. Careful, not too hot-keep heat medium high. Season crumb coating lightly with pepper, garlic powder and little bit of paprika. Cook 5 minutes - till golden, turn over and cook another 5 minutes. Now the trick. Remove all chicken (not fully cooked) - to cookie sheet. Put in oven set at 350. Bake for 30 minutes. Remove and let sit for few minutes. This process gives the good fried taste, but doesnt cook it too long so it doesnt burn or dry out - it stays very moist. Bon apetite!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6500877/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Fried Chicken",
            "description": "Have the kids help you make this tasty fried chicken recipe.",
            "uploadDate": "2012-05-30T04:58:19.126Z",
            "duration": "PT2M34.946S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffb671315-8b96-42bc-bdcb-c11014d42b37%2F91482ca5-8b6c-43d5-900f-1ab867c82b41%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1662289764001"
        }
    }
]