[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
                    "name": "Protein",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/270/everyday-cooking/vegetarian/protein/tofu/",
                    "name": "Tofu",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14113/tofu-turkey-i/",
        "name": "Tofu Turkey I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F365677.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-10-16T21:21:55.000Z",
        "description": "A vegan alternative especially good for Thanksgiving dinner! Serve with a vegetarian gravy and all the fixings. Enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "5 (16 ounce) packages extra-firm tofu",
            "2 tablespoons sesame oil",
            "1 red onion, finely diced",
            "1 ⅓ cups diced celery",
            "1 cup chopped mushrooms",
            "2 cloves garlic, minced",
            "⅛ cup dried sage",
            "2 teaspoons dried thyme",
            "salt and pepper to taste",
            "1 ½ teaspoons dried rosemary",
            "¼ cup tamari",
            "3 cups prepared herb stuffing",
            "½ cup sesame oil",
            "¼ cup tamari",
            "2 tablespoons miso paste",
            "5 tablespoons orange juice",
            "1 teaspoon honey mustard",
            "½ teaspoon orange zest",
            "3 sprigs fresh rosemary"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a medium sized, round colander with a cheese cloth or a clean dish towel. Place the crumbled tofu in the colander. Place another cheese cloth over the top of the tofu. Place the colander over the top of a bowl to catch the liquid. Place a heavy weight on top of tofu. Refrigerate the colander, tofu and weight for 2 to 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the stuffing: In a large frying pan saute onion, celery and mushrooms in 2 tablespoons of the sesame oil until tender. Add the garlic, sage, thyme, salt and pepper, rosemary and 1/4 cup of the tamari. Stir well; cook for 5 minutes. Add prepared herb stuffing and mix well. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Grease a cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1/2 cup sesame oil, 1/4 cup tamari, miso, orange juice, mustard and orange zest in a small bowl; mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the weight from the tofu. Hollow out the tofu so that there is one inch of tofu still lining the colander. Place the scooped out tofu in a separate bowl. Brush the tofu lining with a small amount of the miso seasoning. Scoop the stuffing into the center of the tofu shell. Place the leftover tofu on top of the stuffing and press down firmly. Turn the stuffed tofu onto the prepared cookie sheet. Putting the leftover tofu side of the \"turkey\" (the flat side) down. Gently press on the sides of the \"turkey\" to form a more oval shape.  Brush the tofu turkey with 1/2 of the oil-tamari mixture. Place the sprigs of rosemary on top of the tofu. Cover the \"turkey\" with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for one hour. After one hour, remove \"turkey\" from the oven and remove the foil. Baste the \"turkey\" with the remaining tamari-oil sauce (reserving 4 tablespoons of sauce). Return \"turkey\" to oven and bake another hour or until the tofu turkey is golden brown.  Place the tofu turkey on a serving platter, brush with the remaining tamari-oil mixture and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian",
            "Protein",
            "Tofu"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Becky"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1692307692307695,
            "ratingCount": 65,
            "itemReviewed": "Tofu Turkey I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "469.5 calories",
            "carbohydrateContent": "22.4 g",
            "cholesterolContent": null,
            "fatContent": "32.4 g",
            "fiberContent": "2.8 g",
            "proteinContent": "26.7 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "1294.9 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-25T13:59:35.373Z",
                "reviewBody": "I was very impressed with the way this turned out. I served it for Thanksgiving to 9 meat eaters and EVERYONE said it tasted like turkey! I couldn't believe it. I have been vegetarian for 10 years so tasting like turkey wasn't really the goal. I did make some changes: after reading the suggestions in this section I first boiled the tofu in some vegetarian chicken flavored stock then processed it in a blender then pressed it with the weight overnight. I also substituted Bragg's Liquid Aminnos for Tamari and regular boxed stuffing mix for the stuffing; I also left out the rosemary as I didn't have any. I cooked the tofu turkey WITH the foil for about 3 hours reappling the glaze every 30 minutes or so. I also cooked it on parchment paper instead of greasing the pan so it didn't burn. It was really good: it looked and tasted like turkey! I also recommend the vegetarian gravy to serve with this (or mashed potatoes!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Can Can",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1634123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-21T00:06:19.49Z",
                "reviewBody": "I read the reviews of this recipe and thought ok this sounds good. I took the time to fix this for Thanksgiving and I don't plan on making it again. First of all the amount of Tamari used in this recipe makes the stuffing too salty. I even reduced the amount and added water to cut it down a bit. Furthermore the recipe calls for table salt? I had enough sense not to add any. Second the cooking time is way too long. 2 hours at 400 F? Come on get real. After only one hour the sugars in the marinade (from the OJ) started to burn. Third despite pressing the tofu with 35 lbs of weight overnight the texture was still spongy. Finally the tofu naturally bland never picked up any flavors from the stuffing and marinade. Bland AND spongy?!? My plan is to give a shot at a 12 Tofurky (the real deal) and see if it is better. It would certainly be a whole lot cheaper and easier to fix. Tofurky's giblet gravy is good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TECHNOPHILIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/123101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T23:06:14.307Z",
                "reviewBody": "The main thing here is- you need to have plenty of prep time. I personally have had fabulous results everytime I have made a Tofu Turkey for my daughter and myself. First off- I press the tofu overnight the night before Thanksgiving- usually for at least 12 hours so it really firms up. Then I hollow it out and add the stuffing (I use a really good natural stuffing that Whole Foods sells and add celery and other good stuff but do not ever add extra salt- there is plenty of that in the recipe as is. Once stuffed I then refrigerate it again for a few hours so it firms nicely and can be turned out into the cooking vessel. It's important to keep it covered with foil (hate using aluminum foil but what else can ya use?) and keep marinating it (I add apricot jam to the marinade and it really makes a lovely color and taste) often but COOK at low heat- I do it at 300 for about 2 hours so it won't burn. Serve with organic cranberry sauce and natural vegan gravy- mashed organic russett potatoes and organic yams...YUMMO!! I also make a vegan pumpkin pie made with silken tofu- recipe easy to find online. Happy Thanskgiving!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jnoller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2610185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-23T21:09:15.06Z",
                "reviewBody": "I made this for Thanksgiving and although it was a lot of work it tasted soooo good! I definitely recommend starting early crumbling the tofu AND pulsing it in the food processor until really smooth then draining it. Works much much better! My whole family tried it and couldn't believe how good it was. Yes! This is a thanksgiving staple!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHOPPNBROCCOLI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/442502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T19:29:13.043Z",
                "reviewBody": "i write a mixed review the dish takes a while but is easy (a tad bit expensive). I didn't use her stuffing recipe but did follow the tofu/body part. don't hollow the tofu out create the interior cavity as the refrigerated tofu is being pressed by placing a round bottomed bowl in the tofu as a form. The tofu also needs a better marinade recipe it was pretty wimpy (and salty). I also tried to impregnate the tofu w/herbs & soaked it for a long long time and that seemed to work better. good luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ELECTRIFYINGMOJO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/498072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-27T04:02:08.563Z",
                "reviewBody": "I really loved this but I had to tweak it quite a bit to get it how I liked it. I do not like Celery so I used extra garlic. I don't use miso so I used sweet and sour sauce and teriayki sauce. I did not use orange juice or zest. I used Honey dijon. I used wine and red wine vinegar. It is delicious and much better than anything I have had as a vegetarian. My Dad loves it and he is 83 years old! I steeped the tofu in sesame and soy sauce then put it in the colander. You can't cook it as long as it says it burns. So watch it carefully. It really is the best and you should try it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Raven",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2228138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-23T16:18:30.67Z",
                "reviewBody": "This dish is terrific. This is the 3rd (or 4th) year that I have made this dish for my family. There are a few things that I have learned that have helped me out. 1) For time I use a prepared stuffing. Since this is usually salty I try to minimize excess salt in other places. 2)I use a pizza pan it looks like a big mound but since I am usually cooking for 8-10 the shape doesn not matter. You have to take it easy on the marinade one time it was a little to salty taste first. My family loves this dish. My Grandmother MADE me bring her a piece and she had two \"real\" turkeys at her house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKB20",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/149231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T21:06:53.78Z",
                "reviewBody": "This recipe is AWESOME!Very easy especially after the first time. The meat eaters at thanksgiving ALWAYS eat all our tofu turkey! I make two now. My children who are vegans love it too. And when it comes just out of the oven look out!:-) I have been making it now for three years and am always asked by the meat eaters if I'm bringing the tofu turkey.:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVETOFU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/51178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-06T04:52:48.06Z",
                "reviewBody": "This is very good. The first time I made it the bottom cooked too much and couldn't be eaten. I lowered the temperature to 350 the first hour and 375 the second. I think 375 for both hours would be fine. It has very good flavor. It makes extra dressing which I circle around the \"bird\" and it makes a good presentation. Be sure to cover the \"bird\" with foil for the second hour too. It has great taste and isn't hard to put together. Add a little cranberry sauce and veges and you're set. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DABDAB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1322808/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Tofu Turkey I",
            "description": "See how to make a vegetarian tofu turkey for Thanksgiving.",
            "uploadDate": "2013-07-19T19:42:18.802Z",
            "duration": "PT3M59.531S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F454dc3bc-dc7c-4f0e-84db-c538c95f5237%2Fbb3e1f6b-bb1c-4cd7-9517-56502ef3db8e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555495678001"
        }
    }
]