[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/496/side-dish/sauces-and-condiments/sauces/pasta-sauces/",
                    "name": "Pasta Sauces",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/565/side-dish/sauces-and-condiments/sauces/pasta-sauces/meat-sauce/",
                    "name": "Meat Sauce",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14784/north-italian-meat-sauce-ragu-bolognese/",
        "name": "North Italian Meat Sauce (Ragu Bolognese)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1059039.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1999-10-19T20:07:00.000Z",
        "description": "This recipe comes from Bologna, Italy. One unusual characteristic of this sauce is that there is no garlic in it--but there is a hint of ground nutmeg. Serve over hot cooked pasta.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "3 1/2 quarts",
        "recipeIngredient": [
            "4 tablespoons butter, divided",
            "4 ounces pancetta, diced",
            "1 cup diced onion",
            "1 cup chopped carrot",
            "½ cup chopped celery",
            "2 tablespoons olive oil",
            "¼ pound lean ground beef",
            "12 ounces lean ground pork",
            "½ cup white wine",
            "2 cups beef stock",
            "2 tablespoons tomato paste",
            "½ pound chicken liver",
            "1 cup heavy whipping cream",
            "1 pinch ground nutmeg",
            "1 teaspoon salt, or to taste",
            "½ teaspoon freshly ground black pepper, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, melt 2 tablespoons butter over medium heat. Add pancetta, onion, carrot, and celery and cook, stirring often, for 10 minutes or until lightly browned. Transfer to a heavy large saucepan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In same skillet, heat olive oil. Cook ground beef and pork over medium heat, stirring to break up any lumps, until browned. Pour in the wine, increase the heat and boil briskly, stirring constantly, until almost all of the liquid has evaporated. Transfer ground meat mixture to the saucepan with the pancetta and vegetables. Set skillet aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the beef stock and tomato paste into the saucepan. Bring sauce to a boil over high heat, then reduce the heat and simmer, partially covered, for 45 minutes, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt remaining 2 tablespoons of butter over medium-high heat in the original skillet. Add chicken livers and saute for 3 to 4 minutes, or until firm and lightly browned. Remove livers from skillet and dice. Set aside and add to sauce 10 minutes before it is done. A few minutes before serving, stir in the cream and let it heat through. Season sauce with nutmeg, salt, and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Pasta Sauces",
            "Meat Sauce"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.507246376811594,
            "ratingCount": 69,
            "itemReviewed": "North Italian Meat Sauce (Ragu Bolognese)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.3 calories",
            "carbohydrateContent": "1.9 g",
            "cholesterolContent": "58.5 mg",
            "fatContent": "11.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "167.4 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-04T21:29:15.643Z",
                "reviewBody": "Great tasting sauce! I left out the chicken livers so I increased the amount of ground beef and ground pork to make up for it. I used a whole small can of tomato paste. The longer this simmers the better and adding the cream and nutmeg at the end really does make a difference. I served it over linguine and boy was it delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-28T01:18:42.403Z",
                "reviewBody": "Recipes for Bolognese sauce abound - they  are as abundant and as varied as there are Italian cooks.  Outside of a few fundamentals, there is no real right or wrong.  First and foremost, it is a meat sauce, not a tomato sauce.  It typically includes a soffrito (carrots, onions and celery) ground beef, veal, and pork (or some combination), white wine and/or beef or chicken stock , a small amount of tomato paste and whole milk.   All variations will include long, slow cooking  to develop full-bodied flavor - I simmered mine a good three hours.  This recipe is a good one, albeit slightly different with its inclusion of ham, chicken livers and nutmeg (certainly a nice touch, but not necessary), all of which I omitted only because I preferred to.  I did add garlic.  I used half beef and half pork, but would have used veal and pork had my butcher had veal available.  I also used the more traditional whole milk rather than heavy cream, adding it along with the tomato paste once the vegetables and meat were cooked, then simmering it slowly until most was absorbed before adding the wine and broth and letting it cook down again.  This recipe is as good and as authentic and reliable as any I've come across and leaves room for personal adaptation and tastes. Having had pasta Bolognese twice just recently in Rome, Italy as well as at a fine Northern Italian restaurant in Naples, FL just a few nights ago,  Hubs and I agree what we ate tonight was better than all of them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-04T13:59:32.483Z",
                "reviewBody": "This is so rich and lovely and filling and beautiful!  Just gorgeous gorgeous stuff.  I make a HUGE potful and eat it for lunch and dinner for three days in a row.  And when it's gone I want to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SOGOLONDJATA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/773264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T00:39:34.217Z",
                "reviewBody": "This is a great Bolognese!  I agree with a previous review that a Cuisinart really helps with the chopping.  The last time I made this I adapted it to what I had around the house and my husband liked it even more.  I used 6 slices of bacon instead of ham (getting the bacon mostly cooked before adding veggies, and not adding any butter or oil because of the bacon fat).  I used Hot Italian Pork sausage instead of ground pork (caseings removed, you could even use veal like the traditional bolognese). For ease, in place of the white, stock, & paste, I used a 26 oz. jar of Classico Cabernet Marinara.  I also cut down the cream to 1/2 cup and left out the nutmeg. It was so thick and so delicious!  You can add a little more jar sauce to thin it out.\r\nYUMMY!  I will definitely make this again.  Recipes are best when you can toy with them a little and it still comes out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Baker Horgan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1030871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-23T01:52:03.777Z",
                "reviewBody": "If you're looking for a red sauce, this is not it!  It's very rich, very very good.  I don't do the chicken livers anymore - not a fan.  A cuisinart definitely helps in the chopping!  This isn't a saucy sauce, either, by the way, but I loved the depth of the flavor.  This sauce freezes extremely well - I froze it with the mini rigatoni(single servings), and by microwaving it, the sauce soaked into the rigatoni (my favorite for bolognese sauces).  My boyfriend asked if I kept the recipe and you can *BET* I will definitely now!  He usually never utters more than 'yeah it's ok'.  I've completely replaced the mushrooms and for the onion which tasted great, and chopped ham for the pancetta. THANK YOU!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARDUST_331",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stardust_331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T13:33:38.76Z",
                "reviewBody": "I have made this recipe many times with great success. I usually follow the recipe amounts and procedures precisely, but after the first time around I leave out the chicken livers. It's just as good without them. I buy the beef and pork in whole chunks, trim them of fat, and chop them in my food processor so I can control the overall quality. I would recommend giving this sauce a long slow cook on top of the stove, a few hours brings out and melds all the flavors. Save the cream 'til the end, just before serving. The sauce stores well, but never lasts long in my refrigerator!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-20T13:10:39.653Z",
                "reviewBody": "I use prosicutto instead of ham, used 1/2 lb of Italian sausage for 1/2 lb of the pork, and slipped in some beef short ribs for some of the ground beef..  The secret to great Ragu sauce is low and slow; Don't rush the cooking process! A good food processor is necessary unless you love chopping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-19T01:35:05.937Z",
                "reviewBody": "Excellent recipe.  I used all beef since I didnt have pork.  Also used chicken broth instead of beef stock - well, it was not detectable.  Also used milk instead of cream - nice creamy finish.   Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Hayes Kelder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/517280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-13T23:11:09.34Z",
                "reviewBody": "This recipe is pretty easy and tastes great.  My two friends who enjoyed it with me loved it!  I served mine with linguine, but I would recommend ziti - this sauce is extremely thick and needs pasta that will hold it.  Also, I am a salt fiend and this recipe doesn't really need any extra salt added - so taste it before seasoning.  I tasted throughout the cooking process - don't leave out the chicken livers or nutmeg- they added an extra earthiness to the dish that pushed it over the top for me.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARKAY5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-10T21:12:19.27Z",
                "reviewBody": "Im sorry but too much work and this does not make 28",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Boy R Drew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whipnuts/"
                }
            }
        ]
    }
]