[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
                    "name": "Oatmeal Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17654/desserts/cookies/oatmeal-cookies/oatmeal-raisin-cookies/",
                    "name": "Oatmeal Raisin Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11620/oatmeal-raisin-cookies-iv/",
        "name": "Oatmeal Raisin Cookies IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1582850.jpg",
            "width": 1836,
            "height": 3264
        },
        "datePublished": "1999-10-25T16:08:40.000Z",
        "description": "These are the best oatmeal cookies. The secret is in the soaking of the raisins!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 dozen",
        "recipeIngredient": [
            "3 eggs, beaten",
            "1 cup raisins",
            "1 teaspoon vanilla extract",
            "1 cup butter",
            "1 cup packed brown sugar",
            "1 cup white sugar",
            "2 ½ cups all-purpose flour",
            "1 teaspoon ground cinnamon",
            "2 teaspoons baking soda",
            "2 cups rolled oats",
            "1 cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine eggs, vanilla and raisins in a small bowl; cover and let stand for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream the butter, brown sugar, and white sugar together. Sift together the flour, cinnamon, and  baking soda; stir into the creamed mixture. Then stir in the raisin mixture, rolled oats, and nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop by teaspoonfuls onto an unprepared cookie sheet. Bake for 10 minutes, or until lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Oatmeal Cookie Recipes",
            "Oatmeal Raisin Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GERIREIN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.555959963603276,
            "ratingCount": 1099,
            "itemReviewed": "Oatmeal Raisin Cookies IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "178 calories",
            "carbohydrateContent": "24.9 g",
            "cholesterolContent": "29.1 mg",
            "fatContent": "8.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "114.7 mg",
            "sugarContent": "14.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-03T01:00:03.2Z",
                "reviewBody": "Okay, after reading the previous reviews, I think I have a few pointers.  Anyone who is having flat cookies is probably not letting the butter soften naturally.  This is definitely important - if you use the microwave to soften the butter your cookies will certainly flatten.  If you are still having flat cookies you can try and use baking powder instead of baking soda.  The next suggestion is to add at least 2 tsp. cinnamon (and possibly some allspice and cloves if you like those flavors - 1/2 tsp. of each).  This recipe calls for rolled oats - but this does not mean traditional cooking oats - they are rolled oats also, but so are quick 1-minute oats and they will soften in the oven whereas the traditional oats will not.  And whatever reviewer suggested mixing the dough with your hands was a genius.  My hands worked so much better than a spoon.  And make sure to use 3 jumbo eggs or 4 large eggs to give it enough to keep it together.  These cookies when prepared correctly are wonderful.  By far the best oatmeal raisin cookie I have ever made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-30T01:50:50.43Z",
                "reviewBody": "I made these after reading many of the reviews.  I did modify the recipe a little, and the cookies were perfect...they look just like the picture and taste wonderful, and are not flat at all.  First of all, for the people who have trouble with flat cookies, check the expiration on the baking soda.  It is easy to have an expired box if you don't bake a lot.  I had a new box, but still used one tsp. baking soda and one tsp. baking powder instead of two tsp. soda.  I also used four eggs.  After reading other reviews, I used two tsp. cinnamon and a few dashes of allspice, and 1/2 tsp. salt.  Since I like to experiment, I used 1/2 cup pecans, and added some coconut and chopped dates.  I refrigerated the dough for an hour before baking. My husband, whose favorite cookie is oatmeal raisin, says they are the best ever.  Since the recipe makes so many, I experimented with some of the dough by adding chopped white chocolate to some of it and chopped semi-sweet chocolate to some of it. I baked all of the cookies for 9 minutes and they came out perfect. One tip: I always use parchment paper to bake cookies. Hope this helps with some of the problems I've read.  It really is an excellant recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2226802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-13T18:10:29.033Z",
                "reviewBody": "I'm feeling a little impatient with people who give a recipe 5 stars, saying it turned out great, and then go on to say that they changed just about EVERY single detail in the recipe.  This recipe seems to have collected a lot of that type of \"5 star\" reviews. After looking through earlier comments, I did the following: added some allspice, added salt, used 1 more egg, used baking powder and baking soda instead of just baking soda, let the butter soften before use, halved the amount of white sugar and lined my cookie sheets with  parchment paper.  What I ended up with was some excellent cookies, but I DIDN'T USE THIS RECIPE, doggone it. Like many of those who have given this recipe 5 stars, I used a totally different recipe that was gleaned from previous user's comments and my own experience. The difference is I'm not going to give credit where it's not deserved.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Karl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1916952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-23T16:59:42.423Z",
                "reviewBody": "Excellent entire batch gone in one day! I've already given out this recipe 4 times! I made a few adjustments...half golden raisins 1 cup walnuts 1 tsp baking powder and 1 tsp baking soda 2 tsp cinnamon 1/2 tsp ground cloves. I also soaked the raisins in 2 eggs and added 1 egg to the batter for easier mixing. Soaking the raisins in the egg makes the difference never skip this step!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs.rainwater",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1554488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T21:36:26.037Z",
                "reviewBody": "I printed two oatmeal raisin cookie recipes and this one was so good that I didnt even bother with the other recipe! The cookies weren't fluffy, but they weren't flat either. They were just right. And the taste....heaven! I followed the recipe exactly except when I was mixing. I dumped a little of the egg in early because this dough is pretty stiff and it helped with the mixing. I will be making these again!\nYUMMY\nOh, one tip...let the cookies cool on the pan for about 2 minutes. This makes them easier to take off. Because they are soft cookies, if you try to remove them from the pan right out of the oven, they will just be a gooey mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pootsyanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-07T15:47:51.327Z",
                "reviewBody": "The best I have ever eaten!  Don't make the balls too large as you drop them on the cookie sheet, or the middles will stay gooey.  Keep them around a teaspoon to a teaspoon and a half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISA  IN E TN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-05T01:22:40.81Z",
                "reviewBody": "The first 2 times I made these cookies they spread too much and were flat, altho the flavor was DELICIOUS! Today I rolled the dough into logs in plastic wrap and popped 'em in the freezer for awhile, then sliced and baked on parchment covered cookie sheets. They took a little longer to bake because the dough was cold (15 Minutes) but they came out picture perfect! Rolling the dough made everything go soo quick and easy! I had about a dozen on a plate on the kitchen table when guests dropped by, and they all thought the cookies were from a bakery. The plate was empty in no time! I would imagine the dough logs would keep nicely tightly wrapped in the fridge or the freezer, to slice, bake and pop in the oven anytime! I add 1/2 cup more flour, and more raisins. I don't use the nuts. Make sure you have plenty of milk on hand..these are sooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonsie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-20T19:37:26.897Z",
                "reviewBody": "I loved these cookies,used 1/2 cup sugar,1/2 cup brown sugar instead of a full cup. I also used 4 eggs instead of 3. My family doesn't like raisins so I added 1 cup of chocolate chips.I used 1 tsp. each of baking powder and soda instead of just the baking soda. I put in a dash of nutmeg with the cinnamon.We couldn't stop eating them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2081764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-29T04:19:49.587Z",
                "reviewBody": "I followed the additional tips of making sure my butter was softened naturally, as well as the OP's of soaking the raisins (srsly, why had I never thought of that,lol). I added chopped walnuts and a bit more cinn & cloves cause I like em a bit spicy, and they were fanfreakintastic! I did notice that when they were just out of the oven, they were a bit more \"cakey\" than I was hoping, but once they cooled they took on the consistancy i was hoping for originally...you know, flattened a bit, densed up some, but were still soft and bendy and flexi goodness. Definitely a keeper recipe for me :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scarlet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2205705/"
                }
            }
        ]
    }
]