[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15908/caramel-apple-pie-ii/",
        "name": "Caramel Apple Pie II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F638658.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1999-10-26T01:40:33.000Z",
        "description": "This is a gooey sweet pie that tastes best warm. Microwave reheats well!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "1 recipe pastry for a 9 inch double crust deep dish pie",
            "½ cup packed brown sugar",
            "¼ cup butter, melted",
            "⅓ cup all-purpose flour",
            "5 cups thinly sliced apples",
            "⅔ cup white sugar",
            "3 tablespoons all-purpose flour",
            "2 teaspoons ground cinnamon",
            "1 teaspoon lemon juice",
            "20 caramels, halved",
            "2 tablespoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Taffy: In a small bowl combine brown sugar, melted butter or margarine, and 1/3 cup flour. Mix well and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Apple Filling: Place apples in a large bowl. Add white sugar, 3 tablespoons flour, cinnamon, and lemon juice. Toss until all ingredients are mixed well and apples are thoroughly coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon half of apple filling into pastry-lined deep-dish pan. Top with half of caramels and half of taffy mixture. Repeat process with remaining apple filling, caramels and taffy mixture. Place top pastry over filling and seal well (this is very important--if edges are not sealed, caramel will leak out all over). Cut steam vents and brush top crust with milk or light cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover pie with foil and place on a baking sheet. Bake in preheated oven for 25 minutes. Remove foil from pie and bake for another 20 to 25 minutes, until crust is golden. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Emtmom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.633608815426998,
            "ratingCount": 363,
            "itemReviewed": "Caramel Apple Pie II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "545.7 calories",
            "carbohydrateContent": "87.4 g",
            "cholesterolContent": "17.3 mg",
            "fatContent": "21.4 g",
            "fiberContent": "2.8 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "371.2 mg",
            "sugarContent": "56.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-03T22:55:08.623Z",
                "reviewBody": "Everyone at my house loved this pie last year at Christmas. I was disappointed though, it was extremely runny. I am going to make it again this year, I am just going to cut back on the liquids. Even with it being runny though, it was very good!\nUPDATE: after a few more years I think I have it perfected. Here's some of my hints: mix the apples you use (I use granny smith and jonathan apples- granny smith is important to control the sweetness).  Cut down on the sugar and butter.  Add an extra tbl or so of flour. With these changes the pie is no longer runny... Its just YUMMY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "manda0817",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/712327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T21:59:32.75Z",
                "reviewBody": "This pie was incredibly delicious!...the filling was PERFECT..it didnt run out of the pie and definitly was perfect thickness. I did do a few things different considering reviews bout it being doughy/runny and i found that..its better to add 1 extra tablespoon of flour to that 3 tbsp of flour...just to thicken up the caramel. If your worried bout the pie getting doughy..prick forkholes all over pie and pre-bake in the oven for about 10-12 minutes. I also didnt use caramels...i used caramel dip and poured half the apples into the pie..then half of the caramel..then the apples and caramel again. I reduced the white sugar by half so the pie wasnt overkill on the sweet side and it was perfect. Also if you like ALOT of apples in your pie..use a cup more of apples. Instead of the top being a pastry (i thought would be a little bland) i used a great streusle topping ive been using on apple pies for years..heres the recipe if you want to use it too. make Streusel Topping: In a medium bowl combine 3/4 cup flour, 1/2 teaspoon cinnamon,1/4 teaspoon ground cloves, 1/2 c brown sugar, 3/4 c oats, and 1 tea lemon peel. Mix thoroughly, then cut in 1/2 cup butter or margarine until mixture is crumbly. \npour over pie before baking and pat to seal ..make sure there are no openings where filling can seep through. bake, halfway till pies done..put tin foil on top and over edges of crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahnadine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2270689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-05T00:33:28.923Z",
                "reviewBody": "This recipe has become a family favorite. I've been making this for several years and have tweaked the recipe with the following adjustments: I use six cups of Granny Smith apples (usually seven apples) and 1/4 cup of flour. As for the caramels, I highly recommend Abdallah Vanilla Cream Caramels. These caramels are much softer than most caramels and are easy to cut into small pieces. I also sprinkle the top crust with sugar after brushing with milk. Bake the pie in a preheated 425 degree oven for 15 minutes and then lower the temperature to 375 degrees and bake for 10 minutes. Remove the foil and bake another 30-35 minutes until golden brown. As a result of these changes, the pie is not too sweet and not runny. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLANCYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-11T18:49:04.323Z",
                "reviewBody": "This Pie has become my Favorite Apple Pie to make. I made it for a pre Christmas get together the other night of 4 women (figured they never eat much so a apple pie would be perfect) Before they were gone the entire pie was gone (and all I got was a tiny sliver to say that I actually know what it tastes like) Everyone loved it and wanted 2nds and a couple even 3rds. I was like WOW. I am always afraid people are just being polite but when they left I knew they loved the pie because they didn't stop talking about it (even called the next day to get the recipe) The only thing I did different this time around was I used the 6 cups of Apples as suggested by other users. I also used the T. Marzetti's Caramel Apple Dip instead of caramels (I am handicapped and anything that makes baking easier I will do so using the Apple Dip for me was easier) I also put a bit of sugar on the top of my pie crust after the milk just for decorative purposes (because a apple pie is not a apple pie unless it looks beautiful....although the first one I made I forgot the sugar that I always put on pies and it came out really golden brown and pretty without it but I personally just prefer the extra flair of sugar on Pie Crusts. Oh and I added a little bit of Cinnamon/sugar my Pie Crust Recipe....it makes this Pie to die for. I had a recipe years ago that had cinnamon/sugar in the Pie crust...I lost it now but I always just add a bit to my pie crust and it makes all the difference in Apple Pies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Jo Grogg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-13T23:33:16.357Z",
                "reviewBody": "This was the best apple pie I ever made! I usually don't like apple pie but this pie with its added caramel and taffy mixture made it great. One tip I thought I would share is to add premade caramel dip instead of caramel pieces. You don't have to worry about the caramel pieces melting completely this way. I just spoon it over the apples. If its too thick a few seconds in the microwave will thin it enough to drizzle. I use about half of a 16 oz. carton.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lindadue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1519968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-21T14:12:56.18Z",
                "reviewBody": "I only used granny smith apples increased the flour to 4 Tablspoons to make it less runny. I made 10 of these pies in 1 week because I wanted to enter it into a contest. I did not win first place but the reviews I got were all very good. Some thought the pie was too sweet. I did make one pie with 1/2 the amount of caramels and then dropped some of the caramel dip over the top of the pie before adding the top crust. I also quartered the caramels. Any way I made this pie it got rave reviews. Thank you for such a good recipe it is a keeper and will now be one I make each Thanksgiving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy Carnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T11:34:30.95Z",
                "reviewBody": "OOOOHHH MMMMYYYY!!!! How delicious. I love apple season and this is by far my favorite pie I've made so far. I did mix 3tbsp lemon juice and 1 tbsp cornstarch in saucepan and simmered the cut up apples in that for 15 min until warmed. I did use only 1/2 cup white sugar and 1/4 cup flour for the apple mixture and I added a few squirts of vanilla and a few pats of butter on top of the apples as well. I skipped using caramels for all the reviews of the caramel not melting well-so I used the caramel apple dip that is next to all the apples in every store during this apple season and put dollops of that evrywhere. I can't say enough how delicious. Mine wasn't watery or soggy in the least-but beware- don't forget to seal pie because it does leak and don't forget the cookie sheet underneath. I also needed to bake mine for more like 1 hour to 1 hour 10 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-02T14:45:43.843Z",
                "reviewBody": "This was fabulous & I've made apple pie several times several different ways. The only things I did different were I added 6 cups of sliced apples & sprinkled a tiny bit of sugar on the crust after brushing it with milk. The reason for more apples is the apples flatten about an inch or so during baking and I was always left with a flat looking pie before I started adding an extra cup. The sugar on the crust was just to add a pretty finish. Great recipe. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaime Pischke Turza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/832144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T03:35:28.747Z",
                "reviewBody": "I cannot give this recipe anything but 5 stars as it just won first place in an apple pie contest and the grand prize for the entire pie contest. Many thanks. My ribbons are beautiful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLAHTI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/712187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T15:05:07.293Z",
                "reviewBody": "I made this pie last night. I loved the flavor but it was too runny. I let it cool about 40 minutes before we ate it. It was still warm but not hot. It was still runny when it was room temperature. If I make it again I will cut the sugar in half so hopefully it will not be so runny.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "UCMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1433133/"
                }
            }
        ]
    }
]