[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1457/side-dish/potatoes/mashed-potatoes/",
                    "name": "Mashed Potato Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13829/roasted-garlic-parmesan-mashed-potatoes/",
        "name": "Roasted Garlic Parmesan Mashed Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4579989.jpg",
            "width": 1441,
            "height": 960
        },
        "datePublished": "1999-11-08T17:04:03.000Z",
        "description": "It is the sweetness of the roasted garlic that makes these mashed potatoes so delicious.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "6 cloves garlic, peeled",
            "¼ cup olive oil",
            "7 baking potatoes, peeled and cubed",
            "½ cup milk",
            "¼ cup grated Parmesan cheese",
            "2 tablespoons butter",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place garlic cloves in a small baking dish. Drizzle with olive oil, cover, and bake 45 minutes, or until golden brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to boil. Add potatoes, and cook until tender but firm. Drain, and transfer to a large mixing bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roasted garlic, milk, Parmesan cheese, and butter into the bowl with the potatoes. Season with salt and pepper. Beat to desired consistency with an electric mixer.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato",
            "Mashed Potato Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Angel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.427906976744186,
            "ratingCount": 645,
            "itemReviewed": "Roasted Garlic Parmesan Mashed Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "250.6 calories",
            "carbohydrateContent": "34.2 g",
            "cholesterolContent": "11.1 mg",
            "fatContent": "10.8 g",
            "fiberContent": "4.2 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "222 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-05T03:18:30.623Z",
                "reviewBody": "These were really good.  To save a little time I use minced garlic in a jar and put it in a bowl with the olive oil then put it in the microwave for 45 sec.  instead of the oven.  I have done this on another recipe and it turns out great.  I made these for Thanksgiving and everybody loved them.  They taste just like some you get at a restaurant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOOGLES111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/837514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-12T17:38:43.187Z",
                "reviewBody": "Ok, after making this side dish many times I have perfected it.  6 Cloves tossed in olive oil just to coat.  Into the broiler for a few mins., well just till they brown.  Meanwhile I peeled and cubed 6 medium potatoes.  Into boiling water for aprox. 15 - 20 mins OR until you stick a fork into the largest potatoe and it breaks only once.  I then drain and into a bowl.  I add approx. 2/3 cup of milk.  I then add pressed roasted garlic.  Don't worry about the left over larger pieces that are in the press.  The hand held mixer will beat it up.  Added a few minches of salt.  Then I added 3 tablespoons of marjorine.  Blend it well.  Last but not least I added a tablespoon of garlic spread marjorine.  OMG it was to die for!!!  WOW all around!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Heidrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1865278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T00:15:50.32Z",
                "reviewBody": "First let me tell you what I didn't like about this recipe.  It tells you to cook the potatoes until \"tender, but firm.\"  What does that mean???  It's not like I can reach my hand in a pot of simmer water and feel the potatoes!  So I guestimated 20 minutes.  It came out a little mushier than I like it, so I think a time range would have helped.  Also, there's not enough garlic cloves.  Not much garlic flavor to this garlic mashed potatoes.  I recommend doubling the garlic...probaly a whole head.  Also, 45 minutes cooking in olive oil is too much.  Cooked all the flavor away!  I think about 25 minutes would have sufficed.  And that's why I'm only giving it 4 out of 5 stars.  Now onto the good stuff.  I added 4 oz of cream cheese to the mix too to give it an extra creamy flavor and texture and cut back a little on the milk.  I also added some garlic salt (about a tablespoon) to compensate for the nonexistent garlic flavor.  I also spooned it into a baking dish, topped it with cheddar cheese and paprika and baked it for about 15 minutes on 350 degrees.  It came out pretty well after I compensated for the overdone potatoes and the nonexistent garlic flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ATOMICLUSH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-22T21:00:08.607Z",
                "reviewBody": "Different flavor for mash potatoes but definitley good! Did have to add additional butter and milk as the potatoes were quite dry as written.... For a unique twist add the small purple flower from the society garlic plant which is edible gives color and a stronger garlic flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-09T00:51:53.827Z",
                "reviewBody": "Really great potatoes, but as stated, might be bland. I used 4 large russets, to start. Instead of roasting the garlic the way the recipe states, I used an entire head of garlic, chopped off the top so that some of the cloves were showing, placed it on foil, and drizzled it with olive oil. I then roasted the garlic for a half an hour at 350. I used twice the amount of butter and twice the Parmesean. I squeezed the entire head of garlic into the mash, and viola! Deliciousness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLLE888",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/molle888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-31T01:34:31.56Z",
                "reviewBody": "I roasted a whole head of garlic (unpeeled and then squeezed them out after they cooled) and used a mix of Yukon Golds and Reds....I prefer them over baking potatoes any day. I also used whole milk (which I never do) and these potatoes were smashing! Lol! My only complaint is that I couldn't really taste the parm. cheese so I may just leave that out next time. Very tasty light and fluffy taters.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-04T23:30:10.373Z",
                "reviewBody": "Yum!  I roasted my garlic for 20 minutes in 1/2 the olive oil required (I thought that it was a bit much).  I also added nearly a cup of milk, (because we like them creamy).  Make sure you buy the larger garlic bulbs if you are looking for more garlic flavor, and maybe leave the skins on 1/2 of the potatoes as the previous reviewer suggested.  I put these in my crockpot to keep them warm and they were the perfect consistancy.  I got rave reviews on these!  Thanks Barrett!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T20:52:02.083Z",
                "reviewBody": "Yeah this recipe is a definite keeper. It takes a little time--peeling potatoes and roasting the garlic but the result is fabulous! I almost got carried away with my \"finger sampling\" as I was mixing the potatoes. I nearly added a few ingredients one of which was going to be cream cheese; I had some leftover in the fridge. But I'm glad I didn't. The recipe was just right \"as is.\" If you are a garlic fanatic you may want to add another clove two or three. I don't like too much garlic flavor so it was just right for me--just enough for a pleasant garlic flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T00:16:16.82Z",
                "reviewBody": "These were really good. The only problem I had was this...I roasted the garlic for only 30 minutes and it burned to a crisp...I would really recommend cutting down the roasting time. Since I didn't have any more fresh garlic and it would have taken too long to roast some more anyway I just used some minced garlic from a jar and they turned out really yummy anyway. Next time I'll roast the garlic for about 15-20 minutes and see what happens.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CESSSUTTON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/569187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-13T02:40:16.833Z",
                "reviewBody": "I know this is supposed to be an easy recipe but I am a little confused by the garlic part. I wonder if it was meant to have a little burnt taste/smell. Mine turned out a little dark brown half way through the cooking time. We dont like the taste of burnt garlic so i squeezed out as much of the soft stuff. When I roast garlic I usually use the whole bulb of garlic leaving the first layer of skin on and cut 1/4 at the end place in remiken drizzle olive oil then cover with foil. Maybe next time I will use this method for the individual gloves leaving the skins on. When cooled squeeze out the soft garlic. Now let's get with the whole result...it was bland and had to add more butter a little more shakes of salt and used more heavy cream. With little tweaks you got a winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MattOlay V-H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3883699/"
                }
            }
        ]
    }
]