[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/756/desserts/candy/mints/",
                    "name": "Mints",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9441/cream-cheese-mints/",
        "name": "Cream Cheese Mints",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F207791.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-11-10T02:12:55.000Z",
        "description": "These seem to be everyone's favorite holiday candy recipe. Could be the melt in your mouth texture, or perhaps the sweet peppermint taste. Could also be the fact that this is the easiest candy recipe around! If stored in airtight container, these can be frozen for a couple months. These can also be made into pretty shapes by rolling in granulated sugar, pressing into candy molds, and dropping them out.",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT2H30M",
        "recipeYield": "8 dozen",
        "recipeIngredient": [
            "1 (3 ounce) package cream cheese, softened",
            "1 tablespoon butter, softened",
            "3 cups confectioners' sugar",
            "2 drops peppermint oil",
            "1 drop any color food coloring paste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cream cheese, butter, and confectioner's sugar. Mix in peppermint oil. Color as desired with food coloring paste, or leave white.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll mixture into small balls, and place on waxed paper. Flatten with a fork dipped in confectioners' sugar. Let dry for about 2 hours on waxed paper, then freeze or refrigerate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Mints"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "diane"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.354304635761589,
            "ratingCount": 302,
            "itemReviewed": "Cream Cheese Mints",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "112.4 calories",
            "carbohydrateContent": "22.6 g",
            "cholesterolContent": "7.8 mg",
            "fatContent": "2.6 g",
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "21.1 mg",
            "sugarContent": "22 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-08T17:09:29.53Z",
                "reviewBody": "Made about 500 of these for a wedding reception.  Talk about yum-yum-yummy!  HIGHLY RECOMMENDED!! My tips: Use 4 oz. cream cheese instead of 3, use 1/2 tsp. peppermint oil, and use 5 drops food coloring (that made about 100 mints).  I mixed all ingredients (except powdered sugar) with mixer, then added the powdered sugar and mixed by hand.  I tore off little nibblets of the dough, tossed in granulated sugar, and pressed into candy molds.  To allow mints to set up, I dried them on a cookie sheet, lined with waxed-paper (also, it helps to sprinkle granulated sugared all over the waxed-paper to keep mints from sticking) for about 2 hours, then transferred to freezer in sealed containers.  Thawed in fridge the day before serving.  Turned out better than any mints I've ever had!  Thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Veggie_K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T18:20:06.263Z",
                "reviewBody": "Very very good BUT this recipe calls for a 3oz package of cream cheese! USE AN 8oz! They're relatively quick and easy and they taste terrific! One more suggestion: I add a little bit more peppermint to a recipe this size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUCK778",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/232089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T22:21:48.45Z",
                "reviewBody": "These little mints are wonderful! They just melt in your mouth! I used a tiny heart cookie cutter and made heart mints for Valentine's Day. The only thing is that I added the red food coloring last and it was very hard to get a consistent color. They ended up having a pink and white marble look which was fine. But next time I would put the food coloring in before adding the powdered sugar. I think it would mix in better that way. My 3-year-old even liked these! They're addicting!! NOTE: I also tried this recipe with fat free cream cheese. You need to increase the powdered sugar in order to make the dough workable. (Just keep adding it until the consistency is right to roll out.) I then used tiny circle cookie cutters to cut the dough. After they dried for 2 hours I dipped them in semi-sweet chocolate that I had melted in a double boiler and refrigerated them. They taste like little York peppermint patties and are low in fat! (Use real butter not low fat spread or they won't firm up enough). Just can't say enough about these - they're a favorite at my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katieroth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/576774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-14T19:14:21.593Z",
                "reviewBody": "This has always been a favorite recipe of mine. Here's a tip---use a food processor instead of mixing by hand. The mixture will roll itself into a ball and is easy to remove and refrigerate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Hereford",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14084377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-27T03:49:23.42Z",
                "reviewBody": "The instant I saw this recipe I called my mom to the computer my family has been making these as long as I can remember To those that say its too sticky my mom says the recipe isn't calling for nearly enough powder sugar. If it is too sticky simply add more of the p.sugar. If it is too minty for you don't use the oil use extract or simply cut back on the oil. I made these last year & realized I only had Torani Peppermint syrup & used that instead still came out great. Always always a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GEMINI1567",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1162338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T20:02:08.177Z",
                "reviewBody": "I made these for my son's wedding.  I used 8 oz cream cheese instead of 3 oz.  8 1/2 cups of powered sugar.  2 T + 2 1/2 t of butter and 3/4 t peppermint extract.  Use less for a tamer mint flavor.  Beat this mix well to give a smooth creamy mint.  I used my mixer.  This made approx 200 mints.  (Used heart and rose bud molds)  Be sure to roll your balls in sugar well before putting them into the molds.  This will prevent sticking.  I also used sugar crystals at the bottom of the molds that gave my mints a very elegant look that is perfect for a wedding.  I had to let these dry on wax paper all day before they were hard enough to put in freezer bags to freeze.  Hope this helps others that are making large quantities for special events.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mariamou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T18:16:45.247Z",
                "reviewBody": "I made these for Christmas but am just getting around to writing the review because I'm going to make them again for Easter. They were extremely simple to make (my 3 yr old twins helped). I agree that you have to adjust the peppermint extract (it has to be extract not imitation flavoring) to taste; I added more because I like a stronger mint flavor. We tinted them green and red rolled the balls in sugar and pressed them with a cork into penny-sized mints -- good size as any larger could be overly sweet. They dried just fine on waxed paper (maybe because of the small size) and they were a great and welcomed addition to every cookie tray I made. For Easter we're making them the same size but tinting them pastel colors. These freeze extremely well and the texture remains the same -- creamy and smooth. Great recipe I'll keep on hand for something I need quickly for a fancy occasion or party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bleu Belle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T22:30:12.537Z",
                "reviewBody": "My sister and I made these mints for a wedding. We used molds that we found at a kitchen store one was a leaf and the other a rose. We colored the leaves a pale green and left the roses their natural off white. They were very elegant and received many compliments. The recipe is perfect-all you need is a little patience and lots of room in your refrigerator!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CZANES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T16:57:17.153Z",
                "reviewBody": "I made these for Christmas this year just to be a little different and EVERYONE loved them. My dog actually ate an entire tray that was waiting to be refrigerated before I caught her... so she must have like them too... and her breath certainly freshened up. I also tried to use the candy molds as another reviewer suggested but that didn't work at all. It just made a mess and I wasted perfectly good mints. I also dipped the bottom of mine in melted Ghirardelli chocolate turning them into what everyone thought were the best peppermint patties EVER created. Thank you so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TwoDCsPlus1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/579128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T18:00:45.913Z",
                "reviewBody": "These just taste like minty creamcheese icing to me so I wasn't that impressed. I just made them into small flatened circles so I think I'm going to dip them in mint chocolate now to make them salvageable. Also had to keep adding icing sugar to make them easy to handle. I will see what they are like after I dip them in chocolate but as is I won't be making them again. Ok...Update....I dipped them in mint chocolate and they taste amazing almost like the york peppermint patties just much smaller but that's not a bad thing at x-mas smaller is better. So I will be making them again but only dipped in mint chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTAL88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315425/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cream Cheese Mints",
            "description": "See how to make sweet peppermint treats that positively melt in your mouth.",
            "uploadDate": "2014-04-21T19:07:07.001Z",
            "duration": "PT1M34.962S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F95a13a4c-da78-4925-8915-9c50394e733d%2Fb88525ad-5c72-4cac-ab5e-9749dd5bd6b9%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3492346051001"
        }
    }
]