[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10592/best-chocolate-chippers/",
        "name": "Best Chocolate Chippers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F118882.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-02-26T02:06:49.000Z",
        "description": "These are the BEST chocolate chip cookies I have ever made; and I have been testing different ingredients for a long time. I hope you love them as much as my guys do!!! I use a wooden spoon to mix these, as the texture seems to be so much better.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "1 cup vegetable oil",
            "1 cup white sugar",
            "1 cup packed brown sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "4 ½ cups all-purpose flour",
            "2 teaspoons baking soda",
            "4 teaspoons cream of tartar",
            "1 teaspoon salt",
            "2 cups semisweet chocolate chips",
            "1 cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter, oil, brown sugar, and white sugar until smooth. Beat in the eggs and vanilla. Combine the flour, baking soda, cream of tartar, and salt; stir into the creamed mixture. Mix in the chocolate chips and walnuts. Drop dough by rounded teaspoons onto ungreased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 12 to 15 minutes in the preheated oven, or until light brown. Allow cookies to cool on the baking sheets for a couple of minutes before transferring to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tina Holcombe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.387096774193548,
            "ratingCount": 62,
            "itemReviewed": "Best Chocolate Chippers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "204 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": "17.9 mg",
            "fatContent": "12.4 g",
            "fiberContent": "0.9 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "133.5 mg",
            "sugarContent": "12.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-17T19:04:17.433Z",
                "reviewBody": "This is the chocolate chip cookie I have been looking for mind you I do not like cake like cookies. So if you want a cake like cookie don't bother with this recipe. I feel if you want cake - eat cake. If you want a cookie then the cookie should taste like a cookie and by that I mean the texture should be crispy on the outside and chewy on the inside and that is exactly what these cookies deliver. I reduced the oil by 1/4 cup and refridgerated the dough for 30 minutes rolled the dough into walnut sized balls then flattened them slightly. They baked up perfectly round flattened and slightly cracked in appearance. They looked like they came staight from a bakery. Great recipe thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-16T21:25:26.233Z",
                "reviewBody": "Just like everyone else I'm very particular about my chocolate chip cookies. Frankly I don't care if they're crispy chewy or cakey so long as they're delicious and baked properly. The debate will go on forever as to which is \"the best\" as there are so many good recipes--and this is certainly one of them. I prepared them exactly as the recipe directs wanting to judge the outcome for myself and they were perfect. I chilled the dough to firm it a little to avoid spreading then used a small ice cream scoop and flattened them just slightly--I found they come out of the oven much as they go in. These are perfectly shaped rounded beautiful cookies that didn't flatten out--picture perfect. It is not a novel idea to use both oil and butter in cookies nor is the addition of cream of tartar. These were NOT greasy as some reviewers mentioned and the cream of tartar gives them a pleasant light and sandy texture. I don't know if this is \"the best\" chocolate chip cookie out there(because there will NEVER be one) but these sure are darn good! Thanks for sharing this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T20:57:58.483Z",
                "reviewBody": "If you like cakey cookies stay away from this recipe. Although the \"typical\" chocolate chip cookie lover likes his/her cookies soft and chewy there are some of us that prefer a crispier cookie. It is exactly as the name states: Chocolate Chippers. Why there are so many people that gave it a bad review is beyond me. I don't try recipes that don't sound like something I would like so why would they?? Tina I'm with all those people that think your cookies are great. Thanks so much for the recipe!! It seems like every recipe I try for chocolate chip cookies makes soft chewy cookies that just do not satisfy my cravings but this one is perfect. For those that don't like the dough so greasy if you reduce the oil to 1/2 cup it will give you a combo of both cripsy and soft cookie. The taste is WONDERFUL! Thanks again Tina!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mommy of Five",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-25T17:12:00.77Z",
                "reviewBody": "Overall this was a dry cookie. I scaled to 24 used canola oil in place of vegetable and only a handful of crushed walnuts. I ran out of time and had to refrigerate the dough overnight before making. The next day I let dough come to room temperature before baking. My first tray was 1 1/2\" cookies baked for minimal time stated bottoms came out too brown. Next tray was 2 1/2\" cookies and these were better. I placed in an airtight container overnight but no difference in texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GodivaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T05:19:09.06Z",
                "reviewBody": "sweet light and yummy! these did fall apart a little when trying to get them onto the cookie sheet but I love crispy chocolate chip cookies so I didn't mind the dryness of the dough. like I said....these are REALLY good cookies:) thanks Tina!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pretty_in_pink_pa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-28T14:14:57.03Z",
                "reviewBody": "This is the chocolate chip cookie recipe that I have been looking for and I to have been baking for years!! It has very light and crispy texture. I did decrease the oil to 3/4 cup baking soda to l tsp and salt to l/2 tsp. I used a hand beater for the creamed mixture; but when adding the dry ingredients I used a wooden spoon as suggested by Tina. Bake just until bottoms are golden brown watch closely. Thank you so much for sharing Tina!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELFROMHEAVEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1038997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T21:21:15.2Z",
                "reviewBody": "This is now my best cookie recipe! I use it for the basis of all my cookies and just love it. I've made some variations but the original is also good. I subsitute butter shortening for the vegetable oil and butter - I found that makes them softer. Also I add 2 tablespoons of milk or cream with the eggs. Thanks for an invaluable recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARA-S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T05:19:28.67Z",
                "reviewBody": "I too have tried many many chocolate chip cookie recipes and have been baking for years. These are indeed the very best chocolate chip cookies I have ever made. They were a huge hit in my house! Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRSPAULINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/591304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-09T21:03:38.357Z",
                "reviewBody": "I have a recipe I have used for a long time that is very similar to this only I use one tsp of cream of tartar and only one egg. They are the weirdest cookies ever. You will love them or hate them. Half of the people I have made them for don't care for them at all and the other half are absolutely addicted to these. These are not my favorite cookies but once in awhile I really crave them. They are almost more like a shortbread cookie with chocolate chips and not a traditional chocolate chip cookie at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LYSSIESMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1007823/"
                }
            }
        ]
    }
]