[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16465/slow-cooker-cranberry-pork/",
        "name": "Slow Cooker Cranberry Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F110471.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-11-20T20:01:26.000Z",
        "description": "Sweet, tangy and easy. The sauce is also good with chicken instead of pork. Try serving with rice and onion rings.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (16 ounce) can cranberry sauce",
            "⅓ cup French salad dressing",
            "1 onion, sliced",
            "1 (3 pound) boneless pork loin roast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together  the cranberry sauce, salad dressing, and onion. Place pork in a slow cooker, and cover with the sauce mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 4 hours, or on Low for 8 hours. Pork is done when the internal temperature has reached 145 degrees F (63 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DAWN MINER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.271573604060913,
            "ratingCount": 788,
            "itemReviewed": "Slow Cooker Cranberry Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "374.5 calories",
            "carbohydrateContent": "32.9 g",
            "cholesterolContent": "79.6 mg",
            "fatContent": "15.1 g",
            "fiberContent": "1.1 g",
            "proteinContent": "26.8 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "184.1 mg",
            "sugarContent": "31.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-10T21:04:26.073Z",
                "reviewBody": "Like many other reviewers the sparse number of ingrediants combined with the thought of cranberry sauce & French dressing made us skeptical but in the end it was good & we plan to make it again. I did use fresh crushed garlic & rubbed it on all sides of our 3.5lb pork tenderloin followed by a light application of salt & pepper before placing it in our crock pot. My advice on the \"sauce\" is to mix the dressing & cranberries BEFORE adding the onion to the mix as the onions make it difficult to thoroughly mix otherwise. Our tenderloin took only 6 hrs on low but was moist and tasty & perfect for a day when you need something easy that you can start & let cook without any tending to. My wife did use \"Wondra\" to thicken the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DaveMW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2141071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-27T16:22:13.217Z",
                "reviewBody": "When my husband raves, I know I've made something incredible.  He couldn't stop talking about it.  I made it for him and a friend who comes from a family of chefs, and she also loved the flavor and tenderness.  My personal notes:\n-I added 1 tablespoon corn starch to the sauce before putting it in the crock pot.  The sauce came out nice and thick, and I poured the excess over the pork before slicing.  It was excellent.\n-Per everyone's suggestions, I seasoned the pork heavily with salt, pepper, and garlic.  No complaints here.\n-I also used a rolled pork tenderloin, which came out great.\n-If you're looking for a good side dish, mashed sweet potatoes and green beans worked great.  Keep it simple.\n-The only problem was that there really wasn't enough food for four people.  Next time I'll double the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1614453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-25T03:34:50.323Z",
                "reviewBody": "I made this for dinner tonight!! It made the house smell wonderful!! I used a bone-in pork loin and I seasoned it with salt/pepper and then seared it in a hot pan with olive oil.  Then put it in the pot with all the ingredients exactly as listed.  It was wonderful!!  I cooked it on high for about 3 1/2 hours and the meat was falling off the bone!! There was lots of sauce, so I made a roux with 3T. butter and 3T. flour and then added all the sauce and it thickened it up.  I sliced the meat and put it on a serving platter with the sauce/gravy poured over the top!!! It was so good!! My hubby had seconds and thirds and my 2 year old asked for MORE!!!! I served it with mashed sweet potatoes and green beans per another reviewers suggestion!! What a pretty dinner!! You could definitely serve it to company.  The only thing that troubled me is that the meat is to tender that it's really hard to cut nice even slices, it pretty much shreds when you go to slice it.  Oh well, it's still awesome!! Thanks for the recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ILUVBROWNIES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/961201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T23:01:44.78Z",
                "reviewBody": "I made this last night and I am glad I read the reviews. First I only had a 3 1/2 pound bone-in pork roast but it worked really well. I seasoned it first with garlic salt and lemon pepper. I used the whole-cranberry sauce and not the jelly type. After eight hours I took it out and took all the meat off amd placed it in a casserole dish and after thickening the sauce poured it over it covered it and placed it in the refrigerator. Tonight I heated it up and served it with homemade mashed potatos fresh asaragus and it was fabulous. We had unexpected guests and they had seconds and thirds. This receipe is a keeper. I think the secret is to let the pork soak up the \"gravy\" for a day. It really had a wonderful flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RNTOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/965523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-25T21:44:44.413Z",
                "reviewBody": "I have to be honest.   This recipe scared me!  The few ingredients that you use just didn't seem to go together.  I made it based on the reviews of other members and wow was I surprised!  Absolutely delicious! I used a pork loin instead of tenderloin and cooked it on high for 3 1/2 hours and you could cut it with your fork it was so tender!  Great and unbelievably easy recipe!  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KMS1970",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T16:57:17.747Z",
                "reviewBody": "This is a wonderful meal! I took advice from other reviewers, and salt & peppered the meat, used whole cranberry sauce, cooked on high for 4 hours -- and it was great. The flavor is wonderful and you can't taste the French dressing. I actually used Ken's brand French which is a darker red color and had honey in it. I highly recommend this recipe for the ease of putting it together and its fantastic flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T00:52:25.28Z",
                "reviewBody": "Easy and delicious!  My husband said he could eat the whole thing - he went back for seconds, then thirds! I used a bone-in pork loin/roast and was sure to season it well and use whole cranberry sauce as others advised. I then cooked it on high for one hour then turned it down to low for six hours. We ate it straight away!  It was falling off the bone and so tender we didn't need a knife.  Thank you for a excellent recipe and thanks to all of you who take the time to add suggestions!  Don't you just love this site!?!?!?!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MI Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/316018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-18T16:51:00.03Z",
                "reviewBody": "I made this recipe with a pork roast.First I put I rubbed salt,pepper and garlic into the meat.You must do this to season the meat.Then I mixed the cranberry sauce and french dressing and chopped onion and poured on top of the meat,covered with foil and baked on 350 for 1 1/2 hours then a 1/2 hour more UNcovered.Let rest for twenty minutes or so ,sauce will thicken.Absolutely DELICIOUS!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JWHYTEHOUSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/92669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-27T18:21:21.263Z",
                "reviewBody": "This one's a keeper! Only changes I made were to season the roast with salt/pepper & a mix of seasonings I use on nearly every type of meat I cook. I didn't have French dressing so used Western- which is much sweeter. I added some minced garlic & used whole cranberry sauce. Hubby LOVED it as is although next time I plan to use the actual French dressing in the hopes that it will tame down the sweet-factor & some red pepper flakes to kick it up a notch! We've already planned to use this for our pulled pork recipe (using the jellied cranberry sauce). I see us making this often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeprdy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2113135/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T23:04:20.76Z",
                "reviewBody": "ok not great",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SNIGHT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1116321/"
                }
            }
        ]
    }
]