[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
                    "name": "Noodle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16304/husbands-delight/",
        "name": "Husband's Delight",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6562962.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "1999-11-23T17:39:30.000Z",
        "description": "Being a farm wife, I'm always looking for recipes that can go out to the field. I got this one a number of years ago from my friend who is also a farm wife. It's rich, creamy and filling.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "10 ounces egg noodles",
            "1 ½ pounds ground beef",
            "1 (14.5 ounce) can peeled and diced tomatoes with juice",
            "1 teaspoon salt",
            "1 tablespoon white sugar",
            "1 ½ cups sour cream",
            "3 ounces cream cheese",
            "½ onion, chopped",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, brown the ground beef. Add the tomatoes with juice, salt and sugar and simmer for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate medium bowl, combine the sour cream, cream cheese and onion and mix well. In a 9x13 inch baking dish, place half of the egg noodles, then all of the meat mixture, then the cream mixture. Top with the remaining noodles and sprinkle with the cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Noodle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cathy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.03639846743295,
            "ratingCount": 522,
            "itemReviewed": "Husband's Delight",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "667.2 calories",
            "carbohydrateContent": "41.5 g",
            "cholesterolContent": "172.1 mg",
            "fatContent": "39.7 g",
            "fiberContent": "2.3 g",
            "proteinContent": "34.6 g",
            "saturatedFatContent": "21 g",
            "servingSize": null,
            "sodiumContent": "778.5 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-16T22:14:12.64Z",
                "reviewBody": "I had to change a lot of things with this recipe, but it was worth it!  All of the revisions came from other reviewer suggestions :)  I made taco seasoned ground beef, then added the tomatoes and since the meat was seasoned I added no salt and just a pinch of sugar.  I changed the layers, as suggested, and put the noodles on the bottom,hamburger next, cream mixture next (an ounce more cream cheese, 1/2 c more sour cream), then cheddar cheese.  I covered with foil for first half the cooking time and removed it for the second half.  It was truly DELICIOUS once it was made with the CHANGES.  I have a picky husband & 4 year old and they both gobbled it up and had seconds!  It was just as good rewarmed the next day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen Lilly Freitas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/813323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-29T22:17:53.42Z",
                "reviewBody": "After reading the reviews, the best things are to;\r\n1) Add 1oz more cream cheese& 1/2 cup more sour cream\r\n2) Add 1/2 of the onions to beef while frying\r\n3) Season beef well\r\n4) Cover with foil\r\nLayer like recipe calls for and it is a excellent dish. My family (who are picky eaters) wanted me to make it again the next week! It is also very easy to make. Send us more recipes like it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINLEO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/749721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T23:23:26Z",
                "reviewBody": "I have been cooking this recipe for years.  I remember it being one of the first things I ever made that didn't come out of a box and it's been a family favorite ever since.\n\nI will say that my recipe varies slightly.  I use 3 green onions instead of regular and mix it with 2 cups sour cream and 8 oz cream cheese in a separate bowl.  I also use 16 oz of tomato sauce instead of the diced tomatoes and mix with ground beef, a can of corn, 1 tsp sugar and salt, and 1/2 tsp pepper and Worcestershire sauce.  I then layer   (repeatedly and in this order) the cooked noodles, beef mixture, and the cream cheese mixture.  I then top with a lot of cheddar cheese and bake until it bubbles (about 30 minutes).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1566190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T00:34:58.53Z",
                "reviewBody": "This is wonderful! Have made this several times already. Our children are the ones asking me to make it again. This is a keeper. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTJEN33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/126242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-30T16:53:08.967Z",
                "reviewBody": "This is an all over good meal.  I made it the way it was written the first time and we rated it an 7.  The second time I made it I added chopped garlic with the onion mix and tabasco sauce as well.  I also seasoned the meat before cooking.  I mixed the meat with the cheese mixture and the noodles as well then topped with twice the amount of cheese.  That way the we werent just getting a hunk of noodles with cheese melted on.  It turned out good.  The second time we rated it a 10!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DDWYER5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/419881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-13T05:20:15.077Z",
                "reviewBody": "My husband loved it! I went by other reviews adding tomato sauce. I think I will add some more tomato sauce next time. I also added the onions to the meat mixture. I covered with foil and added cheese to the top (on top of cream cheese mixture). Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTYZ3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1176651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T23:22:52.937Z",
                "reviewBody": "I've made this recipe twice and its been great both!  The first time based on other reviews, I made it mexican. I mixed the onions in with the meat and added some taco seasoning and salsa.  I did use 8 oz of cream cheese and sour cream and 16 oz of noodles so I had to make a 9x9 pan too, but my husband pulled that out of the freezer for lunch 2 days later.  \nI did almost the same thing the second time but I made it Italian.  I used Spaghetti sauce and topped with Mozzeralla cheese.  The noodles on the top of this one were crunchy so next time I'll layer them on the bottom only.\nMy family and I loved this recipe and  I look forward to playing with it more.\n                                                                                  /(6/17 addition)        \nOkay This recipe has been a staple in our house for 2 years now.  I have enjoyed it so much that I don't have to look at the recipe anymore, not that I follow the recipe exactly either.  I mixed black beans in with the meat the last time I made this because I didn't have enough meat and it was probably the best yet.  Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TMMC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T22:11:43.623Z",
                "reviewBody": "Pretty good recipe. This has made it to my recipe box but I added notes. I put in some oregano and never make this recipe without corn. Something about the cream and the corn coming together make this even more appetizing. Thanks for giving me ideas with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MinxyBaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-16T16:35:27.423Z",
                "reviewBody": "This recipe is great. I have made it numerous times (the hubby insists I make it at least once a month!) and have made a few minor changes. Firstly I use 2 lbs. of meat 1 1/2 lbs. of ground beef and 1/2 lb. locally homemade hot sausage. I saute the onions with the meat mixture instead of adding it to the cream cheese mixture and use double the amount of diced tomatoes. I also use a whole 16 oz. container of sour cream and the whole 8 oz. container of cream cheese. I also use about 1/2 cup more of the cheddar on top. The best and most flavorful change I made however was adding a package of dried onion soup mix to the sour cream/cream cheese mixture. I did this the very first time I made it and it turned out great. I tried it once without it because I didn't have any on hand and the dish just wasn't the same. In all a great recipe. The hubby's buddies now flock to my house when they find out I'm making it so I have to make 2 batches every time. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmandaT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1763929/"
                }
            }
        ]
    }
]