[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17215/best-bread-machine-bread/",
        "name": "Best Bread Machine Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F20%2Fbest-bread-machine-bread-photo-by-LMR721-5506039-cropped.jpg",
            "width": 1244,
            "height": 1244
        },
        "datePublished": "1999-11-26T00:11:32.000Z",
        "description": "This recipe is easy and foolproof. It makes a very soft and tasty loaf of bread with a flaky crust.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 - 1 1/2 pound loaf",
        "recipeIngredient": [
            "1 cup warm water (110 degrees F/45 degrees C)",
            "2 tablespoons white sugar",
            "1 (.25 ounce) package bread machine yeast",
            "¼ cup vegetable oil",
            "3 cups bread flour",
            "1 teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the water, sugar and yeast in the pan of the bread machine. Let the yeast dissolve and foam for 10 minutes. Add the oil, flour and salt to the yeast. Select Basic or White Bread setting, and press Start.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHECOOKS2"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655656482246077,
            "ratingCount": 3633,
            "itemReviewed": "Best Bread Machine Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "173.9 calories",
            "carbohydrateContent": "27.1 g",
            "cholesterolContent": null,
            "fatContent": "5.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "195.4 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-23T18:07:31.577Z",
                "reviewBody": "I saw the comments about the loaf's tendancy to fall and would like to suggest adding about 1/2 tsp more salt into your machine when you bake the bread.  Salt regulates yeast activity and strengthens dough structure.  Too little salt can cause the dough to rise rapidly and then fall. I've seen that for 2 1/4 tsp (.25 oz) of bread machine yeast, the general salt amount is 1.5 tsp. I made this recipe with the extra salt and it turned out really well.  It is the best loaf of white bread I've gotten from my machine so far -- and it rose really high (it had me slightly concerned it might over rise).  But it was a beautiful loaf in the end.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ICYBLUEROSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/833152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-15T00:27:03.517Z",
                "reviewBody": "This recipe flies in the face of conventional wisdom.  It says to place the yeast in the water for 10 minutes before adding the flour!  My bread machine instructions, \"Electric Bread\" cookbook, and even the bottle of yeast said to not allow the yeast to touch the liquid in advance.  They all recommend adding water first, then the flour mixture, and yeast on top of that.\n     Well, what do I have to lose?  I tried this recipe the way it was written, and for the first time ever, I had a light fluffy loaf that rose to the top of my machine!\n     Never has a loaf of bread made from scratch turned out this well.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patticake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2284430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-04T03:47:58.97Z",
                "reviewBody": "This was the best bread that ever came out of my bread machine yet.  On my 2nd loaf, however, I made a few changes:  I used 3 Tablespoons sugar and reduced the yeast to 2 teaspoons instead of the 2 1/4 teaspoon measurement that is in the 1 packet that it calls for.  This reduced the rising just enough so that the slices near the top of the loaf weren't as \"airy\" thus, held up better during slicing.  Also, instead of using 3 cups of white flour, I substituted 1/2 cup of whole wheat flour and  2 1/2 cups of white, and the result was a lovely, soft, very light white/wheat bread with a flaky crust, perfect for sandwiches!  This recipe has become a favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BERMYROSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/479278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-10T03:15:18.263Z",
                "reviewBody": "Being new to bread making and having a new bread machine I have been looking for different recipes to try.\nIt scared me a bit mixing the yeast, sugar, and water together but it all turned out fine. The bread is just great! This is a wonderful white bread recipe that I will be making again and again.\nMy biggest confusion was that I had Bread Machine Yeast in a jar, not in a packet. After some searching I found that 2 1/4 teaspoons equals one packet of Bread Machine Yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie Kane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/laurie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T19:41:38.897Z",
                "reviewBody": "The basic recipe is good but has some issues:\r\n\r\n1) \"Bread Machine Yeast\" is just another name (purely for marketing) for \"Instant Dry Yeast\" (IDY) which is INSTANT and therefore does not require pre-proofing in water. Simply add it to your dry ingredients and continue without the \"dissolve and foam\" step noted. There, you've save 10 minutes!\r\n\r\n2) Active Dry Yeast is not Bread Machine/Instant Dry Yeast and it *does* like to be pre proofed as noted in the original recipe. \r\n\r\nActive Dry yeast is in little round beads about the size of a pin head. Instant yeast is very small and more like little threads of yeast, much smaller than Active. You would need about 25% more Active yeast than Instant. \r\n\r\n3) Salt:\r\n\r\nSalt is normally 2% of a recipe's flour amount. Here we have 410g of flour (check the metric version) so we want 8 grams of salt, or about 1 1/2 teaspoon. The recipe as given is therefore missing 33% of the required salt which is more than just a \"taste\" problem.\r\n\r\nSalt will not only improve the taste of your bread (this or any other) but is needed to help the gluten's strength by tightening the gluten strands a little. Bread with too little salt will not only taste bland, it will also be too soft. \r\n\r\nTry this experiment: \r\n\r\nMake this recipe with the correct 1-1/2 tsp (8 grams) of salt then again without salt and compare the two for taste and structure. You can use the saltless loaf for breadcrumbs or feed the birds afterwards.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Yumarama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7782198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T18:48:35.16Z",
                "reviewBody": "I have to say, I was practically terrified making this bread. It went against the manufacturer's instructions on how to add ingredients (which firmly said to add yeast last, on top of flour). I also only had regular yeast & flour. But... I got my breadmaker yesterday for Christmas and had to try it. It was delicious! It turned out light and fluffy, despite all of my blundering. It wasn't dense at all, like with my mom's bread machine recipe. It tasted just like my grandmother's hand-made recipe- except without all the work! Thanks for the great recipe. Oh, and my third loaf is baking as I type this! *G*",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEZZWHO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/817687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-17T18:48:10.84Z",
                "reviewBody": "I absolutely love this recipe.  Some modifications that I make:  I substitue the sugar with 2 very generous tablespoons of honey, add just a pinch extra salt and add 1 tablespoon of softened butter to the bread machine with the other ingredients.  I only make the dough in the bread machine, then I take it out and put it in my silicone bread pan, split the top length wise with a knife and stuff the bread with pieces of butter (1 tablespoon total) then I brush the top of the bread with melted butter and bake in a 375 degree preheated oven for about 30 minutes.  \n\nI also put a pan with water on the bottom of the oven, i just think the bread comes out so much better that way.\n\nMy family loves this recipe, we use the bread for sandwiches, toast and just eat it plain!  yummy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lobstergov",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/monsterpancake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-07T16:23:34.237Z",
                "reviewBody": "This is an excellent starter recipe.  I make a few alterations though, as my family likes whole wheat...  Here's my exact recipe.  This makes a 2-lb loaf.\n\n1-1/3 cups warm water (about 115°)\n3.5 tsp bread machine yeast\n1/4 cup sugar\n1/3 cup oil\n2 cups bread flour (essential to be bread flour!)\n2 cups whole wheat flour\n2 tbls gluten (or 1 tbls per cup of ww flour)\n2 tsp salt\n1/4 cup dry milk powder (makes the crust flaky)\n\nFollow the directions in the original recipe. I like to bake mine inthe oven however.  I find that the dough cycle is actually too long on my machine if you use bread machine yeast (1.5 hours), because the end of it is a rise cycle, which I want done in my bread pan.  The reason for this is that bread machine yeast actually cuts out the need for a second rise.  So, after the final pulse cycle (you'll have to pay attention to your machine to see when this is -- mine is at 50 minutes into the dough cycle), take it out, shape it into your loaf and place it your pan to rise for 30 minutes.  Then, bake it at 350° for about 25 minutes.  Bread should be brown on top, not just golden.\n\nLet the loaf cool completely before cutting!  I also like to smear the crust with butter to keep it soft, but if you like really crusty crust, then don't do that.\n\nI've tried many recipes, and this is by far the best basic bread recipe I've found. It's perfect for sandwiches, french toast, or anything else you'd use store-bought bread for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUBSY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lubsy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T21:45:54.5Z",
                "reviewBody": "This is the best bread machine recipe I have ever tried!  It hits the window every time!  Thank you Karen.  I am using my bread machine every day now.  I made a few changes to the recipe.  I didn't have any bread machine flour or prepackaged yeast, so I use regular white flour and 2 teaspoons of quick rise yeast and it works great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUSSIE WIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T17:36:56.757Z",
                "reviewBody": "Don't use canola oil, you have been warned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Drew Hirschboeck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2707254/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Bread Machine Bread",
            "description": "See how to make the perfect loaf of bread in your bread machine.",
            "uploadDate": "2012-04-17T17:22:48.136Z",
            "duration": "PT2M2.748S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa6c20371-ae06-47de-bb16-766739993c2c%2F0eaef7a9-0a2b-49f0-8851-5a83cda91884%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1567265697001"
        }
    }
]