[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9534/old-fashioned-homemade-hard-candy/",
        "name": "Old-Fashioned Homemade Hard Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F294113.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-11-30T22:35:16.000Z",
        "description": "This is an old recipe from my childhood.  Many people have memories of cutting this candy with their mother's and grandmothers.  I have passed it on and am now posting here for all to share in this classic Christmas tradition!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 1/4 pounds",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 cup water",
            "¾ cup light corn syrup",
            "½ teaspoon peppermint extract",
            "1 drop red food coloring",
            "⅛ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a heavy 2 quart saucepan, combine the sugar, water and corn syrup. Cook, stirring constantly until the sugar is dissolved; then cook without stirring, lowering the heat and cooking more slowly during the last few minutes, to the hard crack stage (300 degrees F), If sugar crystals form on sides of pan, wipe them off with a damp brush.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat, add oil flavoring and enough food coloring to color; stir only to mix. Pour into 2 well buttered 9 inch pans. Set one pan of candy over a sauce pan containing hot water (unless you have a helper to help cut the candy). As soon as the other pan of candy is cool enough to handle, cut it with scissors into 1-inch strips. Then snip the strips into pieces. Work fast. Drop the pieces onto a buttered baking sheet. If the candy cools too quickly, set it on a saucepan over hot water to soften it, but if it gets sticky, return at once to the work counter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss in a small amount of powdered sugar to keep from sticking together. Repeat with the second pan of candy.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tami L. Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.725806451612903,
            "ratingCount": 62,
            "itemReviewed": "Old-Fashioned Homemade Hard Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.5 calories",
            "carbohydrateContent": "30.2 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": null,
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "8 mg",
            "sugarContent": "24 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-23T17:53:45.95Z",
                "reviewBody": "Excellent recipe, and very easy to make!  Instead of cutting into strips, I let the candy harden completely, then broke it into pieces by hitting it with a mallet.  My husband loves this!  Strawberry oil flavoring is my favorite.  Go to a local baker's store, and you can find ~50 different choices of oils to make this candy with.  Don't be afraid to experiment!  Thanks for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2218961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-13T21:01:52.637Z",
                "reviewBody": "I brought this to work for a 'treat day' and have spent the whole day blushing from the compliments! I used about a tablespoon of lemon extract and two drops of yellow food coloring, and spread it out on that new Reynolds 'release' foil, then cut it in squares when it was taffy consistency with a pizza cutter, broke them apart when they were cooled and dipped each in powdered sugar before putting them in the storage container. PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca M in AR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/809988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-04T05:27:06.073Z",
                "reviewBody": "We made this when I was a kid too!!!  It was our special family tradition and we first learned it when my grandmother participated in baking for a church bazaar.  One year, when I was ten and we were pretty poor, this was the only gift we gave to those beyond our immediate family.  It was well appreciated by friends, teachers, and acquaintances.  We made different colors and flavors - Peppermint was pink; raspberry red; spearmint green; wintergreen blue; lemon yellow etc.  We placed them in small decorative jars and tied a ribbon around the neck of the jar.  Very fun!  It's been many years since we made this recipe.  Grandma says this one is an exact match with hers, except with hers you used 1 whole cup of Karo instead of 3/4 cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-07T19:18:11.787Z",
                "reviewBody": "Our church circle made these years ago. Things I learned from them: 1)Remember - always use Cane Sugar - Beet sugar is a tiny bit different and doesn't harden the same way. 2) We put 1/2\" of confectioner's sugar onto luncheon trays made troughs with a dowel connected the troughs in a continuous line and poured the candy in an \"S\" in the troughs. When cool enough to handle cut and toss in more confectioners sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2196005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T05:12:50.56Z",
                "reviewBody": "This recipe was exactly what I was looking for! I use a variety of candy oils/flavorings for an assortment of flavors and colors. Since I found this recipe this WILL be a new Christmas tradition!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BTTRFLY35",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/423991/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-18T17:08:21.483Z",
                "reviewBody": "This is an EASY & EXCELLENT recipe! As a first-timer at making hard candy I burnt the first batch. My second batch came out perfect and was alot of fun to make. Knowing that I would probably mess it up- I halved the recipe. This may be a good tip for other first-timers as you need to work very quickly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-17T02:49:14.843Z",
                "reviewBody": "Taste wise this is the best! I made candy for the first time tonight....I only came into 1 problem...All thw powder sugar stuck to the candy and is really white on most of it! Is this normal? But other than that my house smell's GREAT and the CANDY IS GREAT! OPINONS PLEASE ON WHAT HAPPENED WITH THE POWDERED SUGAR....Vicki",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VREYES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/211389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-14T07:45:36.04Z",
                "reviewBody": "ME & MY MOM MAKE THIS CANDY EVERY YEAR MY SON GOES NUTS NOW IF I DONT MAKE IT FOR HIM EVERY YEAR HOWEVER THERE ARE TO THINGS DIFFERENT WE DO #1 WE POUR OURS EITHER ON A MARBLE PIECE OR IN LIKE A FLAT COOKIE SHEET AND BUST IT UP W/A HAMMER AFTER HARDENING (WE MAKE DOUBLE &TRIPLE BATCHES OF ABOUT 15-20 DIFFERNT FLAVORINGS EVERY YEAR AND WE JUST MATCH THE FOOD COLORING TO WHICHEVER FLAVOR WE MAKE ONLY WHEN IT COMES TO FLAVORING IT (EXCEPT FOR THE STONG FLAVORS LIKE CLOVES CINNOMON PEPPERMINT)YOU NEED TO USE 2 OF THE TINY BOTTLES OF FLAVORING PER RECIPE TO REALLY MAKE IT GOOD--HOWEVER MAKE STRONGER FLAVORS LAST CUZ U'LL DEFINITLY BE OPENING DOORS AND OR WINDOWS AND RUNNIN FOR THE HILLS IT'S SO STONG(LEARNED FROM EXPERIENCE.....TRUST ME!!!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rdnkkkgrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3379585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-04T21:03:22.29Z",
                "reviewBody": "This recipe was so easy to follow. I was very nervous about candy making because I was told it was very touchy...but it wasn't bad at all! But it did take FOREVER to get the candy up to 220 degrees so I pulled up a chair and \"watched a pot boil\". I couldn't figure out how to cut the candy while it was still hot. But where I come from people pour the candy into a cookie sheet and smash it with a hammer so no one noticed. Be careful because between 250 and 300 degrees the sugar heats up very quickly. Also I had another recipe from the flavoring insert and it said to put the coloring in at 250 degrees and NOT with the flavoring. Other than that no alterations were made to this recipe. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laceybug8806",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4600667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T19:17:00.66Z",
                "reviewBody": "This was fun to try but didn't turn out great for us. Powdered sugar ended up coating the candy and making it whitish and our thermometer was off making it hard. Check your thermometer before starting and see at what temp it shows boiling and then adjust recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SOLLAMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699557/"
                }
            }
        ]
    }
]