[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9057/chicken-bog/",
        "name": "Chicken Bog",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F680090.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-12-05T16:30:18.000Z",
        "description": "I am not sure of the origin of this recipe. It is a cross between a casserole and a stew: chock-full of chicken, sausage, rice and onion. A really good cold-weather comfort food. When you're feeling 'bogged' down, make Chicken Bog to cheer up! This recipe is what is called 'Low Country cooking.'  It is a term used in the coastal regions of South Carolina. Chicken Bog is even served at restaurants in South Carolina along with other local favorites.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 cups water",
            "1 tablespoon salt",
            "1 onion, chopped",
            "1 (3 pound) whole chicken",
            "3 ½ cups chicken broth",
            "1 cup long-grain white rice",
            "½ pound smoked sausage of your choice, sliced",
            "2 tablespoons Italian-style seasoning",
            "2 cubes  chicken bouillon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place water, salt and onion in a large pot. Add chicken and bring all to a boil; cook until chicken is tender, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken from pot and let cool. Remove skin and bones and chop remaining meat into bite size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Skim off fat from cooking liquid and measure 3 1/2 cups of this chicken broth into a 6-quart saucepan. Add rice, chicken pieces, sausage, herb seasoning and bouillon to this saucepan. Cook all together for 30 minutes; let come to a boil, then reduce heat to low, keeping pan covered the whole time. If mixture is too watery or juicy, cook over medium low heat, uncovered, until it reaches the desired consistency. Stir often while cooking.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.361702127659575,
            "ratingCount": 94,
            "itemReviewed": "Chicken Bog",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "717.1 calories",
            "carbohydrateContent": "29.2 g",
            "cholesterolContent": "195 mg",
            "fatContent": "42.7 g",
            "fiberContent": "1.4 g",
            "proteinContent": "50.3 g",
            "saturatedFatContent": "12.9 g",
            "servingSize": null,
            "sodiumContent": "2196.5 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-21T18:43:22.457Z",
                "reviewBody": "I grew up in coastal SC and this is a fall and winter staple. I couldn't give this recipe all the stars, although it is a good place to start for beginners.  But on the downside, the Italian Seasoning is a u-turn in the wrong direction from the roots of this dish. I use about 2 lbs of meat- I generally use boneless skinless chicken thighs. To your biggest stock pot add the chicken.  If you’re using a whole chicken just cover it so that there is about 2 inches of water above the chicken. If you’re using parts use enough water so that it would cover the chicken even if you had double the amount of meat in the pot. Then add two halved onions, 2 carrots and 2 celery ribs cut so that they submerge about 10 whole cloves of garlic 2-4 bay leaves and 2 tbls black whole peppercorns and salt (½ tsp salt/cup water).  Then boil…3 hours should do the trick. When you’re done cooking the meat scoop out the meat and put it in a bowl and shred it when it is cool enough.  Throw out the aromatics – all that should be left is the broth – no need for bouillon or canned broth. If you used a whole chicken, you may want to skim off the fat. Measure your broth and then use the correct amount of rice. Put the chicken back in the pot with the broth, put in a diced link of (cooked) smoked sausage on top of the chicken and put the rice on top of the sausage and bring it to a boil. Cover it, reduce the heat to simmer and cook 20 minutes.  Stir well and taste- add a little pepper or salt and serve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "The Cookworm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T18:20:22.5Z",
                "reviewBody": "I'm from SC and have tried to make this many times with no success.  This recipe worked and the whole family loved it.  I did leave out the Italian seasoning and added salt and pepper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christi Burmester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/457759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-26T14:41:18.09Z",
                "reviewBody": "I misunderstood Holly's directions.  DO NOT boil for 30 minutes.  I thought she meant boil for 30 minutes then turn to low.  I only boiled it for about 10 minutes on med-high heat and the rice burnt to the bottom and the whole dish tastes like smoke.  I assume now she means bring to a boil then simmer for 30 minutes.  If I had done this, I think it would have turned out great (I also omitted the italian seasoning, my husband said that is not how it is normally made)  I am sure most of you seasoned cooks knew what she meant, but I am not, so for all of you non-professionals I burned the rice for you so now you do not have too!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2352946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T20:20:20.89Z",
                "reviewBody": "I live in SC and with a couple tweaks, this is just like what the locals make.  When I boil the chicken I add a little olive oil, herbs, and salt/pepper to the water.  We like ours with more rice so I increased to 1 1/2 cups rice and 4 1/4 cups of chicken broth.  As others have stated, make sure you bring the mixture to a boil, then reduce heat to low and cover for 30 minutes (don't peak).  The rice turns out perfect this way.  Omit the Italian seasoning - a little salt and pepper to taste is all that is necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly Pitts May",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2380533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-21T00:20:53.1Z",
                "reviewBody": "Being I too am from Horry County SC i can tell you this sounds like a good recipe... BUT i would omit the italian seasoning and add plenty of pepper as one reviewer said. I use smoked sausage for my chicken bog.  The origins of this recipe date to civil war times when soldiers had one pot to cook everything in. A big ole stock pot!  I have used a large pack of chicken thighs for this recipe as well.  I also use bagged rice such as mahatma brand for this recipe.  I personally have never used boullion in my recipe and just put everything in one pot.  I have even left the bones in it when cooking it.  Salt and alot of pepper are the key!  Its not a pretty recipe and i always leave the fat in there!  its suppose to be a little greasy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mawbell3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3546875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-10T06:59:16.2Z",
                "reviewBody": "I used this recipe on a catering for 100 people...They LOVED it.  I live in S.C. so we know a real good bog and this is a real good bog!  The only thing I would change is using a product like \"Better Than Bullion\" instead of the cube stuff.\r\nWay to go Holly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TROYTROY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-16T17:23:40.733Z",
                "reviewBody": "I love Chicken Bog so much, and it truly is a regional recipe. I'm from Greenville SC & know it from my SIL who grew up in Florence SC. I was @ work in Clearwater FL one year and said I was bringing Chicken Bog for our Christmas Dinner. One of the guys said, \"How do you know about that? I never knew anyone who knew what that is\".  He had been stationed at Parris Island and a friend's GM made it for him. He was delerious when I brought it in. He was a big guy and loved him some CB!! I love it with the little maple (or plain) breakfast sausages.   Oh yeah, no self-respecting Southerner would use Italian Seasoning!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DBSCANDY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/446783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T18:20:22.36Z",
                "reviewBody": "All it tasted like was Italian Seasoning. I only used half of what the recipe called for and it was still just overpoweringly flavored like Italian Seasoning. I live in South Carolina and I've had it many times (in cafeterias and in friends' homes) and it has never tasted remotely like that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "NOX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/755555/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T18:19:03.07Z",
                "reviewBody": "I grew up eating Chicken Bog and this recipe is similar to how we make it but Ive never heard of it using Italian Seasoning. My mom and I used to do the whole chicken thing but we've started taking shortcuts. Instead of taking all the time to boil a whole chicken and make our own broth I just buy like Swanson chicken broth. And I buy a traditional flavored rotissery chicken and peel the skin off then shred the meat. I then pour the broth into my pot and add sausage rounds and chicken and then bring it to a boil before adding the rice. This incorporates the flavor of the sausage into the broth. Then you add your rice salt and pepper to taste and simmer it till it's cooked. Like I said it's a short cut and cheating for sure but it takes a lot less time and tastes just as good. It never lasts very long around my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Vivacious65",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4824327/"
                }
            }
        ]
    }
]