[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12078/angel-pie/",
        "name": "Angel Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1132335.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "1998-03-04T20:57:35.000Z",
        "description": "A lemon cream pie with a meringue crust.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 10-inch pie",
        "recipeIngredient": [
            "4 egg whites",
            "¼ teaspoon cream of tartar",
            "1 cup white sugar",
            "4 egg yolks",
            "½ cup white sugar",
            "2 teaspoons lemon zest",
            "⅓ cup lemon juice",
            "1 ⅛ cups heavy cream",
            "1 teaspoon lemon zest"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 250 degrees F ( 120 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg whites until stiff. Add cream of tartar and gradually add 1 cup sugar; beat until glossy. Turn the meringue into a well-greased 10 inch pie plate. Spread over bottom and sides of plate, building up the sides 1/2 inch above the edge of the plate. Place in oven, and bake 1 1/2 hours. Turn off oven, and leave meringue inside to cool slowly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine egg yolks, 1/2 cup sugar, 2 teaspoons zest, and lemon juice in double boiler. Cook, stirring constantly, over medium low-heat until thick. Pour into a bowl and cool thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip cold cream until stiff. Place half of the whipped cream in the cooled meringue shell. Cover with a layer of the lemon filling and top with the remainder of the whipped cream. (This top layer can be piped on with a decorative star tip). Garnish with remaining lemon zest. Refrigerate until serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ann"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.705882352941177,
            "ratingCount": 51,
            "itemReviewed": "Angel Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "298.1 calories",
            "carbohydrateContent": "39.9 g",
            "cholesterolContent": "148.3 mg",
            "fatContent": "14.6 g",
            "fiberContent": "0.1 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "8.5 g",
            "servingSize": null,
            "sodiumContent": "44.6 mg",
            "sugarContent": "37.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-01T02:35:38.767Z",
                "reviewBody": "Delicious light and yummy lemon pie with a shell that melts in your mouth. The directions do not tell you to put the beaten egg whites into the pie plate and to \"mold\" the eggwhite edges upwards to hold in the filling after the shell is baked. I have made a similar pie before so I knew to do this. I did not use a bouble bolier as the instructions said but just cooked the egg yolk mixture over medium low heat until it was thick and began to boil. Be sure to cool both the shell and the lemon mixture completely as the instructions tell you. I used two cups of whipped cream and added a little vanilla and powdered sugar to the whipped cream for a hint of sweetening. I garnished the top with a few fresh red raspberries on each piece. I will definately make this recipe again as it is a real winner. I served this for company and everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INSTYLECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/478106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-09T14:13:16.077Z",
                "reviewBody": "This is a trustworthy recipe--no \"surprises.\" Just remember that you're not making a pudding type of filling, you're making a curd, which behaves much differently on the stove. I also whip 2 cups of cream and add about a quarter cup of sugar and 1/2 tsp. vanilla to it. I lighten the curd by folding in a little of the whipped cream. Not only does this lighten it up, it also gives the base a velvety feel to the tongue. Garnish with lemon rind curls & you've got a winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-25T11:14:16.65Z",
                "reviewBody": "This is similar to my recipe but I am all about easy. No need to use a double boiler--just cook the lemon juice sugar (reduced to 1/3 cup) and egg yolk over medium low heat whisking constantly until thick. When the lemon curd has completely cooled fold in 2 stiffly beaten egg whites and 1 (8 oz) container Cool Whip. Pour into meringue shell and refrigerate for at least 4 hours. Then top it with real whipped cream and garnish with lemon peel. This is a great Spring/Summer pie! P.S. Always use a glass pie plate and spray it well with cooking spray before putting in the meringue. This will make serving the pie much easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Wiechert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-28T02:57:20.497Z",
                "reviewBody": "I am on a low carb diet.  I substituted \"Splenda\" sweetener for the sugar and this pie was excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WDEBB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T23:37:34.52Z",
                "reviewBody": "This is a wonderfully light and refreshing dessert. I made a mess of it trying to serve it and I'm glad it wasn't for company. Baked meringue is very fragile and I had a heck of a time getting a slice out in one piece. So for presentation unless you're a whiz at cutting meringe I'd only give it a 3 but the taste is definitely 5-star. The lemon is delightfully tart and is balanced by the sweetness of the meringue crust. I see no need to sweeten the whipped cream as it seems the dessert is sweet enough without it. I was concerned about the relatively small amount of lemon curd compared to the other ingredients but the intense flavor carries through even though the amount is small. This is a wonderful alternative to lemon meringue pie. 4/12/09--I shaped individual crusts on parchment on a cookie sheet. This worked well and I didn't have the mess trying to cut it that I had when it was a whole pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-14T21:05:14.59Z",
                "reviewBody": "This pie induced much selfishness and ill will. Arguements abounded as family members denied sneaking pieces. This lasted less than a full day as this heavenly dessert vanished that fast. At first bite silence fell over the table as our tastebuds sang with pleasure. I did try to mold the pre-cooked meringue into a shape that would contain the filling. No changes were necessary. When I make this again (probably today) I will try piping the whipped cream topping to make it prettier. This deserves a place of honour in your recipe box. UPDATE: To prevent major war I have resorted to cutting the finished pie in half. His and Mine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cynjne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1447121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-20T16:27:37.86Z",
                "reviewBody": "This pie has been a thanksgiving favorite in my family for almost 50 years - the recipe used to be printed on Crystal Sugar sacks. Make sure that you use either the cream of tartar or a 1/2 tsp vinegar, otherwise the shell will not crack and firm up like it should.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DexterIAguy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4216607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T17:34:20.123Z",
                "reviewBody": "This has been my favorite pie for over 50 years. It is light and refreshing... not at all filling after a dinner. It is a perfect combination of sweet and sour/tangy. It is important to mold the egg whites so that the sides are thick and high. If you leave the bottom thick it will stay more on the foamy side and not crisp/harden up like the sides do. I do not like to layer the whipped cream and the lemon curd rather I fold the lemon curd into the whipped cream. I keep some of the whipped cream on the side because that way I can control the tanginess of the filling better. I prefer the filling to be more tangy than perhaps the recipe may portions show so I fold half the whipped cream into the lemon curd and add the more whipping cream to my taste. It is beautiful garnished with thin lemon slices coated with sugar crystals. I give this recipe a 5",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "April Gibson Zatine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3917609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-26T00:27:56.013Z",
                "reviewBody": "This is the most delicious dessert I have ever made-light, refreshing, and tangy.  If you like lemon desserts, you must try this one!  I do add about 1/8 cup of the whippied cream to the curd to make it easier to spread.  It doesn't change the flavor or intensity of the filling.  I don't think the whipped cream needs any sweetening at all, but DON'T forget to well grease the pan!!!  So tasty and wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MNSuzieQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2602761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-02T09:42:18.973Z",
                "reviewBody": "Not sure why this was rated so highly by most folks but we found it to be odd. Not great flavor a strange consistency just ODD lol. I would MUCH MUCH prefer a lemon meringue pie over this concoction.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "bodiggles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4920383/"
                }
            }
        ]
    }
]