[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15103/salad/vegetable-salads/broccoli-salad/",
                    "name": "Broccoli Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16098/alysons-broccoli-salad/",
        "name": "Alyson's Broccoli Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F503913.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1999-12-07T00:37:55.000Z",
        "description": "Confirmed broccoli haters have changed their minds after tasting this salad. It is great for potlucks or buffet meals. Make a day or so before you wish to serve to meld the ingredients. I have used sugar substitutes for the white sugar and also used nonfat or low-fat mayonnaise and it still tastes great!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "10 slices bacon",
            "1 head fresh broccoli, cut into bite size pieces",
            "¼ cup red onion, chopped",
            "½ cup raisins",
            "3 tablespoons white wine vinegar",
            "2 tablespoons white sugar",
            "1 cup mayonnaise",
            "1 cup sunflower seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine the broccoli, onion and raisins. In a small bowl, whisk together the vinegar, sugar and mayonnaise. Pour over broccoli mixture, and toss until well mixed. Refrigerate for at least two hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Before serving, toss salad with crumbled bacon and sunflower seeds.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes",
            "Broccoli Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JJOHN32"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.793327154772938,
            "ratingCount": 2158,
            "itemReviewed": "Alyson's Broccoli Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "558.5 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": "30.8 mg",
            "fatContent": "48.1 g",
            "fiberContent": "3.9 g",
            "proteinContent": "12.9 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "583.5 mg",
            "sugarContent": "13.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-03T20:00:13.923Z",
                "reviewBody": "Fabulous -- and this from a long-standing broccoli hater! :)  Instead of raisins, please use halved seedless red grapes.  Have tried both and the grapes are so much better (to us, at least)...in fact, I always add extra.  I recommend making this the night before in order for the flavors to meld.  You may want to add half the bacon when you make the salad and the rest just before serving so that the salad picks up the bacon flavor but you still get a bit of crunch from the other half of bacon.  I use Splenda for the dressing and you can't tell the difference.  We did not care for the sunflower seeds.  Thanks for the delicious recipe!  *UPDATE* Feb 2008 -- Wanted to pass along that I tried using FROZEN baby broccoli florets.  Worked great!  Bring a pot of water to boil and drop the florets in.  Remove as soon as water returns to a boil so the broccoli doesn't lose its crispy texture, then immediately submerge in ice water.  Simply just thawing or microwaving for a short time might work even better if you want to retain more crunch.  I prefer a little less crunch while hubby likes it very crunchy...I try to find a happy medium. :)  If you catch the frozen pkgs when they're buy one get one, could save a little money as well...fresh broccoli can be very expensive.  Just be sure to use a quality brand if you try frozen.  I used two 1 lb pkgs and made 2x times the dressing (also used extra grapes, onion and bacon).  We LOVE this recipe! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-01T19:32:14.61Z",
                "reviewBody": "What defines taste for this recipe? What can you substitute for what?\r\n1. Keep red onion. Do not substitute it.\r\n2. Keep bacon. You can use more bacon then requested, still be fine.\r\n3. Raisins. I like Jumbo White raisins. Please do not use those little brown once. You need sweet-sour taste. So as previous reviewers said: you can use red grapes, halved; you can use craizins. Sweet-n-Sour!\r\n4. Sunflower seeds or roasted almonds - doesn't matter. They both taste good in this salad. Add them before serving, so they retain cranchinnes.\r\n5. And dressing.\r\nFor dressing you can substitute Real Mayo for Light or for extra Light or for Sour Cream+Mustard+LemonJuice+Salt. Really does not make any difference. You can substitute sugar for Splenda. You can use Red Wine Vinegar.\r\nThe taste should be sweet-salty and a little sour.\r\nWhat important is the amount. If you use too little - it'll be too dry. If you use to much - it'll be soup. Add the dressing gradually. Remember that after a night in refrigirator it is going to absorb some fluid.\r\n\r\nNow - if you do substitutions for Mayo, make sure this thing has salt in it, because if not and you use raisins... they will become grapes again :-), and sometime quite huge grapes.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OOUSHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1129199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-06T20:10:57.187Z",
                "reviewBody": "I have been making this for years, using slightly different amounts of the ingredients.  (4 cups broccoli, 1 cup raisins, 1 cup sunflower seeds, 1/2 cup sweet red onion & 8 slices bacon for the salad.  For the dressing:  1 cup mayo, 1/2 cup sugar, 1 T. vinegar) My suggestion to those who say the broccoli is too \"crunchy\": I always mix up all of the salad ingredients the night before I serve this.  The bacon \"softens\" the broccoli.  I mix up the dressing ingredients separately, in another bowl, and add a couple of hours before serving to let the flavors blend.  And I suggest using \"real bacon\", but I know we're all busy people.  Always delicious...have had so many requests for this salad people pay me to make it for graduations, weddings, etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATMANIACS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/428596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T17:13:08.38Z",
                "reviewBody": "This is a good recipe, but I don't think everyone made it right.  A few reviewers mentioned the bacon and the sunflower seeds getting soft.  The recipe states to put them in right before serving.  This leaves them nice and crunchy and gives the salad a nice balance.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "APRIL4181",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T17:12:53.663Z",
                "reviewBody": "You have to use red grapes instead of raisins.  Cut the grapes in half and add to the salad.  My mom has been  serving this recipe in her tea house for years and always get tons of requests for it.  Everywhere I bring it to I have to hand out the recipe.  Please use fresh grapes though it makes all the difference in the world.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAD43KIDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/635931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:27:36.07Z",
                "reviewBody": "This is good. I have taken this recipe to many functions. Everyone loves it! For variety I eliminate the raisins and sunflower seeds and use red seedless grapes halved and toasted almond slivers. Yummy!I get lots of requests for the recipe even from my husbands fishing buddies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T21:35:11.59Z",
                "reviewBody": "This has been one of my favorite salads for a couple of years.  I'm not a raisin fan, but in this salad, with the blend of the onion, the bacon, and the sweet-sour dressing, the taste is wonderful.  The only thing I do differently is use pine nuts.  I prefer the flavor of pine nuts, and they are larger and don't seem to stick to the bowl as much as the sunflower seeds do.  I have even used sliced almonds as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-23T00:22:41.48Z",
                "reviewBody": "This is a great recipe.  I have had this salad from a deli before, but it always lacked something.  I made this for visiting relatives and they asked me to make it again the next day.  I used red wine vinegar, instead of white wine vinegar.  And, since we are watching our sugar intake, I used Splenda instead of the sugar.  No one knew the difference.  Even my brother- who can smell an artificial sweetener from a mile away- had no idea. It definitely needs to sit overnight for all the flavors to meld.  Great recipe- I am glad to have it!  (Edited 5/22/2010)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JeanneE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-03T00:54:17.17Z",
                "reviewBody": "This stuff is awesome.  I didn't like raw broccoli before now, but now this is my favorite vegetable dish.  I made it with red seedless grapes, cut in half, instead of raisins (in the amount of 2X the raisins that the recipe calls for).  I also used prepared bacon crumbles, the kind that come in a plastic pouch, intended as a salad topping; and low-fat mayonnaise.  Be sure to use white wine vinegar--I think it makes a big difference.  I think you could add just about any fruit, or maybe some white chicken chunks for a complete meal.  I'm going to try it with chicken and diced apple next time.\r\n\r\nMake this; I think you'll like it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RS500",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/661228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-09-04T20:52:46.467Z",
                "reviewBody": "I had trouble with this recipe.  It was way too juicy.  I used one head of broccoli first and then added another and it was still too juicy. I have had broccoli salad before and it was fantastic.  I didn't like this at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanette Boisvert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/289995/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Alyson's Broccoli Salad",
            "description": "This tasty salad is perfect for potlucks and buffets.",
            "uploadDate": "2012-11-26T23:28:50.547Z",
            "duration": "PT2M12.257S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F49256424-3fc1-4c33-bc8d-69e3aec94f29%2Fc7898400-453c-4e3c-959a-43eb53ab4794%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1990706816001"
        }
    }
]