[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16018/caramels/",
        "name": "Caramels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F755536.jpg",
            "width": 2640,
            "height": 1980
        },
        "datePublished": "1999-12-11T15:47:59.000Z",
        "description": "I have used this recipe for almost 41 years, and have yet to have any bad batches. My grandson loves 'em!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 to 5 dozen caramels",
        "recipeIngredient": [
            "2 cups white sugar",
            "1 cup packed brown sugar",
            "1 cup corn syrup   ",
            "1 cup evaporated milk",
            "1 pint heavy whipping cream",
            "1 cup butter",
            "1 ¼ teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 12x15 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium-size pot, combine sugar, brown sugar, corn syrup, evaporated milk, whipping cream, and butter. Monitor the heat of the mixture with a candy thermometer while stirring. When the thermometer reaches 250 degrees F (120 degrees C) remove the pot from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in vanilla. Transfer mixture to the prepared pan and let the mixture cool completely. When cooled cut the Carmel into small squares and wrap them in wax paper for storage.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.644766146993319,
            "ratingCount": 898,
            "itemReviewed": "Caramels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "114.6 calories",
            "carbohydrateContent": "14.8 g",
            "cholesterolContent": "20.2 mg",
            "fatContent": "6.3 g",
            "fiberContent": null,
            "proteinContent": "0.5 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "30.4 mg",
            "sugarContent": "10.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-17T18:12:34.88Z",
                "reviewBody": "There are four important tricks to this recipe.  One--very very lightly grease the pan.  Two--use a large kettle; mixture actually triples in size during cooking phase.  Three--It will take from 30 to 40 minutes to get to 250 degrees.  Finally, make sure caramels are cooled or they will stick to wax paper.  If too cooled, they will be hard to cut.  I put mine in freezer for 5 minutes after about 10 minutes sitting in pan on counter top.  They were really easy to cut and wrap.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYTY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/555750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:47:03.91Z",
                "reviewBody": "I have read the reviews on this recipe and think I know why some of you have caramels that turn out too soft and some too hard.  First of all this recipe says to cook to the hard ball stage.  The hard ball stage has a range of 250 - 266 degrees.  To find out what degree you should use for your candy, use this calculation...Candy should come in 1 degree lower than indicated in the recipe for each increase of 500 feet above sea level.  For instance if your recipe calls for 250 degrees and you live at 2000 feet above sea level, take 4 degrees off which would come to 246 degrees.  Also, the book says that one day your candy may set using 250 degrees and the next day it may take 254 degrees depending on weather, etc.  You could always use the cold water test...drop a teaspoon into very cold water to see how it sets.  Hard ball stage should hold it's shape when removed from the water and formed into a ball, but should still be pliable.---I HOPE THIS HELPS!!! Kim",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAWSPATCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/955458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-06T16:39:21.577Z",
                "reviewBody": "This is a GREAT recipe, always gets raves!  A few tips I've found helpful:  First, calibrate your candy thermometer in boiling water.  Should read 212 degrees.  If it doesn't, adjust your recipe accordingly.  I'm on my 2nd thermometer and both have been 5-7 degrees off.  Also, instead of greasing the pan I line it with parchment paper.  The caramels won't be extra greasy, won't stick to the paper and can be easily lifted out when set.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAMILYOF498",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1313307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T23:45:31.983Z",
                "reviewBody": "Excellent recipe. For you \"new\" caramel makers out there, please keep in mind that it's going to take anywhere from 40 minutes to an hour of cooking these to get them to the proper temp, but don't try to rush them along with higher heat or they'll just scorch!  Just be sure to allow yourself enough time when making them and you should be quite pleased with the results...good things come to those who wait!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBBIEWI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/854511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:47:03.443Z",
                "reviewBody": "I needed a recipe for Caramel Apples - and I didn't want to do it with store bought caramels.  I found that this recipe works perfect as long as you follow these rules:\r\n\r\n1) Double it if you want to be able to dip easily.  It does double nicely, although it takes even longer to get to the proper temperature (over an hour).  As someone else had mentioned, make sure you have a pot is MORE than double as high as the caramel as it will expand at one part of the cooking (it does shrink back down).\r\n\r\n2) If there are any solids on the can lid of the evaporated milk, don’t add it; it will not dissolve in the caramel and you’ll be left with little chunks in the finished product.\r\n\r\n3) Being close to sea level, I stopped at 240F and it was perfect for dipping apples; it set up nicely, and was firm enough to pour the remaining in a pan for chewy caramels.\r\n\r\n4) After you remove from the heat, wait until the temperature drops to about 170F or less before dipping.  Otherwise, the heat will cook the apples and you'll get bubbling from the juice trying to escape.\r\n\r\n5) I know people here have said that they don't trust candy thermometers, but my guess is that they've never used a good one.  A DIGITAL probe with a wire cord (available at any kitchen store) is the only way to go for these long cook-and-stir projects.  You can set it to alert you when you're at the correct temperature.\r\n\r\nI placed the apples on Silpat mats (non-stick pad with silicon in it), which works better then wax paper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAUNH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/893571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T00:13:06.043Z",
                "reviewBody": "I am a caramel-a-holic and when my local candy maker died, I thought I needed to learn to make my own. This is an excellent recipe. The best taste of any caramel I've had, including very expensive ones.\r\nA couple thoughts...if you get tired and can't go the distance to 250 degrees, this recipe is extremely forgiving....stop and try again later. Nothing is ruined by stopping. I found that I needed to stop exactly when my candy thermometer hit 248-250...otherwise the caramels got too hard. Definitely go easy on the buttering of the pan. These caramels have been a huge hit with all my family and friends. I would advise that you plan to make them at a time when you can turn the phone off, get the dog from underfoot and focus only on this---250 degree sugar is nothing to trifle with!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUICKBEAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-07T00:50:17.61Z",
                "reviewBody": "These are very yummy.  My candy thermometer doesn't really work, so we just cooked until it reached the firm ball stage (a drop of the mixture forms a firm but pliable ball when dopped into ice water).  It took approx. 30 minutes of cooking and stirring.  It is very helpful to make this with someone else, that way there are 2 people to get everything ready and take turns stirring, etc.  Don't do what we did and line the pan with foil before pouring the caramel in... it stuck badly to the foil and we almost had a caramel disaster!  We had to fill up the sink with hot water and float the pan of caramel in the hot water in order to loosen the foil enough.  Then we eneded up losing some of the caramel, because it still stuck to the foil.  My fault though!  This caramel tastes so good that we couldn't stop eating it!  Perfect flavor and texture. ******** Made these again a few weeks later but only had 1/2 cup corn syrup.  So I used honey for the rest, and they were absolutely amazing!  So much better than before, and I didn't think that was possible!  ;)  I may try them again sometime with even more honey.  The texture is a little softer, but I like that anyways.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-19T03:14:44.56Z",
                "reviewBody": "I have not actually made this recipe, but I do make a lot of candy.  I am wondering if some of the people who had trouble getting the temp to 250 degrees were using a non-stick pot instead of a heavy pot - like Farberware or similar.   In the past, I tried making candy in a teflon coated pot, thinking it was the smart thing to do, and my candy invariably failed.  I could never figure out why my Grandma got hers to work and I followed the recipe exactly.  There is something about the non-stick pot that messes up the candy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANIEJANIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1326411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T20:58:34.733Z",
                "reviewBody": "I have adopted some Marines aboard an aircraft carrier and send them goodies each week. This week they are getting these yummy caramels.  Due to travel time and heat it is not easy finding appropriate baked goods and candy to send to them.  After I individually wrap them and package well, these should do just fine.  If my fudge made it to them in good condition, these caramels should as well. Wish to thank Barbara for the recipe.  I am from the old school of candy making and am about to throw that ^%&&^ candy thermometer away, almost ruined the candy!  I trust my old wooden spoon and a small cup of cold water better to tell me the correct temp. Worked out just fine this way!  I will be making these often for grandchildren, husband and at Christmas.  I recommend even first time candy makers try this recipe, you will be happy you did.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/255872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T19:09:06.183Z",
                "reviewBody": "It does not say if you cook it on high, medium or low. I put it in between high & medium. When I poured it out of the pot into the pan, there were large black clumps where it totally burned on the bottom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "littlelovemuffin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4908336/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Caramels",
            "description": "See how to make satiny-smooth caramels from scratch.",
            "uploadDate": "2013-12-18T01:14:48.455Z",
            "duration": "PT2M34.279S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0f0cc918-5d2f-4752-9841-ab3b6d93cc18%2Fcd40b0ff-a400-4753-b247-e75bc0fffb65%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2944258506001"
        }
    }
]