[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9862/stained-glass-window-cookies/",
        "name": "Stained Glass Window Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F108604.jpg",
            "width": 1816,
            "height": 2048
        },
        "datePublished": "1997-08-11T18:26:05.000Z",
        "description": "These are cookies which have open spaces which are filled with crushed hard candy (yellow and red work best).  When baked, the candy melts and gives the appearance of \"stained glass\".",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "⅔ cup butter",
            "1 cup white sugar",
            "½ teaspoon vanilla extract",
            "2 eggs",
            "3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "⅓ cup milk",
            "40 fruit flavored hard candies"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).  Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar.  Stir in vanilla and eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another bowl, sift together flour, baking powder and salt; add to egg mixture alternately with milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll the dough 1/4 inch thick.  Cut into 1/4 to 1/2 inch wide strips and, on a well-buttered baking sheet, form into window frames.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Keeping the colors separate, place candy in plastic bags and crush with a meat mallet.  Place crushed candies inside window frames.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for six minutes, or until candy is just melted.  Cool on baking sheet for 5 minutes, until candy is hard.  Carefully lift cookies off baking sheet with spatula.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kim Hogan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.2816901408450705,
            "ratingCount": 71,
            "itemReviewed": "Stained Glass Window Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "242.5 calories",
            "carbohydrateContent": "40.5 g",
            "cholesterolContent": "39.1 mg",
            "fatContent": "7.7 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "182.3 mg",
            "sugarContent": "19.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-21T18:42:11.763Z",
                "reviewBody": "My mother and I loved making these cookies! We took the advice from the reviewer who recommended increasing the sugar to 1 and 1/4 cup cutting the milk down to about 3 Tablespoons and boosting the vanilla to 1 teaspoon. Make sure you use lots of flour while rolling out. Keep the dough chilled. There is no need to break the candy up unless you want to combine colors; we found that both lifesavers and jolly rancher candies melted completely just as they are. DO use aluminum foil instead of putting the cookies directly in the cookie sheet. DO spray Pam on the foil. The cookies will come off the foil easily once they are cooled. And you can re-use that foil too for a second round. Finally we increased our baking time to about 10 minutes. At 6 minutes the dough was not quite done to our taste. A truly beautiful (and tastey) result!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SINESSE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/923028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T15:23:07.46Z",
                "reviewBody": "After reading the other reviews I decided to make these cookies but keeping in mind that some people found the dough sticky and a bit bland I increased the sugar by about 1/4 cup cut the milk down to about half the suggested amount and increased the vanilla to about 1 teaspoon. I added the last cup of flour at the end and then used lots of flour on my rolling surface to stop them from being too sticky. They turned out great and my kids loved them! I did large star shapes with smaller star cut outs in the middle and found I needed 2 Jolly Ranchers to have the \"windows\" look really full. Try using 2 different colours of candy in one cookie--it's a great effect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUBIE66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729447/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T13:52:16.403Z",
                "reviewBody": "I used this recipe with stars at Christmas...I found that using the lifesavers-R five flavors works better than the black cherry rolls...also I used aluminum foil on my baking sheets. This kept mess to a minimum and made it easy to transfer cookies off the sheet so I could use the sheet for the next batch. They peel off the aluminum very easily when they cool.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TYM4COFFY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T21:06:35.603Z",
                "reviewBody": "This recipe is awesome! The only thing I might suggest is spliting up the dough into 3 sections wrapping it up with wax paper and chilling it for a half hour to forty-five minutes before you roll it out. You also might want to use parchment paper instead of foil. You don't have to grease it or anything. You also might want to roll it out on powdered sugar instead of flour. If after you cut your dough with cookie cutters you like to re-use it... this is good because it prevents the dough from getting too dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BakerGirl04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2804821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T18:30:09.853Z",
                "reviewBody": "Like others I increased the sugar and vanilla and decreased the milk. The dough was still very sticky so I ended up using about twice the amount of flour. They are easier to cut out when thick and less likely to break but they took 9-10 minutes to bake. For the centers of the heart shape I used leftover strawberry candy canes. I didn't bother to crush them just broke them into small enough pieces to fit in the centers. They looked great with red \"zebra stripes\" in the middle from the candy canes and red sugar sprinkles around the outside. Around Christmas you could use peppermint candy canes and mint flavoring and green food coloring for the dough to make them more festive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "irelandwhispers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2071688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-19T16:36:19.2Z",
                "reviewBody": "Our \"Valentine Window\" cookies turned out beautifully! We used a 4\" heart with a smaller 1-1/2\" heart cut out for the window. Rather than crushing the candy we used full size watermelon/cherry jolly ranchers. My boys had lots of fun unwrapping the candy and putting it in the windows then watching it melt in the oven. I added about 1/4 to 1/2 cup extra flour to stiffen up dough enough to make it easy to roll. Next time I try this recipe I think I'll refrigerate the dough and skip the extra flour as the cookies were somewhat bland by my standards. However my kids and husband like them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SMAMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/587851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-08T21:28:39.153Z",
                "reviewBody": "try using hard cinamon candy instead! makes a very nice twist!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BABYWILLMAKE4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/543880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-01T23:39:24.987Z",
                "reviewBody": "I followed the others reviewers recommendations with 1.25 c sugar 1 tsp vanilla and 3 tbsp milk and the dough tasted good. I chilled and rolled out on parchment paper and didn't need any extra flour when rolling out. Also baked on parchment paper no cooking spray needed and no sticking. I made a variety of sizes and used several kinds of candies we had around the house. I think 1\" holes with one candy are the best combo for eating. I found with too much candy in the center the cookies stuck to my teeth when warm and then were too hard to chew when cool. With bigger centers one candy wasn't enough to fill it and 2 was too much candy for comfortable eating. Some brands of candy didn't melt well and needed to be broken up before putting in oven but some brands melted great and made beautful centers with no breaking. It took me 2 experimental batches to figure out a happy combo that was pretty edible and properly melted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs. kosmos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3825395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T04:51:12.297Z",
                "reviewBody": "Cookies were good but they stuck fast to the cookie sheet and broke when trying to get them off. I would not make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/602730/"
                }
            }
        ]
    }
]