[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/720/world-cuisine/european/dutch/",
                    "name": "Dutch",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15683/dutch-apple-pie-with-oatmeal-streusel/",
        "name": "Dutch Apple Pie with Oatmeal Streusel",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3089047.jpg",
            "width": 3264,
            "height": 1836
        },
        "datePublished": "1999-12-13T18:51:06.000Z",
        "description": "The crunchy oat topping adds an extra dimension to this delicious apple pie. Try using Golden Delicious, Jonagold, or Granny Smith apples for this pie.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 pie",
        "recipeIngredient": [
            "1 (9 inch) pie shell",
            "5 cups apples - peeled, cored and sliced",
            "2 tablespoons all-purpose flour",
            "⅔ cup white sugar",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "¼ teaspoon ground allspice",
            "2 tablespoons butter",
            "¾ cup all-purpose flour",
            "½ teaspoon ground cinnamon",
            "½ cup packed brown sugar",
            "¾ cup rolled oats",
            "1 teaspoon lemon zest",
            "½ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Fit pastry shell into pie pan and place in freezer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Apple Filling: Place apples in a large bowl. In a separate bowl combine 2 tablespoons flour, white sugar, 1/2 teaspoon cinnamon, nutmeg, and allspice. Mix well, then add to apples. Toss until apples are evenly coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pie shell from freezer. Place apple mixture in pie shell and dot with 2 tablespoons butter or margarine. Lay a sheet of aluminum foil lightly on top of filling, but do not seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While filling is baking, make Streusel Topping: In a medium bowl combine 3/4 cup flour, 1/2 teaspoon cinnamon, brown sugar, oats, and lemon peel. Mix thoroughly, then cut in 1/2 cup butter or margarine until mixture is crumbly. Remove filling from oven and sprinkle streusel on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to 375 degrees F (190 degrees C). Bake an additional 30 to 35 minutes, until streusel is browned and apples are tender. Cover loosely with aluminum foil to prevent excess browning.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Dutch"
        ],
        "recipeCuisine": [
            "European",
            "Dutch"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Ginny"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.593939393939394,
            "ratingCount": 660,
            "itemReviewed": "Dutch Apple Pie with Oatmeal Streusel",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.8 calories",
            "carbohydrateContent": "63.4 g",
            "cholesterolContent": "38.1 mg",
            "fatContent": "20.4 g",
            "fiberContent": "3.2 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "10 g",
            "servingSize": null,
            "sodiumContent": "209.8 mg",
            "sugarContent": "38 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-14T20:06:41.443Z",
                "reviewBody": "This is an excellent recipe.  A couple little hints may help those that are having problems.   I didn't freeze my pie crust.  I lightly brushed the crust with a beaten egg white, let it dry (while I was peeling apples) then put it in the oven at 400 degrees for 5 minutes.  Also, adding a  heaping TLB of INSTANT TAPIOCA to the apples when you toss them will thicken any excess juice without adding additional flour.  It won't change the taste.  I do this to all my fruit pies whether the recipe calls for it or not.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARB MAXWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-19T15:46:50.733Z",
                "reviewBody": "Wow, wow, WOW!  Fantastic pie!  I'm extremely fussy about apple pie and this is the best one I've ever made in thirty years!  I did tweak the recipe slightly, taking into consideration all of the previous comments.    Here's what I did: \n\n1. Used a good homemade all butter crust and a glass pie plate   2.  Used half Fuji and half Granny Smith apples, totalling 3 pounds (a little more than five cups)   3.  Increased the flour to a rounded quarter cup   4.  Omitted the lemon zest (don't like lemon and apple together) and the allspice (didn't have any) and substitued quick oats for rolled ones.\n\nI also discovered that you can do the initial baking of the apples and crust ahead of time.  I had to leave, so I just took it out of the oven, lightly covered with foil and when I returned 3 hours later to finish baking it, it worked out great.  \n\nWith the full three pounds of apples I used, and all that streusel topping, it looks HUGE before it bakes but it comes out the perfect size.\n\nWith a glass pie plate I dropped the oven temp to 360 degrees and I ended up baking it much longer (at least ten or fifteen minutes longer) until I could view the browned crust on the bottom (easy with a glass pan)  This is crucial because otherwise you get a soggy crust on the bottom.\n\nWe ate the pie after it had totally cooled and the slices held together perfectly.  Delicious!  Give it a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Feldman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/299385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-22T22:20:21.14Z",
                "reviewBody": "I only bake pies once or twice a year, but I like to make many of the same kind at once.  Having said that, I found a few things with my second batch of pies that I would like to share.  The crust does indeed go soggy and tends not to bake at the bottom, so for the second batch of 3 pies, I first brushed the frozen pie shells with lightly beaten egg whites before filling (it acts as a barrier and prevents the sogginess) and I also baked the pies at the lowest rack setting of my oven for 20 minutes at 425 degrees.  Once I lowered the oven temperature to 375 degrees, I placed the pies back on the middle rack.  I also used three LEVEL tablespoons of flour in the filling...I found the three heaping tablespoons recommended by other reviewers to be too pasty and two tablespoons to be too runny.  I didn't have any problems with the apples not cooking through, but I sliced them very thinly because the lower sugar/water content in granny smiths tends to make them hold their shape and stay firm otherwise.  It is a very good recipe and  definitely worth a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "REDWINECHICK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-15T05:57:35.513Z",
                "reviewBody": "This kicked a!!! to get rid of some of the moisture mix apple mixture first and drain before putting into shell. This was the best topping ever! I had to patch up parts of the pie where I ate the top off while cooling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLIM!!!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-05T13:41:59.327Z",
                "reviewBody": "This is an excellent Dutch Apple Pie recipe that will make your Grandma proud!  Very east to make.  I made a few minor changes:  I didn't freeze the pie shell - couldn't see the advantage.  And I didn't have allspice, so I found on a website a perfect substitute:  1/4 teaspoon ground cinnamon, 1/2 teaspoon ground cloves and 1/4 teaspoon ground nutmeg, mixed together. This will make more than the 1/4 teaspoon called for, so I just saved the extra, put it in a little jar and labeled it \"allspice\" for my next recipe that calls for it.  This pie is scrumptious - especially with a little scoop of vanilla ice cream!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christiane Clermont",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18131839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-19T01:24:11.903Z",
                "reviewBody": "OMGosh!!!  This was fabulous.  I am not big on apples, but I LOVE pie; but have never made a good apple pie until now!  My husband, who is an apple pie connoisseur also LOVED this.  I made this pie to serve tonight for our second night of Sukkot (The biblical Feast of Booths/Tabernacles).  Many of our neighbors came to fellowship with us and EVERYONE raved about this pie.  There was none left.  THe plate was licked clean!!!  This one goes in the recipe box and will be used often.  The only alteration I made was to omit the lemon zest, just did not sound good to me.  Anyway, this is a must try!!!  We love it.  Thank you and God bless!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joeyanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1562633/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-12T01:11:30.387Z",
                "reviewBody": "I made this recipe as is except for the lemon zest. It is very tasty! I had no problem with the crust and I did use the egg white trick. The resulting pie is super tasty although I think it could use a little more cinnamon! Served with vanilla ice cream to guests and was told that I was \"missing my calling\" that I need to start a restaurant right now!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Skoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T20:53:49.903Z",
                "reviewBody": "My family loved this recipe! I made two of these (and one pumpkin pie) for 9 people and these two DISAPPEARED before I could blink. Sorry, pumpkin! I used Jonagold in one, Granny Smith in the other. I used some of the suggestions in the reviews (no lemon zest, 3 T. flour). I find Granny Smiths will stay too firm for my family's liking at only 40 min. baking, so for that pie I cooked the apple mixture for about 5 min. in a saute pan with 1 T. unsalted butter. Softened them just slightly enough to come out perfect after baking. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LeeluDallas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/828655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T17:46:53.92Z",
                "reviewBody": "I've tried a bunch of apple pie recipes searching for THE ONE and I've finally found it! This recipe is perfect! The filling has just the right amount of sweetness and spice and the streusel makes a yummy cookie-like topping. For those of you having issues with how much flour to add every batch of apples is different so the amount you need will vary from pie to pie. The best way is to coat your freshly cut apples with about 1-2 tbs of lemon juice and 1/4 c sugar let sit in a colander for 15-20 minutes and the excess juices will run off. If your apples are really juicy you will need more flour if they are on the dry side you can use less. If you want you can do this over a bowl and save the juices to reduce and mix back into the pie before it bakes or use as a glaze on top. I used two heaping tablespoons in mine and it was perfect. Also when using flour as your pie thickener it's very important that the filling come to a BOIL! If it's not vigorously bubbling the flour will not thicken properly; your pie will be runny and you will still have that \"flour-y\" taste. And remember the pie needs to cool for at least a few hours so the juices solidify before you cut it. Even the best made pie will be runny if you cut into it right away.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "D. Gray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2410543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-14T17:21:28.317Z",
                "reviewBody": "Tasty topping but a watery soggy mess! Apples undercooked even after an additional 10 minutes in the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "jillybee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2789680/"
                }
            }
        ]
    }
]