[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/851/desserts/cookies/oatmeal-cookies/",
                    "name": "Oatmeal Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15334/kristens-awesome-oatmeal-cookies/",
        "name": "Kristen's Awesome Oatmeal Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F27788.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "1999-12-18T15:07:17.000Z",
        "description": "This is my mothers recipe and it really is awesome!  They are somewhat crispy but not cakey. You can add raisins, chocolate chips or coconut to this recipe too.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "¾ cup shortening",
            "1 cup packed brown sugar",
            "½ cup white sugar",
            "1 egg",
            "¼ cup water",
            "1 teaspoon vanilla extract",
            "1 cup all-purpose flour",
            "1 teaspoon salt",
            "½ teaspoon baking soda",
            "1 tablespoon ground cinnamon",
            "3 cups rolled oats"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together the shortening, brown sugar and white sugar. Stir in the egg, water and vanilla. Combine the flour, salt, baking soda and cinnamon, stir into the creamed mixture. Finally, stir in the rolled oats. Drop by rounded spoonfuls onto the prepared cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 12 to 15 minutes in the preheated oven. Cool on baking sheets for a couple of minutes before removing to cool on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Oatmeal Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KRISTEN HATHAWAY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6301775147929,
            "ratingCount": 338,
            "itemReviewed": "Kristen's Awesome Oatmeal Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.3 calories",
            "carbohydrateContent": "19.4 g",
            "cholesterolContent": "6.2 mg",
            "fatContent": "5.9 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "103.5 mg",
            "sugarContent": "10.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-11T07:46:50.723Z",
                "reviewBody": "I've tried quite a few oatmeal cookie recipes this has been by far the best one...although I used only 1tsp. of cinnamon as I don't like them to cinnamon-y it was the perfect amount if you prefer just a hint of spice to your cookie. everyone loved them..including my kids who don't like anything that may sound as if it has something healthy in it...the 2nd time I made them I added in a package of milk chocolate chips and 2 cups of chopped walnuts. it didn't make them to dry and they still came out perfect. thanks for the recipe I'll use from now on.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2154445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-22T20:19:21.087Z",
                "reviewBody": "OK,OK, I\"m not a baker, nor will I ever be..but this is a keeper and a great base recipie.  The first time I used shortening...they were good, but the second time I used BUTTER and added dried cranberries and bittersweet chocolate chips, and they were simply OUT OF THIS WORLD!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris in Montreal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-08T13:19:49.653Z",
                "reviewBody": "theses cookies are awesome I've made them both with and without chocolate chips. (Of course I didn't add the cinnamon when adding chips) I used a mini ice cream scoop to drop cookies on sheets then after 10 minutes of baking I flattened the puffed cookies slightly with an \"egg flipper\" then baked for 3 more minutes this made them super chewy inside and crispy on the edges absoulutely DELICIOUS just like the bakery this way! Thanks very much for the recipe Kristen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kellycooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-19T12:58:47.34Z",
                "reviewBody": "Okay, so here's the thing. I wanted to use butter (I don't keep shortening on hand outside the Christmas season) but I didn't want to use a stick and a half so I used the servings adjuster thingie on this site and cut it back to twenty servings which made it one stick of butter (which is half a cup). I had to do a little monkey-ing around with a few of the ingredients to make them come out even, like I used one whole egg which meant I had to eliminate the water called for in this recipe. I also used a full teaspoon of vanilla and added a half cup or so of organic raisins. Even with my adjustments (or crazy changing to round amounts), this cookie baked up fabulous and didn't seem to be affected by my changes. That's a sign of a wonderful recipe--it dosen't fall flat when you change up the recipe a bit. The cookie was perfectly cinnamon-y and it was chewy with a slight crisp on the edges. I like my oatmeal cookies soft usually but I really liked the flavors of this. I'll make this recipe again, but I'll make sure to make a custom recipe so I remember the changes I made to suit 20 servings or using one stick of butter. NOTE: GREASE YOUR SHEETS. Trust me. Otherwise, you'll have a hard time getting these cookies off of the cookie sheets. Also, 350* for eleven and a half minutes was just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-15T16:55:35.2Z",
                "reviewBody": "This oatmeal cookie is the classic slightly crispy/mostly chewy cookie I remember from childhood. I made it EXACTLY as written and have the following observations. The recipe is simple enough my children are able to follow most of the instructions independently. I found the dough to be quite soft - a little wet even; but the finished product was outstanding. I baked the cookies on ungreased parchment paper lined cookie sheets and had no problems with sticking or spreading. For the final batch I stirred in Orchard Trail Mix available at Wal-Mart and the cookies maintained their shape and consistency despite the fairly large yogurt covered raisins and cashews in the mix. I would reduce the cinnamon to 1 tsp. in the future if I were planning to add raisins nuts or trail mix. This recipe has joined the gang posted on the back of my cabinet door and will be made often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julieschild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T16:24:19.33Z",
                "reviewBody": "I did a double batch and it made more than 100 \"two-bite\"-sized cookies! Substituted butter for the shortening and added dried cranberries and mini-semi-sweet chocolate chips. I also halved the cinnamon as I was not sure how it's flavour would mix with new ingredients. Great texture and flavour. A bit too sweet...I used a whole bag of chocolate chips...next time I would cut this in half and cut the white sugar in half as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MADDYV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1075687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-12T11:29:30.873Z",
                "reviewBody": "I added dried cranberries and butterscotch chips to these for a great \"autumn\" cookie. I took some to work and they vanished in seconds! The batter spread just the right amount: not too round and cakey but not totally flat and delicate either. Take them out of the oven to cool on the cookie sheet before they really look \"done\" if you want them chewy instead of crispy (9-10 min). Also this recipe makes a lot...I got over 3 dozen! This recipe will become a staple for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2096031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-07T14:33:17.61Z",
                "reviewBody": "This recipe is properly named. They are awesome. I like them with a dash of powdered ginger and the full amount of cinnamon. My sweetie likes them with chocolate chips but I think they're better without. It makes about 42 rounded-spoonful-sized cookies and they still disappear quickly! P.S. If you're trying to sell your home cook a few batches during an open house the aroma is amazing! - P.s. I used butter not shortening.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2308178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-14T19:32:13.873Z",
                "reviewBody": "Love this recipe. Cookies turned out crispy on the outside and chewy in the middle. You have to make sure you don't spread them out as you spoon or they will be too thin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinCrystal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-05T16:25:23.63Z",
                "reviewBody": "Be alert that because there is such a high oatmeal to flour ratio that these are definitely OATMEAL cookies with lots of whole-grain oat texture. It was a tad too much for me not only in texture but in flavor as well. I used butter rather than shortening and would do so again. The generous amount of cinnamon helped tame the almost too bold oaty flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ]
    }
]