[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/669/meat-and-poultry/pork/bacon/",
                    "name": "Bacon",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14741/meat-and-poultry/pork/bacon/appetizers/",
                    "name": "Appetizers",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14967/bacon-and-tomato-cups/",
        "name": "Bacon and Tomato Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2309946.jpg",
            "width": 1296,
            "height": 1296
        },
        "datePublished": "1999-12-21T02:00:03.000Z",
        "description": "Little buttermilk biscuit cups are baked with a savory mixture of bacon and tomato inside.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H42M",
        "recipeYield": "30 mini muffins",
        "recipeIngredient": [
            "8 slices bacon",
            "1 tomato, chopped",
            "½ onion, chopped",
            "3 ounces shredded Swiss cheese",
            "½ cup mayonnaise",
            "1 teaspoon dried basil",
            "1 (16 ounce) can refrigerated buttermilk biscuit dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a mini muffin pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium heat, cook bacon until evenly brown. Drain on paper towels. Crumble bacon into a medium mixing bowl; add chopped tomato, onion, Swiss cheese, mayonnaise, and basil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate biscuits into halves horizontally. Place each half into prepared mini muffin pan. Fill each biscuit half with the bacon mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until golden brown, 10 to 12 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Bacon",
            "Appetizers"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TABKAT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6401551891367605,
            "ratingCount": 1031,
            "itemReviewed": "Bacon and Tomato Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "216.1 calories",
            "carbohydrateContent": "15 g",
            "cholesterolContent": "18.2 mg",
            "fatContent": "15.1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "429.6 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-05T20:26:26.217Z",
                "reviewBody": "For those of you who thought the biscuit dough was a little too heavy the second time I made these I used the mini frozen phyllo dough cups and they were trememdous. I also cut way back on the mayo and still stuck with a good jar of brushetta in lieu of chopped tomato.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T23:11:15.7Z",
                "reviewBody": "Took these treasures to the in-laws' family reunion this past weekend, and they were a HUGE hit!!  Tripled the recipe since it was such a large crowd to feed, and they were devoured!\r\nRead all of the previous reviews and incorporated several of them into the recipe.\r\n1.  Definitely use much less mayo... just enough to moisten.  \r\n2.  Green onion works quite nicely in texture, taste, and overall presentation.\r\n3.  Cut bacon, then cook.\r\n4.  Added a little garlic powder and Hot Shots.\r\n5.  Bought 16 oz can biscuits b/c that's what the recipe called for... used the flaky grands buttermilk biscuits, cut them in 1/4's, shaped them into balls, then rolled with a rolling pin to flatten... makes nice little cups this way.\r\n5.  Was having to travel a long way with these in the car, so I cooked them the night before, kept them in a cooler on ice, then reheated them in the microwave when we got to the party.  They turned out fine after their long journey.\r\n\r\nWill consider using cream cheese/milk mixture next time that previous reviewer suggested.\r\nMay also try different variations such as \r\ncanned chicken, pizza, quiche, philly cheese steak, ham, you name it!\r\nGreat thing about this delightful recipe is the  possibilities are endless!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christmas Tillotson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/846919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T20:22:36.013Z",
                "reviewBody": "i didn't want to get a new type of pan to make this recipe... so, i used this filling in the pillsbury crescents.  i just put a tablespoon at the base of the triangle & rolled it up.  yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOBYSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/288855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T20:22:06.78Z",
                "reviewBody": "This will be one of my all time appetizers. Actually I can make an entire meal of these with a nice bottle of wine. You can make the filling a day ahead and then it takes only a minute to stuff the muffin tins and bake. It sits well at room temperature and I haven't found anyone that doesn't love them. Cut back a little on the mayo because it can cause them to become a little greasy when sitting around. I make triple what the recipe calls for and they are still gone. BTW the \"per serving\" amount means only one bite per person and that just won't happen! These are outstanding!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLENA  ROCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T20:23:07.857Z",
                "reviewBody": "Yummy appetizers! As other reviewers said to cut mayo, I used half mayo and half cream cheese; added a little garlic powder and baked as suggested. Although phyllo shells are more expensive than refrigerated dough, I thought it was well worth the extra expense when I did a side by side taste test. The phyllo shells make this a flaky crispy treat, while the dough makes it so soft that the outer shell blends in texture wise with the filling. I prefer phyllo shells with this...I will definitely be making this recipe for my New Years Eve buffet. Thanks Kelli!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T20:26:31.303Z",
                "reviewBody": "Easy to make and very flavourful. A big hit with the men.  These also freeze rather well after baked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diva Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-18T03:01:29.09Z",
                "reviewBody": "I took this to a party and it was very popular! I followed the advice of previous reviewers and only added enough mayonnaise to moisten and hold the filling mixture together, which was about 1/3 cup. My other changes to the recipe were to cook the onion in a bit of the bacon fat before adding it to the filling mixture because I don't care for a sharp onion flavor. I didn't have any dried basil, so I added about 1/3 cup chopped fresh parsley (mainly for color) and a little chopped fresh sage and savory. It was a super easy recipe to prepare and the results look like you went to a lot of effort. I didn't find 1/2 a biscuit to be too much dough, I thought it made a pretty puffed appearance to the cups (I tried some with 1/2 and some with 1/3 a biscuit). Make sure your biscuit dough is cold for easiest separation into  layers. My only negative about the recipe would be that I have never eaten canned refrigerated biscuits before, so the slightly sweet flavor of the dough was not something I was accustomed to. Nobody else seemed to care. I did think they tasted best after standing for 10-15 minutes rather than hot straight from the oven",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T23:00:30.903Z",
                "reviewBody": "Great recipe.  Had twenty people over for Christmas open house. Made several hors d'oeuvres and this one was the biggest hit.  I separated the biscuits into thirds and used three diced up green onions instead of yellow.  I only used about 1/4 cup of mayo and put just a little more\r\nswiss cheese on top of each cup. Thanks Kelli!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PIDGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/346085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T23:27:34.427Z",
                "reviewBody": "I'm giving this five stars as I truly believe it's a five-star recipe because everyone at the New Year's Eve party I took these to LOVED them. I however expected to love them and just thought they were okay. I scaled the recipe to make 24 used fresh-grated sharp cheddar cheese instead of Swiss fried and drained my own bacon and used just a few teaspoons of sour cream in place of the mayonnaise. I think the bacon was way too overpowering and that's all I tasted (and I LOVE bacon!) I wanted to use the phyllo cups like so many people suggested but my grocery store was out of them. I used the buttermilk biscuits and by all means definitely cut them into quarters! I couldn t imagine using these in halves that would be WAY too much dough for the mini muffin tins!! Also be weary of putting too much filling in these mine overflowed in the oven upon baking whoops! Anyway I will definitely make these again as like I said my friends raved about them but I think I'll definitely cut back on the amount of bacon called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSANLEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T03:50:44.81Z",
                "reviewBody": "I made these to take on a campout. They were easier to make than I thought they would be but my husband and I didn't like them. The mayonnaise gives them a peculiar flavor. We both agreed they would probably taste better with cream cheese than mayo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "taramclarty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/630785/"
                }
            }
        ]
    }
]