[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15492/ganache-i/",
        "name": "Ganache I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1035003.jpg",
            "width": 4288,
            "height": 3216
        },
        "datePublished": "1999-12-22T14:13:42.000Z",
        "description": "Ganache is a mixture of cream, or butter, and chocolate. Ganache can be made thick enough to use as a truffle filling or thin enough to use as a glaze. A 'thin' Ganache can be melted to use as a glaze or whipped, and used as a filling for cakes. Use the best quality chocolate you can find.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "2 cups heavy whipping cream",
            "1 ¼ pounds bittersweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Chop the chocolate into small pieces and place it in a large stainless steel bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large, high sided saucepan, heat cream over medium high heat, stirring frequently, until it starts to boil. At this point, the cream will want to boil over, so keep an eye on it! Immediately remove from heat and pour over chopped chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir until chocolate is completely melted and mixture is smooth. Cool completely and then store in refrigerator. Ganache can be reheated in a stainless steel bowl over hot, but not boiling, water.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CCACHEF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8533333333333335,
            "ratingCount": 75,
            "itemReviewed": "Ganache I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "300.9 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "42.3 mg",
            "fatContent": "23 g",
            "fiberContent": "2.7 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "14.2 g",
            "servingSize": null,
            "sodiumContent": "13.1 mg",
            "sugarContent": "16.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-26T17:30:38.22Z",
                "reviewBody": "Ganache recipes can vary greatly in chocolate to cream ratios - this version falls somewhere in the middle and is great! To simplify the process, I chop the chips in my food processor until they resemble fine crumbs. Then I heat the cream in a heavy bottomed saucepan until it just starts to bubble around the edges, pour the hot cream down the feed tube of the food processor, and give it a whirl... in seconds you have wonderful ganache. I should mention that chocolate chips contain stabilizers that allow the chips to keep their shape while warm, and those stabilizers don't melt down smoothly like chocolate does, so for a smoother finished product, I strain the warm ganache through a fine mesh strainer (this is not a necessary step, but will give more professional results). Use this ganache warm as a pourable glaze, let it cool to room temp (over night) and use like a standard frosting, or chill until firm and whip with a heavy stand mixer until it's lighter in color and spreadable. You can even use this ganache to make authentic chocolate truffles - just roll the chilled ganache (unwhipped) into balls and coat with cocoa powder, chopped nuts, or whatever. One more helpful hint: if you use this ganache to \"frost\" a cake, make sure the cake is brought to room temp before you try to cut it (using a hot knife). For added depth of flavor, try adding some liquor, vanilla, brewed coffee, or even coffee powder into the warm ganache mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRINCIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/885183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-20T01:40:29.967Z",
                "reviewBody": "Good stuff.  I was looking for a chocolate filling to use in a layer cake and appreciated the tip that you could whip ganache to transform it into filling.  I found the ratio of chocolate to cream to be a bit high for a cake filling, so I added extra cream to yield a creamier texture.  The result was a truffle-like filling.  Delish!  It's been said before, but do buy the best bittersweet chocolate you can.  I used standard bittersweet baking squares and found I had to add a few tablespoons of powdered sugar to cut down on the bitterness.   This basic recipe lends itself to personalization, whereby you could play with different flavored extracts to customize a flavor.  But it's great as is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGIRLLJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T17:32:34.04Z",
                "reviewBody": "awesome. i love this so easy but tastes amazing. however it doesnt really like to be refrigerated and re-incarnated in a double boiler. Iwould make when you want to use it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURAEBK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:54:12.333Z",
                "reviewBody": "This is the only recipe you need for ganache.  I have also decreased the amount of chocolate to 6oz to drizzle it over a bundt cake.  If you don't have bittersweet chocolate, chips work well too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-08T14:53:08.84Z",
                "reviewBody": "Wounderful after I removed it from the heat I added 2T corn syrup for a nice shine on my Black magic cake.My buddy told me it shined like his new Harley.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BIGJIM5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1309461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-28T21:19:33.967Z",
                "reviewBody": "This is the recipe I use for all my ganache needs. Like the author says it's very versatile. By changing the temperature (melting or cooling ) you can change the consistency of the ganache. I have mixed it with whipped cream for a quick mousse used it to mask and glaze a cake and even piped roses with it! If you use the best quality chocolate it will make any event special.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shaggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/71/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T17:52:32.107Z",
                "reviewBody": "This is a very simple recipe, but yields an incredibly delicious topping with many uses.  I made chocolate sheetcakes for our daughter's wedding, and used this as the frosting (no boring white cake for her!).  It was delicious and elegant. Be aware that ganache is meant to be less sweet than regular frosting; using milk chocolate does not result in a true ganache flavor. This is a recipe for true lovers of dark chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPOOFHOUNDMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/825593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T03:17:03.883Z",
                "reviewBody": "First time I've made ganache and it was perfect. I used semisweet instead of bittersweet chocolate simmered the (whipping) cream just a little longer (1 minute with only tiny bubbles staying around the edges and watched like a hawk) poured over the chocolate and let it sit about 5 minutes then slowly stirred until blended to avoid bubbles. This can take a while. It was pouring consistency after about 15 minutes and held its shape well over the Double Chocolate Brownie bundt cake from this site. Beautiful sheen tastes like hot fudge in fact we reheated the leftovers in a microwave (carefully) and poured some over vanilla ice cream. The recipe makes quite a bit I had at least 1-1/2 cups leftover. Solidified like fudge in the fridge. Will try it with white chocolate next time. Now in my recipe box!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAS13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1304373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-15T16:56:04.483Z",
                "reviewBody": "Great glaze. I put in a dollop of corn syrup to make it shiny. It gets hard in the fridge, so don't refrigerate if you are using it the same day. Tasty on ice cream too...REAL tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BILLY B HILLBILLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/323667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-03T15:33:53.25Z",
                "reviewBody": "don't use chips and then try to make truffles with this recipe- didn't set- ever. My own mistake- didn't know chips have something in them to keep their shape- obviously that means it won't set. I'll try this again with ghiradelli squares instead of chips.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "STAMPIN426",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/843856/"
                }
            }
        ]
    }
]