[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15760/carrot-cake/",
        "name": "Carrot Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6821752.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1999-12-23T17:36:14.000Z",
        "description": "Here's an old-fashioned carrot cake that's got more carrots than spice. Pecans can be substituted for walnuts.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "15 to 18 servings",
        "recipeIngredient": [
            "2 cups white sugar",
            "¾ cup vegetable oil",
            "3 eggs",
            "1 teaspoon vanilla extract",
            "¾ cup buttermilk",
            "2 cups grated carrots",
            "1 cup flaked coconut",
            "1 (15 ounce) can crushed pineapple, drained",
            "2 cups all-purpose flour",
            "2 teaspoons baking soda",
            "2 teaspoons ground cinnamon",
            "1 ½ teaspoons salt",
            "1 cup chopped walnuts",
            "½ cup butter",
            "1 (8 ounce) package cream cheese",
            "1 teaspoon vanilla extract",
            "4 cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together sugar, oil, eggs, vanilla, and buttermilk.  Stir in carrots, coconut, vanilla, and pineapple. In a separate bowl, combine flour, baking soda, cinnamon, and salt; gently stir into carrot mixture.  Stir in chopped nuts. Spread batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 55 minutes or until toothpick inserted into cake comes out clean.  Remove from oven, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium mixing bowl, combine butter or margarine, cream cheese, vanilla, and confectioners sugar. Blend until creamy. Frost cake while still in the pan.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marc Boyer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7936117936117935,
            "ratingCount": 814,
            "itemReviewed": "Carrot Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "615.5 calories",
            "carbohydrateContent": "83.5 g",
            "cholesterolContent": "70.4 mg",
            "fatContent": "30.2 g",
            "fiberContent": "2.3 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "10.8 g",
            "servingSize": null,
            "sodiumContent": "540.4 mg",
            "sugarContent": "67 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-14T14:11:34.467Z",
                "reviewBody": "First, I gave this recipe only four stars simply because, while it turned out wonderfully and everyone loved it (Did a dry run cake by recipe exactly and it was gone in 50 minutes at work), but it did not have the exact flavor I was looking for.  With that said, this is a great recipe.  It was literally my first attempt at baking from scratch and with a few adjustments, I have truly found my carrot cake for life!!  Adjustments I made include:  no coconut (hate'em), 8oz can of pineapple with juice, whole wheat flour instead of white, replace one cup of white sugar with light brown and additional 1/4 teaspoon of vanilla (be sure to use pure vanilla extract, not imitation), add 1 teaspoon of allspice, 1/3 cup of oil and 1/2 cup of sour cream, 2/3-3/4 cup of raisins, and finally, I lightly sauteed my shredded carrots in a bit of unsalted butter, 1/4 cup sugar and sprinkle of cinnamon and set it aside.  I use this with the Cream Cheese II icing on this board (less the unsalted butter used to sautee the carrots).  Several people stated it was the best carrot cake they have ever tasted.  But, more importantly, it had the full combination of flavors I was looking for, nothing overpowered and it had a full, warm taste.  It was a cake I would eat or serve without the icing, but the icing is a perfectly compliment.  Because it suited my particular tastes, I'd give my recipe five stars, but I wouldn't have found mine without yours.  My sincere thanks to you.  Who knew I could bake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DivaJojo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2026104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T00:46:08.263Z",
                "reviewBody": "Oh, how I wish there was an option of 10 stars! This recipe is awesome! It is extremely easy as well. I made one late the other night and the next day while I was at work my mom had the first piece. She called me up and said, \"Angela, don't ever make this again!...I can't stop eating it. This is the best carrot cake I've ever had.\". And believe me, if anybody knows carrot cake, its my mom, its her favorite. Then, I made another for work, and one guy just raved about it. I can't tell you how many compliments this cake gets. And its sooo easy. The batter is ready in 10 minutes (15 if you grate the carrots by hand). Cooking time was right on. It even came out well in one of those cheap alluminun pans you get for like $1.50 at the grocery store. The only thing I changed was I used a 20 ounce can of pineapple in its own juice(although I didn't realize until after the fact, it came out so well, I will continue to use this size). Also, the frosting was delicious, but I used one batch of frosting for both cakes, so if you only make one, start with half the recipe for frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AngelaM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/605060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-12T12:46:20.85Z",
                "reviewBody": "I have made this recipe more than a few times and it has turned out consistenty and reliably well each time.  Not too sweet, too dense, oily or spicy as some carrot cakes can be.  The frosting is a tried and true basic cream cheese frosting.  Easy to mix and fool proof, this could easily be your go-to carrot cake recipe.  I baked this as cupcakes - 1/2 recipe yields 12 cupcakes, 350 degrees, 25 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T01:16:23.84Z",
                "reviewBody": "This carrot cake is the best in the whole world. The cake is especially moist, and the frosting is very creamy and sweet. I think if you're looking for a delicous carrot cake, i think you've found it! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "whitestar316",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-30T01:59:04.297Z",
                "reviewBody": "Amazingly simple and so delicious.  I've made it twice for two different groups and it's a crowd pleaser.  Nothing left but crumbs.  I'm not a coconut fan, so I skipped the coconut and used 3 cups of carrots instead of 2, but all else I followed to the letter.  This one's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baked Alaska",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2138405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-28T22:52:14.157Z",
                "reviewBody": "My fiance LOVES carrot cake, and yesterday was his birthday so I decided to look for a carrot cake recipe.  He was very specific that he wanted pineapple, coconut and lots of nuts in his carrot cake.  I made this cake with a few modifications and he LOVES it!  Says that it rivals his favorite carrot cake recipe.  And he took some to work today and got rave reviews as well!  Here are the modifications I made:  I used 1 cup white sugar and 1 cup brown sugar, I only used 1/2 cup of canola oil, I used 1 cup regular flour and 1 cup whole wheat flour, I used 3/4 cup chopped walnuts AND 3/4 cup chopped pecans, and I added several teaspoons (six or so?) of pineapple juice (from the crushed pineapple) to the frosting.  I'm sure this will get made again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "irisw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4989534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:42:27.037Z",
                "reviewBody": "This cake came out especially moist and delicious. It was a hit however the cake is very busy and it has nuts and chews in every bite! If you want a mellow carrot cake please do not try this recipe..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FORTT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-08T17:50:03.863Z",
                "reviewBody": "I wish I could give this more stars! This was the BEST carrot cake I've ever made! Came out so moist and with perfect flavor. I did leave out the coconut because my kids won't eat it, and I used a 20 ounce can of pineapple because I wasn't paying attention. I liked it so much, I'll keep those changes. Also, I made it as a layer cake with 2 8inch pans, and I've never had a cake come out so perfectly even. Try it with this icing instead: 2 blocks cream cheese (8 oz each, has to be regular because low fat itsn't stiff enough), 1/2 cup butter softened (beat with cream cheese until smooth), 2 cups powdered sugar (add gradually), 1 teaspoon vanilla, amaretto to taste. PERFECTION!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Sutton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3189388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-21T22:20:01.593Z",
                "reviewBody": "Delicious!  And easy!  This cake is extra moist.  I was surprised by how easy it was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENAKOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/777701/"
                }
            }
        ]
    }
]