[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/995/meat-and-poultry/pork/ribs/spare-ribs/",
                    "name": "Spare Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16913/texas-pork-ribs/",
        "name": "Texas Pork Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F43072.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1999-12-23T18:45:14.000Z",
        "description": "This is a multiple prize-winning master recipe. It has several steps that can be used on pork spareribs, country-style ribs, or pretty much any other type of pork rib; simply adjust oven time up for meatier cuts. Use some soaked wood chips on the barbecue. The smokier the grill, the better the ribs will taste!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT13H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "6 pounds pork spareribs",
            "1 ½ cups white sugar",
            "¼ cup salt",
            "2 ½ tablespoons ground black pepper",
            "3 tablespoons sweet paprika",
            "1 teaspoon cayenne pepper, or to taste",
            "2 tablespoons garlic powder",
            "5 tablespoons pan drippings",
            "½ cup chopped onion",
            "4 cups ketchup",
            "3 cups hot water",
            "4 tablespoons brown sugar",
            "cayenne pepper to taste",
            "salt and pepper to taste",
            "1 cup wood chips, soaked"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Clean the ribs, and trim away any excess fat. In a medium bowl, stir together the sugar, 1/4 cup salt, ground black pepper, paprika, 1 teaspoon cayenne pepper, and garlic powder. Coat ribs liberally with spice mix. Place the ribs in two 10x15 inch roasting pans, piling two racks of ribs per pan. Cover, and refrigerate for at least 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C). Bake uncovered for 3 to 4 hours, or until the ribs are tender and nearly fall apart.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove 5 tablespoons of drippings from the bottom of the roasting pans, and place in a skillet over medium heat. Cook onion in pan drippings until lightly browned and tender. Stir in ketchup, and heat for 3 to 4 more minutes, stirring constantly. Next, mix in water and brown sugar, and season to taste with cayenne pepper, salt, and pepper.  Reduce heat to low, cover, and simmer for 1 hour, adding water as necessary to achieve desired thickness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat grill for medium-low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When ready to grill, add soaked wood chips to the coals or to the smoker box of a gas grill. Lightly oil grill grate. Place ribs on the grill two racks at a time so they are not crowded. Cook for 20 minutes, turning occasionally. Baste ribs with sauce during the last 10 minutes of grilling, so the sauce does not burn.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Spare Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura Walton"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6752136752136755,
            "ratingCount": 351,
            "itemReviewed": "Texas Pork Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "614.5 calories",
            "carbohydrateContent": "53.1 g",
            "cholesterolContent": "126.8 mg",
            "fatContent": "30.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "33.4 g",
            "saturatedFatContent": "11.2 g",
            "servingSize": null,
            "sodiumContent": "990.9 mg",
            "sugarContent": "48.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-06-03T23:48:24.53Z",
                "reviewBody": "This recipe was to die for.  Everyone that ate it was raving about it.  For all you crock pot fanatics...I made this in the crock pot.  I prepared the dry rub as instructed and left in the fridge over night.  The next morning, I loaded all of the ribs into a big crock pot.  Then I prepared the BBQ sauce cold (no stove or oven work) and just poured it over the ribs.  Cooked in the crock pot on low for 10 hours.  They were incredible!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Niki Mouton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T18:40:07.487Z",
                "reviewBody": "These ribs are amazing.  Being a true Texas boy, I love all things BBQ, all things pork, and all things spicy.  With this recipe, though, you need to customize the amount of cayenne for your audience.  I'm one to increase the amount of cayenne in any recipe, but in this one it was just right for me--which means that it would be too hot for some people.  There is too much sugar in the recipe unless you are cooking at least 3 racks of ribs--I would reduce it by half if cooking 1 or 2 racks.  Finally, there is no need to make the BBQ sauce.  The ribs are so flavorful that any BBQ sauce will be in the background.  I used a store brand sauce, and it was just fine.  The recipe is definitely one to try.  If you need more cayenne, then add it at the end.  UPDATE:  I finally decided to try the BBQ sauce in this recipe and wish I hadn't.  Even a generic store brand of sauce would be better than this sauce.  Don't waste your time on it.  Oh, and it makes enough for about 10 racks of ribs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sdallenhou@aol.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1091057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T10:41:52.7Z",
                "reviewBody": "These were great, even though we didn't throw them on the grill due to rain. In the rub I used kosher salt and cut the black pepper to 1 1/2 Tablespoons.  I used 1/2 teaspoon ground chipotle pepper in place of cayenne (LOVE the smoky flavor of chipotle peppers).  I would probably up the chipotle peppers if not cooking for children.  I used 1 1/4 tsp. ground chipotle pepper in the sauce.  My spareribs were St. Louis cut, which are just regular ribs with the breastbone and the adjacent strip of gnarled meat removed.  I think the ribs cook more evenly and are definitely easier to cut when done.  Mine were moist and tender after about 3 hours and I fear they might have dried out after any longer.  The best way I have found to test ribs for doneness is to pick up the center of the ribs  with tongs.  The ribs shoud flop down and a skewer inserted inserted between the ribs should meet little resistance (thank you chef Steve Johnson and Fine Cooking magazine).  My husband and daughter liked these better than ribs I have slaved over over.  This is an excellent, easy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-31T05:31:43.03Z",
                "reviewBody": "Great versatile recipe! My husband used to work at a rib joint and is very choosy about his ribs - he said these were among the best - and to top it off it was my first attempt at BBQ ribs! I've used this recipe several times now and I love being able to tweak the rub ingredients (less pepper more cayenne etc.) depending on who's going to be eating them. UPDATE: THis rub also makes for a killer pork roast and roasted chicken! I use this rub so often now I make a monster batch of rub about once a month and keep it in a huge canister on my kitchen counter so a couple scoops are always handy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARTHINA_EARLINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/824958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T15:33:06.31Z",
                "reviewBody": "Wow! Really good! I am only rating the dry rub as I didn't bother with the sauce - the ribs were so moist and sticky that I didn't feel I needed it. I followed the recipe but only used 1/2 of the cayenne. It had a bite but wasn't really hot so I'll probably use more next time. Also, I used 1 cup white sugar and 1/2 cup brown. Then I wrapped packages of 4-5 ribs in foil pouches and baked them all at about 250 for 3 1/2 hours. I unwrapped them and placed them on a rack (over a pan) in the same oven for about 30 minutes, to dry out a bit. So excellent and gooey! One big suggestion - this recipe makes ALOT! I cooked 8lbs of ribs, both pork and beef, and had fully 1/2 of the rub mix left. So I saved it in a ziplock and have used it twice more, on some boneless pork ribs, and spareribs. It'd be ashame to waste this rub so either make a smaller amount, or be prepared to store it for further use, (sprinkle it on - don't contaminate it with meat juices). This will be my dry rub from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/349119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-07T23:45:57.497Z",
                "reviewBody": "I am a BBQ rib fanatic and have tried many recipes to grill my ribs and was looking for one filled with flavor that could be served spicy or mild and would fall off the bone after grilling....WOW did I ever find one...Everyone that tries \"my\" new rib recipe says its the best ever and I totally agree...This is one fabulous yet simple recipe...ENJOY!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1662347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-28T20:42:50.21Z",
                "reviewBody": "my husband usually makes the ribs but of course i had to try to get one up on him hehe...as alot of other reviewers i did not bother with the grill or the sauce. (we keep my husbands homemade sauce on hand)WOW this rub is what makes the ribs people!!! i have used it on chicken breasts(bone-in )and tonight on pork chops in the oven because i was just too tired to use my original chop recipe and didnt feel like going to the store for a couple things. this rub will be a staple in our house from now on. thanks for a wonderful recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RBROWN998",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/765744/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T10:41:56.187Z",
                "reviewBody": "Really simple rub... best one I have had. Didn't try the bbq sauce used bottled one but turned out great. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIA U",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:32:19.247Z",
                "reviewBody": "My mom and I invited my fiances family over for the first time (for my fiances b-day party) and we were nervous about the food. We used this recipe because it had so many great reviews. We put the rub on a day in advance and used masterpiece HOT AND SPICY BBQ sauce. We doubled the recipe and put 1/4 teaspoon canyanne pepper and 1 teasppon chili powder. The ribs were a hit they were so tender they were falling off the bone. Sweet and spicy just delicious. Christopher's mom and grandma said that it was the best ribs they ever had in thier life. Thank you for the wonderful rib recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUTROSE22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-04T07:30:35.353Z",
                "reviewBody": "Okay this recipe is waaaay too spicy. I am a big spicy person too. It takes away the flavor from the pork and over powers it with sauce. Additionally it is too sweet and too salty. This would make a good beef jerky rub sauce but not for pork ribs. The sauce is good though. The rub is not. I will not be making this again. I suggest soaking the ribs in beer (Guinness). My girlfriend (super hot) likes these ribs though. She also is very nice and sweet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "samchoy808",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7794044/"
                }
            }
        ]
    }
]