[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/840/desserts/cookies/chocolate-cookies/",
                    "name": "Chocolate Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10642/caramel-filled-chocolate-cookies/",
        "name": "Caramel Filled Chocolate Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4534510.jpg",
            "width": 4052,
            "height": 3298
        },
        "datePublished": "1998-03-08T14:48:17.000Z",
        "description": "Chocolate cookie dough is wrapped  around caramel filled chocolate candies. We have these at Christmas time each year.  They are delicious!  Hope you enjoy them too.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 cup white sugar",
            "1 cup packed brown sugar",
            "2 eggs",
            "2 teaspoons vanilla extract",
            "2 ¼ cups all-purpose flour",
            "1 teaspoon baking soda",
            "¾ cup unsweetened cocoa powder",
            "1 cup chopped walnuts",
            "1 tablespoon white sugar",
            "48 chocolate-covered caramel candies"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat butter until creamy. Gradually beat in white sugar and brown sugar. Beat in eggs and vanilla. Combine flour, baking soda, and cocoa.  Gradually add to butter mixture, beating well.  Stir in 1/2 cup walnuts. Cover and chill at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine remaining 1/2 cup nuts with the 1 tablespoon sugar.  Divide the dough into 4 parts.  Work with one part at a time, leaving the remainder in the refrigerator until needed. Divide each part into 12 pieces. Quickly press each piece of dough around a chocolate covered caramel. Roll into a ball. Dip the tops into the sugar mixture. Place sugar side up, 2 inches apart on greased baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 minutes in the preheated oven. Let cool for 3 to 4 minutes on the baking sheets before removing to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Chocolate Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.64519906323185,
            "ratingCount": 854,
            "itemReviewed": "Caramel Filled Chocolate Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "253 calories",
            "carbohydrateContent": "33.1 g",
            "cholesterolContent": "36.6 mg",
            "fatContent": "13 g",
            "fiberContent": "1.6 g",
            "proteinContent": "3.4 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "127.5 mg",
            "sugarContent": "21.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-04-05T01:26:10.437Z",
                "reviewBody": "These cookies were a big hit at my Cookie Exchange party.  I used Rolos, and I did notice that the cookies were much better warm than when they had cooled...  Rolo caramel is a little hard and chewy, and I imagined cookies with gooey, runny caramel in the middle, not stiff taffy-like caramel.  I have a friend who made a batch of these using 4 different things:  Hershey's Treasures (caramel, of course), plain caramels, mini Reese's Peanut Butter Cups, and Milk Duds.  She said that they were all fantastic, so I would suggest experimenting until you find the candies that are most appealing to you!  I also wanted to mention that I made the first half of the cookies without refrigerating the dough at all, and then I made the second half after the dough had been refrigerated for several hours, and I have to say that the room temp dough was much easier for me to handle.  It was very pliable, while the refrigerated dough was crumbly and hard to work with!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "allison125",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/351270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T18:06:47.973Z",
                "reviewBody": "I decided to make these last night for a family reunion coming up-I read ALL 130 reviews before starting and was prepared to do battle with sticky dough and a time consuming process.  Well, I had ZERO problems making these cookies.  I did a couple things different from the recipe.  #1  Add 1/2 tsp salt.  Those who stated the cookies are somewhat bland without the caramel, it is because there is no salt in the dough.  #2.  Add 1/4 -1/2 cup more cocoa-they are delicious with this, and it makes the dough less sticky.  #3 PARCHMENT PAPER!  Use it on the cookie sheets-even the cookies which \"exploded\" were fully contained on the paper.  I cooked the cookies for 10 minutes-mine hardly spread at all.  Then cooled for 5-10 minutes on the tray and slipped them right off onto cooling racks.  Not one single cookie leaked through the cooling rack.  Also, my dough sat out at room temp the whole time-I put it in the freezer for 15 minutes while I unwrapped the candies (which by the way, I used Riesens-much better than Rolos) - I baked them on and off for 4 hours and I did not need to chill the dough.  I made a DOUBLE batch of these-I think they awesome and very easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTINR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/408025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T00:55:58.147Z",
                "reviewBody": "This is an EXCELLENT cookie! They turned out wonderful!!! I read all of the advise of the other reviewers. I added an extra 1/4 c. flour and 1/3 c. cocoa and added 1/2 t. salt and left out the nuts in the dough. I used parchment paper and let the cookies cool on the sheet. I chilled the dough for about a half hour before starting. I had no problems with the dough being sticky I found it easier to work with as it warmed up a little. I formed the dough into little bowl shapes in my hand and put the candy in the middle working the dough around it getting rid of any excess. I used as little dough as possible and got close to 80 cookies out of this recipe! No problem with leaking just work the dough around the candy really well. I used rolos and 1/2 peanut butter cup and they are both wonderful. I baked for 7 minutes and they are still soft. This is a time consuming cookie but well worth it! HIGHLY RECOMMENDED!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahkhas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-14T15:11:59.95Z",
                "reviewBody": "Part drop cookie part chewy brownie 100% fabulous!! Could not find Rolos at my grocery store so used the caramel-filled Hershey's kisses with great results. For those who find the dough too sticky and difficult to work with keep a small dish of water close by your work area and dip the tips of your fingers in the water shaking off excess before molding the dough around the candy piece. The dough won't cling to your fingers then and it makes refrigerating unnecessary. Be sure not to overbake and make sure you calibrate your oven because unless the temperature is accurate you won't get the endorphin-inducing chewy chocolate fix you crave. I skipped the nut/sugar dip because I wanted to finish them another way. Although it was unnecessary for texture or flavor I frosted them for looks making these \"Triple Threat Fudge Cookies\" as I billed them. Nice frosting that sets up unsticky in about 2 hours: Mix together 3 Tb soft butter 3 Tb unsweetened cocoa powder (I used Hershey's) a pinch of soda 1 tsp vanilla 1 Tb light corn syrup and 1 cup powdered sugar. Added in tsp by tsp enough milk to make it spreadable. Frost cookies while still a little warm (about 8-10 minutes after removing from oven.) I got rave reviews all around with one fan giving them a \"10 on the swoon meter.\" Thank you for the phenomenal recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T16:57:22.623Z",
                "reviewBody": "These cookies were a hit with everyone who tried them. I used Caramellow bars for my chocolate caramel in the center. It was perfect. I bought 3 large bars each bar gives you 18 squares. They were the perfect size for wrapping the dough around. The caramel is very gooey and the cookies were scrumptious and very rich. YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOM23BOYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/189978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-21T18:21:01.813Z",
                "reviewBody": "Update 12/2005-I made these again this year and the first batch used 1/2 butter & 1/2 butter flavored Crisco. Forgot to do so for 2nd batch - the 1/2 and 1/2 works MUCH better & holds shape! Also used the Hershey Caramel Kisses this year & they were great too! Killer cookies! Although I meant to add the extra flour/cocoa - I forgot....I did use 1/2C butter crisco & 1/2C butter. Also used the Milky Way caramels because I couldn't fathom opening all those Rolo candies--Milky Way carmels are fast to open. I split the dough into 4ths put 3 in fridge and immediately used 4th - no problem with stickiness (maybe it was the Crisco?). I found it best to cover the carmel starting at the bottom of candy and press up towards top. Not a single one leaked. These cookies will go on the \"make for cookie tray gifts\" list!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue Farnsworth Sattel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sfarns303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-11T02:36:03.13Z",
                "reviewBody": "excellent cookie! I used rolos and put the candies in the freezer for a couple of hours. The caramel didn't ooze out while baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "newhope",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2154206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-15T05:47:14.483Z",
                "reviewBody": "These were a hit at my family reunion. They taste a bit like a turtle brownie. I tried both Rolo's and Hershey's Caramel's with a chocolate center...sorry I can't recall the exact name. I preferred the Hershey's. Rolo's didn't hold up as well as the Hershey's did. I also drizzled the cookies with melted milk chocolate after they cooled a bit. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAWNTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/128286/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-23T04:07:35.28Z",
                "reviewBody": "My sister and I really liked these cookies. My husband thought they were just average. Unlike other users I did not think they were that difficult to make. It is alot easier if you coat your hands in cocoa before working with the dough. I tried Rolos Snickers and Reese's Peanut Butter cups and thought the peanut butter cups tasted the best... but they were all good. I will definitely make these cookies again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SABROSAHINDLEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T18:46:52.52Z",
                "reviewBody": "Used Rolos. Good but not great. Probably will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2478636/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Caramel Filled Chocolate Cookies ",
            "description": "What’s better than a cookie? A cookie with caramel on the inside! ",
            "uploadDate": "2018-12-19T18:16:18.598Z",
            "duration": "PT56.235S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd0fe2be4-3b8a-4b85-90fb-fe687d27f5b3%2F9ca1c5b5-9c34-423e-8f57-1c0ae9cc39cb%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5981604489001"
        }
    }
]