[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13387/main-dish/pork/pork-chops/baked/",
                    "name": "Baked",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16348/baked-pork-chops-i/",
        "name": "Baked Pork Chops I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F19%2F16348-baked-pork-chops-1-MFS-245-2x1-1-2000.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "1999-12-28T05:56:57.000Z",
        "description": "A pork chop recipe that is quick and easy. You may have all the ingredients already in the house. Try serving over rice.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 pork chops",
            "1 teaspoon garlic powder",
            "1 teaspoon seasoning salt",
            "2 egg, beaten",
            "¼ cup all-purpose flour",
            "2 cups Italian-style seasoned bread crumbs",
            "4 tablespoons olive oil",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "½ cup milk",
            "⅓ cup white wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste. Place the beaten eggs in a small bowl. Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a medium skillet over medium-high heat. Fry the pork chops 5 minutes per side, or until the breading appears well browned. Transfer the chops to a 9x13 inch baking dish, and cover with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 1 hour. While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl. After the pork chops have baked for an hour, cover them with the soup mixture. Replace foil, and bake for another 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Baked"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "bdld"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.552982794661522,
            "ratingCount": 6219,
            "itemReviewed": "Baked Pork Chops I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "457.4 calories",
            "carbohydrateContent": "36 g",
            "cholesterolContent": "128.5 mg",
            "fatContent": "19.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "29.9 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "1142.4 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:36:43.577Z",
                "reviewBody": "I took some advice from pervious reviewers and made sure that I fried the chops until the outside was very crispy (make sure the oil is hot before adding the chops, makes a difference in how tender they turn out).  I also doubled the gravy, and used 1 can cream of mushroom and 1 can golden mushroom.  That really helped keep the dish from having that \"some kind of meat covered w/cream of mushroom soup\" taste.  I also sauteed some fresh mushrooms in the pan I'd cooked the pork in and added them to the soup mixture.  I added some extra garlic and just a couple dashes of cayenne.  I cooked the chops for 20/20.....needed less cooking time I think cause I'd browned them so well.  Turned out wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLY9000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:37:54.35Z",
                "reviewBody": "I intended to submit this review two weeks ago & since then, my husband has requested this dish three more times.  I did change a couple things.  I baked for 35 minutes and warmed the sauce in a pot on the stove rather than pouring it over the chops.  I also used cream of chicken rather than mushroom, since we're not mushroom fans and doubled the milk rather than using wine.  It turned out fabulous.  THANKS so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GENEVAJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/138438/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:36:34.483Z",
                "reviewBody": "This smells great after you take it out of the oven, and the preperation wasn't as long as I thought it would be.  I did not bake them for as long as the recipie called b/c I ran out of time.  They were done after 35 min and everything tatsted great, very tender and juicy.  The sauce textrue was \"just right\", not too watery and not too chunky.  One suggestion I have is to make double the sauce if you like to dip the meat because you'll wish you had more after you try it.  I substituted the white wine with Vermouth, and next time I am thinking of adding more of the Vermouth or white wine and taking away some of the milk.  This I think will strenghthen the taste of the sauce to be even better as the wine/Vermouth seems to play a big part in the taste of the whole meal.  A note of caution: be careful not to burn the pork chops when frying, keep the heat at med/high and check often, I \"saved\" them just in time :).  A+",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRINCESS20NY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:38:24.927Z",
                "reviewBody": "Excellent recipe!  Past reviewers that complain the dish is soggy possibly don't understand that the breading is INTENDED to soften up.  I think the breading is just for a little color and flavor.  It was not intended to stay crunchy while being baked in a lot of sauce.  Anyway, I served this with mashed potatoes and asparagus and it was delightful.  Only things I would clarify are that I used Lawry's brand seasoning salt, Chardonnay for the wine, and I only used 4 pork chops with the same amount of gravy in the recipe.  The perfect amount was left to drizzle over the potatoes.  Maybe a little more wine could be added next time.  Thanks again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GDOBRUSKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/344801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-04T16:09:49.09Z",
                "reviewBody": "Breaded pork chops are always a hit with my husband and I've been making pork chops like this for years. I always use Italian style bread crumbs and just eyeball extra seasonings to add like garlic powder, cracked black pepper, dried parsley, Italian seasoning and some grated Parmesan cheese. I always dip my pork chops into the egg/milk mixture then the seasoned bread crumbs and then repeat that procedure (double dipping). This gives the pork a thick breading and keeps it moist while baking. To cut calories and time I spray the bottom of a glass baking dish with Pam, place the breaded pork in (no frying needed) then spray the pork with a little Pam, cook at 350 for 20 minutes, turn and cook for another 25 minutes. They'll come out moist and tender. This recipe has the pork cooking for way too long - it'll dry right out! And, there's nothing worse than dried out pork. I tried the soup mixture over top and well, it was OK.  I poured it over half the chops during the last 15 minutes of cooking.  I think I'll stick to the breaded pork chops without the soup mixture.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-22T15:30:37.577Z",
                "reviewBody": "Man......THESE PORK CHOPS ARE SLAMMING!!!  I can't even describe how friggin good and tender they were!!!  I followed the recipe, but I did make a few changes........of course.  I followed some others' advice and added golden mushroom with the cream of mushroom.  That, along with the white wine, is the key to this wonderful tasting dish.  I also added some sauteed mushrooms and green onions to the sauce right before I poured it on the chops.  Make sure you use a non-stick cooking spray on the bottom of the pan before you start baking so the coat on the pork chops doesn't stick.  I served this along with the Angel Chicken Pasta recipe I found on here.  It was a very rich meal, but worth every calorie we digested.  Put it like this........I have a cousin who can not stand ANY VEGETABLE KNOWN TO MAN.  You know what...........he had three servings the first night. That was one of the best compliments I could've gotten.  Thank you Dawn for this better than OUTSTANDING RECIPE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bayou Gator",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/753209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T17:47:24.52Z",
                "reviewBody": "I love these folks who alter a recipe and when it comes out a disaster blame the initial recipe! The problem... dear folks is not the recipe...it's YOUR changes. I have used this recipe \"as is\" on several occasions for 20-36 people and I can assure you...IT ROCKS1 Let's be fair...if you alter a recipe accept the results and admit YOU messed up!.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLUEBARRY1943",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1382112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T03:37:26.52Z",
                "reviewBody": "This was great! I too have a fear of making something that tastes like your greasy spoon tasteless meat & canned mushroom soup. So--using someone's idea of boneless chops, I doused the chops with bottled minced garlic, rubbed them with a bit of Kitchen Bouquet, used sour cream instead of milk, used Lindeman's Chardonnay(an inexpensive but but very good Australian wine, threw in about 1 or 2 T sweet Hungarian paprika, & a lot of fresh, sliced, sauteed mushrooms. Did all that make it any better than the original? Don't know, but I do know it got rave reviews. Thanks, Dawn--I've already done this 2x for company, & will do it again till I've run through my list of friends. Jean in Honolulu\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jean in Honolulu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/638287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-10T16:16:27.59Z",
                "reviewBody": "I normally don't care for pork chops, but decided to give this a try. It was excellent. I did change a few things though. I used 2 huge butterfly pork chops (instead of 6). I doubled the sauce-used 2 cans of cream of mushroom, 2/3rds cup of white wine (I used Chardonnay) and only used 3/4 cup of milk. I sauteed an onion in a tsp of oil first, then added the gravy mix. Heated that up and topped it over the chops. I also cut down the cooking time-45minutes/30minutes. Turned out increadibly tender. My husband had seconds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELLY BORK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:11:14.623Z",
                "reviewBody": "I was NOT impressed with this recipe.  The pork was tender but lacked a strong flavor.  The steps to prepare it left a lot of dirty dishes too.  The cooking time was as other reviewers mentioned off as well.  I did 30 min before adding the soup mixture and 30 after.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebslo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5686/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baked Pork Chops",
            "description": "See how to make quick-and-easy baked pork chops.",
            "uploadDate": "2012-12-11T23:35:06.491Z",
            "duration": "PT3M56.319S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0445d020-f362-42a6-9cd3-feae9b13b592%2F81ef6020-c914-40ea-9fb1-6a65c35f67ed%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2028936204001"
        }
    }
]