[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17131/houska/",
        "name": "Houska",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F170087.jpg",
            "width": 430,
            "height": 327
        },
        "datePublished": "1999-12-29T18:18:55.000Z",
        "description": "This decorative Bohemian sweet bread is a beautiful edible bread sculpture. It's not easy to make, but is sure to impress your guests! Try serving it warm for breakfast.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT5H0M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 cup milk",
            "¾ cup butter",
            "1 ½ (.25 ounce) packages active dry yeast",
            "¼ cup warm water (110 degrees F)",
            "2 eggs",
            "1 egg, separated",
            "6 cups bread flour",
            "¾ cup white sugar",
            "2 teaspoons lemon zest",
            "¼ teaspoon ground mace",
            "¼ teaspoon ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the milk in a small saucepan until it bubbles, then remove from heat. Stir in the butter until melted; let cool to lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small mixing bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. In another small bowl, combine 2 whole eggs with the egg yolk; beat lightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, mix together 4 cups flour, white sugar, salt, lemon zest, mace and nutmeg. Make a well in the center of this mixture and pour in the cooled milk, yeast mixture and beaten eggs. Beat well until a loose dough forms. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out onto a lightly floured surface. Gently knead the dough and gradually incorporate the remaining cup of flour. Continue kneading until the dough is smooth and elastic, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into 3 portions; 1 small, 1 medium and 1 large (or one the size of a tangerine, one the size of an orange and one the size of a grapefruit). Cut the largest piece of dough in half and roll it out into 2 long ropes about 30 inches long.  Twist the ropes together and place into a 8 inch diameter spiral and place it on a lightly greased cookie sheet.  Cut the medium size piece of dough in half and roll out into 2 ropes about 20 inches long each.  Twist the ropes together and place in a ring on top of the first circle of dough.  Roll the smallest piece of dough into a rope about 12 inches long.  Coil this rope on top of the other dough. The completed loaf should look like a pyramid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the uncovered loaf in an unheated oven to rise until doubled in size, about 2 hours.  Remove the loaf from oven and preheat to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly beat the reserved egg white and brush over the loaf.  Bake at 325 degrees F (165 degrees C) for 30 to 40 minutes or until lightly browned. If bread starts to brown too quickly, cover with aluminum foil and continue baking. Cool on wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 3,
            "itemReviewed": "Houska",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "257.2 calories",
            "carbohydrateContent": "38.2 g",
            "cholesterolContent": "47.2 mg",
            "fatContent": "8.6 g",
            "fiberContent": "1.1 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "65.7 mg",
            "sugarContent": "8.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-05T14:38:21.717Z",
                "reviewBody": "I was truly surprised to find this recipe anywhere Houska is something my grandma always used to make Your version is just as good and brings back memories",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GWLF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/57548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-01T17:34:33.923Z",
                "reviewBody": "I love houska! It's a family tradition on my dad's side. Our recipe from great-grandma is hard to decipher (not structured at all) so I am excited to try this. It seems lighter than ours in a good way--thanks for sharing! We always add golden raisins and almonds in the batter--maybe 1/4 c each per loaf to your taste. And we sprinkle almonds on the top. This is SO GOOD warm or toasted. Thank you! (Check out our family's Kolacki recipe--Czech cookies.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2899298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-15T10:21:51.417Z",
                "reviewBody": "This recipe is hard to rate since I'd give the final product 4 stars and the recipe itelf 2 stars. There are discrepancies between the ingredients list and the instructions (salt and the amount of flour). The dough proportions were much bigger than a grapefruit orange and tangerine and there was no mention of how big around the dough ropes were supposed to be (mine were about an inch to an inch and a half around which seemed too big). Then the shaping of the dough pyramid was very odd. I baked it on a baking stone. The finished product was a rather tasty slighty sweet breakfast type of bread that reminds me of the Italian pan d'oro eaten at Christmas. I had to cover the bread with foil about 20 minutes in to the baking time because it browned rather quickly. I also had to bake it for about 45-50 minutes to fully cook the middle. Not bad overall but needs more specific intructions regarding working with the dough and please fix the discrepancies regarding the flour and salt!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Cooper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2576054/"
                }
            }
        ]
    }
]