[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
                    "name": "Nut Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15535/martha-washington-candies/",
        "name": "Martha Washington Candies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2980124.jpg",
            "width": 1494,
            "height": 2656
        },
        "datePublished": "1999-12-29T19:27:42.000Z",
        "description": "Here is a candy that can be given as gifts during the holidays or just gobbled up whenever you have a hankering for it. They are a hand-dipped pecan candy in a fondant-like base.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 dozen",
        "recipeIngredient": [
            "1 cup margarine",
            "4 cups confectioners' sugar",
            "1 (14 ounce) can sweetened condensed milk",
            "2 cups shredded coconut",
            "2 cups chopped pecans",
            "2 teaspoons vanilla extract",
            "2 cups semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line 2 cookie sheets with wax paper. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix margarine, sugar and sweetened condensed milk in large mixing bowl.  Add coconut, pecans, and vanilla; mix well, using a sturdy large spoon.  Chill until firm enough to handle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form into small balls and place on prepared cookie sheets .  Chill until very firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt chocolate chips  in top pot of double boiler over simmering water.  Using a toothpick, dip balls into melted chocolate.  Let cool on wax paper.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Nut Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Willi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.160493827160494,
            "ratingCount": 81,
            "itemReviewed": "Martha Washington Candies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "179.9 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "2.8 mg",
            "fatContent": "10.6 g",
            "fiberContent": "1.2 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "63.1 mg",
            "sugarContent": "19.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-20T07:26:49.2Z",
                "reviewBody": "I have made this heavenly candy for YEARS and they turn out perfect everytime. My recipe calls for two boxes of confectioners sugar (instead of four cups)so maybe that is why mine never comes out \"soupy\" \"thin\" etc. Try it you'll love it. Note: I also use 1/4 pound of parafin melted in the chocolate which makes the coating perfect with a slight shine very pretty).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZ MC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T18:01:58.13Z",
                "reviewBody": "Doubling the confectioners sugar will make the candy easier to handle but DON'T DO IT! You want that creamy melt-in-your-mouth experience. Instead work with the candy. Freeze before handling drop in teaspoons on waxed paper and freeze AGAIN roll drops between hands and freeze AGAIN. Then dip. I do add one block of parafin to the semi-sweet chocolate chips for that glossy finish. Use one toothpick for dipping another for removing the candy and put a little piece of pecan over the hole (a hint for what's inside). I also toast my pecans before adding to recipe. I'm not very old but all my aunts that make candy say mine are the best they've ever had and beautiful too! It's worth every minute.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ajmatt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-19T00:49:10.66Z",
                "reviewBody": "When dipping this candy, remove the middle tines of a plastic fork and use it to dip.  Eliminates the famous \"hole\" in the top.  Works great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3394200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-02T10:09:10.95Z",
                "reviewBody": "Great candy! Everyone loves them and always asks for the recipe. Takes a little time to make but well worth it! These are the changes I made. Double the powdered sugar. Use a small spring release scoop sprayed with Pam. Freeze for several hours or overnight. Keep chocolate warm not hot. I use milk chocolate chips. Only work on dipping about 10 at a time. Once the chocolate is set remove the toothpick. I decorated the top of mine with drizzled almond bark(covers the toothpick hole) and they are beautiful each time. Thank You Willi for this wonderful addition to my Holiday candies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURACA1212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/805017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T07:25:08.403Z",
                "reviewBody": "Made these with a few changes.  Added an extra cup of powdered sugar, and they didn't turn out too wet.  Just right!  Didn't want to get my hands dirty or have the heat of my hands affect the butter and make it runny, so I used a melon baller and dropped them on the wax paper.  Turned out perfect little balls! Easy as pie! Quick too. Also dipped the first few of them completely in chocolate, but thought it was way too chocolaty...overpowering the rest of the candy.  So, the remainder, about 80% of them only got the bottom half dipped in chocolate, then I drizzles a small amount on the top of the candies for decoration.  Looked very pretty.  I didn't think they took quite as long to make as everyone else did. Thank you for sharing this recipe with us Willi.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARLA CLANCY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/552930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-24T19:41:43.173Z",
                "reviewBody": "I've been making this candy with my Mom since I was a little girl. It's a wonderful recipe. We do it a little different. We make the dough leaving out the nuts and coconut and divide the dough evenly 3 ways. We mix one with pecans and coconut one with Maraschino Cherries (if you like chocolate covered cherries you'll love this) and the 3rd with peanut butter. The one with nuts you follow the recipe listed exactly the one with cherries you will need to drain the cherries and chop them into tiny pieces (it's also helpful to pat them dry with a towel) then mix in with dough.The cherry mixture will be softer and more sticky so it requires powdered sugar until you can roll it into bite size balls without the dough sticking to your hand then follow the recipe as listed. The peanut butter ones I add about 1 cup of peanut butter (sometimes more I really like peanut butter) and mix until well blended with the dough. If the peanut butter dough gets too dry you can add a little (very little) milk and that will help bring the creaminess back. Happy Candy Making!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1943571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-25T00:53:14.173Z",
                "reviewBody": "This recipe is very easy to make but I would cut down the margarine to 1/2 cup. I have added cinnamon to the mix and it has been great. I am thinking of varying the recipe in several ways. First I will change the butter to cream cheese the next time to make the mix firmer and reduce condensed milk to half. I will also consider different types of nuts and dried fruit flavorings some orange peel and spices. Another idea that comes to mind is omit the coconut and to add two or three melted unsweetened chocolate squares (cooled down) to the mix and then use white chocolate chips for the coating instead. Then maybe I would drizzle them with melted caramel once it is set. The second idea would be to make it chocolate and dip on some melted mint coating. I tried the melted chocolate chips for dipping the candy and I needed to add a little bit of oil to make it thinner (1 Tab oil for 3/4 cup chips). I choose chips that have sugar and chocolate liquor as the main ingredients. Surprisingly enough there are generic brands that have these ingredients and are better than the name brands.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLEAMAZON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-24T15:06:02.177Z",
                "reviewBody": "These are delicious. My mom and I made these one year when I was a kid and I remember loving them. So when I saw this recipe I was excited to try it. I always read reviews before I make anything and so I saw to decrease the butter (and I did use butter instead of margarine) and up the powdered sugar and they were excellent. I gave these out in a candy assortment for Christmas gifts and they were a huge hit. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTYDAWNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1042599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-09T21:35:44.903Z",
                "reviewBody": "If you will freeze the cream mixture before balling and then again after balling and only get a few out at a time to dip they will stay firm better for dipping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAJONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-07T19:56:22.89Z",
                "reviewBody": "I also make this w/ a stick of real butter - not margarine and 2 boxes of confectioner's sugar. No problems with not being firm enough. I use dipping chocolate rather than melted chocolate chips. I also make these up in advance and freeze (before dipping). I freeze on a cookie sheet that I've lined w/ waxed paper. When they are frozen I transfer to a zipper freezer bag. I dip as needed all holiday season.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "prissycat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3099/"
                }
            }
        ]
    }
]