[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
                    "name": "Dips and Spreads Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17185/the-best-blt-dip/",
        "name": "The Best BLT Dip",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F699886.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-12-31T04:39:36.000Z",
        "description": "I cannot go to a gathering, event or party without someone asking me if I brought my BLT dip...a crowd pleaser! Have your guests dip the toast triangles in the dip and wait for the ooh's and ahh's. The toast is what makes this recipe a genuine BLT impersonator!",
        "prepTime": "P0DT0H25M",
        "cookTime": null,
        "totalTime": "P0DT0H25M",
        "recipeYield": "25 30 servings",
        "recipeIngredient": [
            "1 pound bacon",
            "1 tomato, chopped",
            "1 (32 ounce) jar mayonnaise",
            "32 ounces sour cream",
            "½ teaspoon garlic powder",
            "salt and pepper to taste",
            "1 (1 pound) loaf sliced white sandwich bread"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet, brown entire pound of bacon until crisp, placing cooked strips on paper towels to absorb grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For best results, finely chop bacon in a food processor or with a hand blender, but finely chopping by hand will also work.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, blend bacon, tomato and jar of mayonnaise. Add half the container of sour cream, blend well. Add more sour cream by spoonfuls, until the mixture isn't overwhelmed by the taste of mayonnaise (you'll be left with about a cup or so of sour cream,  typically). LIGHTLY coat the top of the mix with garlic powder, and blend. Add a dash of salt and pepper to taste. Toast the bread, then cut into fours.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Dips and Spreads Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 55,
            "itemReviewed": "The Best BLT Dip",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "474.8 calories",
            "carbohydrateContent": "12.2 g",
            "cholesterolContent": "42.2 mg",
            "fatContent": "45.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "480.8 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-31T19:21:47.92Z",
                "reviewBody": "This is a great dip however I made a few modifications the second time I made it. The original dip had too much mayo it also yielded too much dip overall and the ratio of bacon was off. So I used 1 cup of mayo 2 cups of sour cream 1 lb of bacon 1/4 tsp of garlic powder 1 tomato and salt and pepper to taste. For dipping I put out a fresh loaf of sourdough bread cut up in chunks. It was a huge hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolyn Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1132987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T17:15:33.467Z",
                "reviewBody": "There is no way that you should use the massive amount of mayo and sour cream! However this recipe is basically good because the addition of garlic powder and pepper is brilliant (careful with salt - think of all that bacon!) I made it with 1 cup mayo 1 cup lite sour cream and 1/2 cup softened reduced fat cream cheese (neufschatel)to make it a little \"stiffer.\" I mixed those three ingredients and sprinkled garlic powder and pepper across the top and mixed well. I didn't mix the solids into it ahead because I knew the bacon would get mushy and the tomatoes might water the dip. I also seeded the tomatoes. I mixed everything and spread it on a flat round tray and sprinkled some shredded iceburg on the top. I used lightly salted pita points to serve. Toast points would be yummy but lots of work and not necessary. Bagel \"chips\" would be good too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNEBK1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T14:24:59.437Z",
                "reviewBody": "This is similar to another recipe on this site (blt dip) and the results are pretty much the same although I liked the garlic powder addition. I again used \"real bacon bits\" (oscar mayer) and added some Tastefully Simple Bacon Bacon. For those who had a problem with the dip tasting like mayo it really should be refrigerated for a few hours before serving or even tasting it as the flavors really need to meld. Thanks Christine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-19T21:06:40.423Z",
                "reviewBody": "I just can't seriously believe the submitter of this recipe meant 4 cups mayonnaise plus 2-3 cups sour cream. Something must have gotten changed before the recipe was posted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SELEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2001-12-30T03:43:46.967Z",
                "reviewBody": "I have made both recipes for BLT dip from this site and the other one is better. This one has way too much mayo and sour cream. They overtake the flavor of the bacon and the tomato. I wasn't fond of the garlic either. Otherwise the dips (either of them) are great party pleasers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "BEZEMES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/520646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-15T01:33:42.903Z",
                "reviewBody": "I made this recipe for a party and it was a big hit among the people who like mayo. I made only 1/2 a recipe with a full pound of bacon. I thought it needed a little spicing up so I added about 1/2 a packet of ranch dip mix some onion powder salt and pepper and about 3 green onions (also the onions sprinkled on top made the dish more colorful) I also changed the recipe to be equal parts mayo and sour cream. I served it with cut up bread but the leftovers were good w/ anything from crackers and chips to spread on plain white bread. I will make this recipe again for sure although next time I am going to spice it up even a bit more",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bayer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2278500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T17:19:54.347Z",
                "reviewBody": "The recipe as written has way too much mayo and sour cream. I make it with one cup each on the mayo and sour cream to a pound of thick sliced bacon. I cook the bacon well and break it into pieces but keep them large enough to be recognizable. Since it's BLT dip you don't want bacon \"crumbs.\" You don't need any additional salt. The bacon adds enough on its own. I skip the garlic too. Think about it... you don't put garlic on a BLT sandwich. It overpowers the BLT flavor. For tomato I use the giant cherries (or other less liquidy tomato) and just cut them up. Chopping would bring out too much moisture. The equivalent of one tomato is not nearly enough. Add tomato until it's to your liking. Serving with pita or bagel chips is far better than using bread but it is great with toast points.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "janisko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2136316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-03T15:10:59.187Z",
                "reviewBody": "I think the measurments are way off on this one. Too much mayo and sourcream and not enough of the tomato and bacon. I cut this back to a cup of each and then added the rest of the ingredients as listed. Served this in a hollowed out bread bowl and toasted the the soft bread pieces. To keep the bacon crispy I added it just before serving however I made the dip the night before in order for the flavors to engage. With a few modifications it was gobbled up at our party. Thank you Christine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T22:20:57.303Z",
                "reviewBody": "I used at three very large tomatoes that I spooned the \"guts\" out of and I AT LEAST halved the mayonnaise and sour cream (I added about a half cup of each and after I added the lettuce I needed just a touch more but really the amount required in this recipe would have been overkill for us). Right before serving I stirred in one package of already-shredded lettuce. I did taste it and I added a little more garlic powder after tasting. We really enjoyed this. I didn't have white bread but I did have whole wheat so I toasted that and cut it into points and also opened a box of Wheat Thins and we ate that with this dip as well. My boys just went ape over it. You add bacon to anything pretty much they'll love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            }
        ]
    }
]