[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16881/burrito-pie/",
        "name": "Burrito Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F392583.jpg",
            "width": 3056,
            "height": 2292
        },
        "datePublished": "2000-01-02T20:55:47.000Z",
        "description": "This is a lot like a lasagna, only Mexican-style! Serve like a pie and garnish with sour cream, salsa, lettuce and tomato. Make sure you like spicy foods before trying this one. It's hot!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "2 pounds ground beef",
            "1 onion, chopped",
            "2 teaspoons minced garlic",
            "1 (2 ounce) can black olives, sliced",
            "1 (4 ounce) can diced green chili peppers",
            "1 (10 ounce) can diced tomatoes with green chile peppers",
            "1 (16 ounce) jar taco sauce",
            "2 (16 ounce) cans refried beans",
            "12 (8 inch) flour tortillas",
            "9 ounces shredded Colby cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "KATHIMC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5581734272528545,
            "ratingCount": 4117,
            "itemReviewed": "Burrito Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "431.6 calories",
            "carbohydrateContent": "33.3 g",
            "cholesterolContent": "67.9 mg",
            "fatContent": "23.9 g",
            "fiberContent": "4.7 g",
            "proteinContent": "19.8 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "847.4 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-16T00:41:18.697Z",
                "reviewBody": "I have made this several times now, and have found two main factors that make the difference between this being a 3* and a 5* meal. 1. Use at least 2 or 3 tortillas thick per layer. Otherwise, it gets soggy and mushy. 2. Let the meat simmer with the sauce at least 30 minutes, otherwise it does not meld together. This is a great recipe all in all, though, and I always look forward to making it. It is also a great freezer-to-oven meal. Simply take it out of the freezer and cook it at 350 for 40-50 minutes, or until bubbly. I always divide a full batch into several 11X7 pans, so I can freeze a couple for future meals. VERY IMPORTANT: I FREEZE IN A FOIL PAN...IF YOU FREEZE IN A GLASS PAN, YOU CAN'T PUT IT STRAIGHT INTO THE OVEN, OR ELSE THE GLASS WILL SHATTER. DEFROST IT FIRST.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happywife05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T23:06:03.34Z",
                "reviewBody": "This recipe was good, but I know I will make several changes next time:  I too will use taco seasoning in the ground beef(no water), and I won't mix the beans in with the meat mixture - makes it too gloppy & all one texture.  I like the idea of spreading the beans on the tortillas, and will definitely use zesty beans.  The new layering order will be: meat, cheese, beany tortillas (bean side down), meat, cheese, beany tortillas etc.  I'm also going to split this into two 9\" disposable pie pans - bake one & freeze the other for future use (this is a VERY big recipe). It was pretty good the original way, and I know we'll really like it this way.  Can't wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-14T00:41:51.717Z",
                "reviewBody": "Boy am I glad I didn't follow the advice of other reviewers to cut this recipe in half!  This was absolutely delicious!  Any easy, too!\r\n\r\nThis is the first recipe I've made in a LONG time where everyone at the table cleaned their plates - and asked for seconds (or thirds in my husband's case!).  With two young kids (3 and 5) this rarely happens (unless we're having hot dogs!) \r\n\r\nUsing the same amounts of ingredients as called for in the recipe, I divided it up to make two different casseroles,  a spicier version for me and my husband and a mild version for the kids.  After browning the ground beef and onions, I divided the meat before adding the taco sauce.  I used medium sauce for the adult dish and mild for the kids.  For the adult dish I used all of the same ingredients as called for in the recipe (except olives).  For the kids, I just used tortillas, ground beef/onions/taco sauce, refried beans and cheese.  They loved it!  \r\n\r\nRather than mixing the refried beans into the beef mixture, I used a spoon to spread them on top of the tortillas before adding the beef mixture.  This worked very well and allowed me to adjust the amount to suit our tastes.  I ended up using about 1.5 cans between the two dishes.  \r\n\r\nThis will definitely become a regular in our house.  Thanks for a delicious, easy recipe that made dinner a very enjoyable occasion after a long day at work.  I can't wait to share the recipe with others.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NICKSAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/813141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T21:29:55.717Z",
                "reviewBody": "This deserves ten stars! Absolutely amazing dish. I made this when I was visiting my parents and it was a HUGE hit. None of us were expecting to be so crazy about it, but wow.\r\n\r\nI'm trying to cut red meat out of my parents' diets, so I substituted the beef with turkey--without telling them (my dad wouldn't have tried it otherwise). I added some spices--cumin, season all, a couple of different kinds of pepper. I also did as others suggested and used one can black beans, one can spicy refried beans. I would up forgetting to add the taco seasoning, but it definitely wasn't missed.  Instead of taco sauce, I used chunky salsa. I served it with a handful of shredded lettuce, a couple of spoonfuls of fat free sour cream, and extra salsa on the top.\r\n\r\nThis made a nice sized casserole--I had to cut the tortillas to fit, though, because I bought the extra large ones and only had a...whatever the normal size cass. dish is. It's a very filling meal, and mom ended up freezing half of it, which she told me they plan on eating this coming week. There was *still* enough for us to have left overs the next day--it tasted just as good after a night in the fridge, by the way.\r\n\r\nFat free tortillas aren't your best bet for this, just fyi. I was hesitant about them, so I only used one in the middle, the rest were regular tortillas. Upon later inspection, the fat free tortilla kind of dissolved. So use fat free sour cream and use your fat grams for the cheese and tortillas. It's worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/849655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T11:59:56.24Z",
                "reviewBody": "Since there are so many reviews to this recipie, I do not know if this was mentioned. When I made mine and instead of the 4 quart casserole pan, I used two 9 inch cake pans. I am only cooking for two so I froze the other. This was so very good! My husband, a tex/mex food fan, loved it (he added his favorite hot sauce to it since he loves extra extra heat)! No alterations need to be added to this. The ingreidents weren't hard to find and very inexpensive. Preparation was so easy! I served it with tortilla chips, sour cream and salsa. It's a good weekend or Friday night dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEG1014",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/140969/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-15T15:12:27.16Z",
                "reviewBody": "HELPFUL TIPS AFTER MAKING THIS FOR YEARS: Halve the MEAT but used 3/4th a can of the olives, whole can diced tomatoes & entire can of chiles (can't cut too much out or you won't be able to stack your pie).  Sometimes I add chopped red/green peppers and cut out onions. Eyeball the salsa (use enough to coat the meat) which I use instead of taco s.  Don't be afraid to layer this with 2-3 tortillas starting at the SECOND layer b/c it makes it taste just perfect (like taco bell mexican pizza)! I sprinkle taco seasoning over the beef while it's cooking (awesome flavoring) but not necessary.  It helps tremendously to let it simmer as long as it says because the ingred. start to stick together for a nicer consistency.  Apply a THIN layer of refried beans on the bottom of each new tortilla (i submitted pic), THIN layer of meat, & buy extra mexican cheese b/c you tend to use a lot to layer perfectly!  This made 3 thin layers of meat, cheese, refried beans w/just the right amount to add the last amount of meat on top & have enough refried beans to serve as a side (b/c you only use 1/4th of it).  If you make the full amount, it freezes well, so you can use it for a quick meal!  Update: I cook until edges of tortilla are not soft (almost crisp so never soggy) & people go nuts over this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T20:52:22.437Z",
                "reviewBody": "This recipe calls for a \"large skillet\".  That is an understatement.  If you add all of the ingredients to the skillet, you will require a skillet of about 18-inches in diameter or a \"rondo\" (sp?).  Therefore, I did not add the refried beans to the pan.  Instead, I layered them onto the tortillas first, then the cheese, (which the recipe calls for 9 ounces but isn't quite enough, you need more like 12).  And, I still had 4 tortillas left over after I layered.  She also stated that a 4-quart casserole dish would suffice.  No way.  An 11\"X 15\" casserole pan is required to use all of the products.  The recipe also stated that it serves 7.  Seven what?? Giants??  I was able to get 12 servings from this recipe with leftovers.  If you want more \"spice\" than what the recipe states it has, add some jalapeno flavored refried beans instead of the basic and use a HOT taco sauce.  Overall, I'd say the author has a good recipe, but far from perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "VARISSUL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/518629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-12T05:31:18.857Z",
                "reviewBody": "I made this recipe last night for dinner and it came out great. I halved the recipe and made it in a 9x13 inch pan. I cooked green onions instead of regular onions with the meat, the kids tolerate green onions. Instead of olives I added an 8 oz. can of mushrooms. I used a 7 oz. can of green chilies, we like them a lot. I used 1 whole can of diced tomatoes with green chilies, we like them a lot also. I used 8 oz. of homemade salsa, I always have some on hand, instead of taco sauce. I did use 1 whole can of refried beans, and we did not think it was too beany as other reviewers said. I used cheese to our liking, probably much more than called for. It was excellent! Thanks Kathi for a great, fast recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LANIMCMOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/140925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:33:25.42Z",
                "reviewBody": "This is such a nice change from all the regular dinners I cook. It is very tasty. I am not a fan of refried beans but the mixture worked well. My daughter of 5 yrs kept asking \"mom why haven't you made this before?\" We topped our mexican lasanga with lettuce green and red peppers and sour cream. What a treat! I will be making this alot in the future esspecially when I am looking for a way to spice up our dinner life.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Burrito Pie",
            "description": "This spicy casserole features layers of seasoned beef, beans, cheese, and tortillas.",
            "uploadDate": "2013-04-16T22:35:51.603Z",
            "duration": "PT2M46.708S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F27fe208f-394d-42e4-98d5-6609a8e9ce2d%2F6100bb24-29f5-4d91-83b4-dbceded92314%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2305869670001"
        }
    }
]