[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/997/meat-and-poultry/pork/ribs/baby-back-ribs/",
                    "name": "Baby Back Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16091/baby-back-ribs/",
        "name": "Baby Back Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5447437.jpg",
            "width": 1080,
            "height": 1039
        },
        "datePublished": "2000-01-04T03:55:09.000Z",
        "description": "These are tender and the meat falls right off the bone. Generally, people think of baby back ribs as a meal they would only order when at a restaurant, but they are so easy to make at home. This recipe could not be any more simple.",
        "prepTime": "P0DT8H0M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT10H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 pounds pork baby back ribs",
            "1 (18 ounce) bottle barbecue sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Tear off 4 pieces of aluminum foil big enough to enclose each portion of ribs. Spray each piece of foil with vegetable cooking spray. Brush the ribs liberally with barbeque sauce and place each portion in its own piece of foil. Wrap tightly and refrigerate for at least 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake ribs wrapped tightly in the foil at 300 degrees F (150 degrees C) for 2 1/2 hours. Remove from foil and add more sauce, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Baby Back Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KHEFFN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.768627450980392,
            "ratingCount": 2040,
            "itemReviewed": "Baby Back Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "696.9 calories",
            "carbohydrateContent": "45.7 g",
            "cholesterolContent": "170.1 mg",
            "fatContent": "37.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "43.2 g",
            "saturatedFatContent": "13.6 g",
            "servingSize": null,
            "sodiumContent": "1607.2 mg",
            "sugarContent": "32.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-30T20:30:48.523Z",
                "reviewBody": "These ribs really did fall off the bone and they were delicious!!  However, I would change a couple things next time I make them.  I followed the recipe as is, except I made my own bbq sauce.  When they were in the oven, the foil pouches started leaking.  I contributed that to the fact that I may have had too much sauce in there and also the ribs secrete their own juices as they cook.  Next time I may cook them in a cooking bag or I might line a 13x9 baking pan with non-stick foil and marinade and bake them in that.  The non-stick foil really works!  I baked the ribs for 2 1/4 hours and then placed them meaty side up on a cookie sheet lined with non-stick foil.  Then I put more homemade sauce on them and broiled them for 15 minutes.  This really makes a difference because then the ribs have sauce really sticking to them, restaurant style.  If you skip this part and just take the ribs out of the foil and serve them, there is no sauce on them and they look pale and unappetizing.  Just be sure to check the ribs frequently as their broiling so that they don't get burned.  I had 3 big, hungry guys for dinner that night and they ate 5 pounds of ribs!  Just a side note, I made yummy potatoes in foil and the whole dinner was EASY cleanup!  Just slice raw potatoes fairly thin and lay them in a mound on a lg. piece of foil.  Put a few pats of butter on them and sprinkle with salt, pepper or any herbs you like.  Seal them up good and let them cook with the ribs for at least an hour and",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KERI5678",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-05T21:05:55.833Z",
                "reviewBody": "This basic recipe, or cooking method, when combined with the suggestions of others, allowed me to make the most delicious, and easiest ribs we've ever had! Here are my changes. \nI adapted the \"Dry Rub for Ribs\" by Denise from this site, and it was the perfect amount for the three racks of ribs I had. This is what I used:\n1/4c. brown sugar, 1 1/2 Tbsp. paprika, 1 Tbsp. kosher salt, 1 1/2 Tbsp. black pepper, 1 tsp. garlic powder, 1 tsp. onion powder, 1/4-1/2 tsp. cayenne red pepper. (Definitely remove the back membrane before rubbing spices on!\nSeveral people had mentioned how runny the barbecue sauce got from the meat juices, so I put only the dry rub on for the 8 hour marinating process, as well as the baking. My second concern was about the meat literally falling off the bones. I wanted to finish them on the grill, so meat actually falling off  bones wasn't desirable. I baked the foil packets on cookie sheets at 300 \nfor 2 hours. I let them cool for about 1/ hour to firm up before I moved them to the grill. Then I brushed them with Jack Daniel's sauce thinned with a little of the cooking juices. Finally, I grilled them on medium heat, brushing with extra sauce for about 5 min. a side, till they were nicely caramelized. YUM! They were \"falling off the bone\" tender, without actually falling off. \nTry these! You won't be sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T03:32:22.767Z",
                "reviewBody": "First an editorial comment: someone ripped this recipe because all it involved was a method to cook the ribs, while using common bottled dressing. I must disagree. There are a lot of ways to screw up a rack of ribs, especially for the novice. This lets you use your favorite sauce, which in my case was Sweet Baby Ray's, so there's no experimenting with something you ultimately won't like. Just as promised, the ribs cooked to a perfect doneness. I'll echo what others have said: it's best to brown them under the broiler afterwards. I drained them, placed them on a broiler pan, swabbed on more sauce, and broiled them for a few minutes. Absolutely perfect. \n\nUPDATE: Use the fantastic rub described in Cathy M.'s review before brushing on the sauce.  It makes these ribs even better. Also, before anything, remove the membrane on the back of the ribs by slitting with a knife, grip the membrane with a paper towel, and pull. It will rip right off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JED901",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-31T01:26:35.793Z",
                "reviewBody": "I've gotta start off by saying I was skeptical before I started with all of the claims saying the meat just fell off the bone.\r\n\r\nI thought about having ribs for dinner at 3:00 pm. So I defrosted them and knew I had seen a recipe on here for them before. I thought about doing the overnight bit but I would be the only one home tomorrow night so I went ahead with it. \r\n\r\nI dusted the ribs with a rub of sugar, salt, pepper and paprika and then poured some Billy Bones BBQ sauce right on the foil,put the rib meat side down on the foil and then poured more sauce on top and bundled it up. \r\n\r\nThese were wonderful. I could just pull the bone right out and was left with a boneless piece of pork if I wanted to. I will definitely make these again and will marinate them overnight as the recipe says. But they're still great if you make them the same afternoon without any time to marinate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BENTLEY11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/736050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-29T18:01:56.107Z",
                "reviewBody": "This method was excellent -- and inspired me to come up with something even better.  At the minimum, you can follow this method as is, except lower the oven temperature to 225 degrees and bake for four hours.  For even better results, coat the ribs with prepared mustard (the taste of which will disappear during the long cooking time) and apply a \"dry rub\" (you can find many recipes for rubs on the Internet or in barbecue cookbooks).  Seal the ribs in a plastic bag and refrigerate for at least one day; I do it for three days.  Put the ribs on a raised rack or on paper towels (to allow fat to drip off or to absorb fat).  Put the ribs and rack (or towels) in an oven bag and bake at 225 degrees for four hours.  (Don't worry, paper towels will not burn at such a low temperature.)  After four hours, the ribs will have a nice crust and flavor from the rub and will be fall-off-the-bone tender.  The last step is to remove the ribs from the bag, brush the upper surface with your favorite barbecue sauce and broil for ten minutes.  This is optional, but after cutting up the ribs, I like to pour on a little more sauce to make the ribs \"wet.\"\r\n\r\nI realize that this written description makes the process sound quite involved, but it's really not and the results are well worth the extra trouble.  Oh, and I have really enjoyed experimenting with different rub/sauce combinations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GSCHWIM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T10:39:42.497Z",
                "reviewBody": "I'm a last minute recipe finder and didn't have but 30 minutes to prepare for cooking - so I didn't marinate these ribs in the sauce for more than 20 minutes and they were AMAZING - I did omit the spraying of the foil and used the new Reynolds Non-Stick Foil instead no sticking - and no mess!  Grilling for 20 minutes after baking - on indirect medium heat makes them restaurant style.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RACHELFERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-04T18:35:36.56Z",
                "reviewBody": "Yes, these are great IF you add to it.  First, definitely use a dry rub before cooking in the oven.  I also add a slight amount of brown sugar to caramelize and add great color.  Finally after removing from oven, remove foil and grill for about 10 minutes on each side, basting with bbq sauce,until desired color.  The grilling at the end is the key to not having a \"McRib\" texture.  Try it...YUM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN Z.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/718120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-16T04:26:04.843Z",
                "reviewBody": "These ribs really got my guests' attention when they literally fell off the bone as they were served! I ensured their tenderness by removing the tough clear membrane from the underside of the ribs. Then I lightly seasoned the underside with a rub and used the Blackberry BBQ Sauce recipe (from this site) for the top of the ribs. As the recipe said they were marinated overnight then slow cooked in foil. Fantastic! The three elements for tender ribs: (1)remove the membrane prior to cooking; (2)marinade with a lemon or vinegar acidic base (found in the ketchup in this recipe); (3)slow cook... voila! perfect ribs every time! Thanks for sharing the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/297942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T19:51:32.483Z",
                "reviewBody": "If it falls off the bone, you just steamed all the texture and flavor out of them. Try using a dry rub instead of the sauce, cut the oven time back to a couple hours, low temp 250, then slowly grill over charcoal. Add sauce at the end. You'll have a better slab with a little bite to the meat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RobsRibs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7031220/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baby Back Ribs",
            "description": "See how to make tender, fall-off-the-bone baby back pork ribs.",
            "uploadDate": "2012-06-25T19:11:56.282Z",
            "duration": "PT2M33.612S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6d2eb812-6354-4997-9f08-bc85362b916c%2F28ca5839-27c2-4661-b041-0fb979e54bb2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1706563411001"
        }
    }
]