[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15057/desserts/cookies/butter-cookies/",
                    "name": "Butter Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/855/desserts/cookies/butter-cookies/shortbread-cookies/",
                    "name": "Shortbread Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15347/caramel-shortbread-squares/",
        "name": "Caramel Shortbread Squares",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3206440.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2000-01-05T23:08:05.000Z",
        "description": "These cookies consist of a shortbread crust, firm caramel center, and a milk chocolate top. They are super-easy to make and they take only 20 minutes to bake.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "1 - 9x9 inch pan",
        "recipeIngredient": [
            "⅔ cup butter, softened",
            "¼ cup white sugar",
            "1 ¼ cups all-purpose flour",
            "½ cup butter",
            "½ cup packed light brown sugar",
            "2 tablespoons light corn syrup",
            "½ cup sweetened condensed milk",
            "1 ¼ cups milk chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together 2/3 cup butter, white sugar, and flour until evenly crumbly. Press into a 9 inch square baking pan. Bake for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 2 quart saucepan, combine 1/2 cup butter, brown sugar, corn syrup, and sweetened condensed milk. Bring to a boil. Continue to boil for 5 minutes. Remove from heat and beat vigorously with a wooden spoon for about 3 minutes. Pour over baked crust (warm or cool). Cool until it begins to firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chocolate in a microwave-safe bowl. Heat for 1 minute, then stir and continue to heat and stir at 20 second intervals until chocolate is melted and smooth. Pour chocolate over the caramel layer and spread evenly to cover completely. Chill. Cut into 1 inch squares. These need to be small because they are so rich.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Butter Cookie Recipes",
            "Shortbread Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julia"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.473513513513513,
            "ratingCount": 925,
            "itemReviewed": "Caramel Shortbread Squares",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "118.7 calories",
            "carbohydrateContent": "13.2 g",
            "cholesterolContent": "16.7 mg",
            "fatContent": "7.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "44.5 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-18T22:49:38.217Z",
                "reviewBody": "I have made this recipe many times and here are my tips: Double recipe, line 9x13 pan with parchment paper to easily lift out finished product. \nMake caramel exactly as written, but low heat with constant stirring. I have never had a problem. Shortbread should be slightly cooled- mine usually goes from the oven to the freezer and sits for about ten minutes before I pour on the caramel. It will not ruin the shortbread, I promise.\nI use dark chocolate instead of milk to level off the sweetness of the caramel a bit. I microwave the chocolate exactly as written, but add a tablespoon of butter. This absorbs into and smooths out the chocolate much better than milk.\n\nFinally, cut squares while chocolate is still just slightly soft with a heated knife. (I run mine under very hot water then dry it off). \nThese are not difficult, it just takes time to get to the finished product.\nBon Appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kirsten, a cook from Vancouver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2018929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-23T13:03:49.997Z",
                "reviewBody": "The final product tasted great and was a big hit at a potluck lunch at my school, but, one thing in the recipe could be a bit clearer.  It should say to let the shortbread cool quite a bit before putting on the caramel. I let mine cool for 5-10 minutes and then poured on the hot caramel and it all sunk into a big puddle in the middle. That batch had to be scrapped and another made.  It turned out fine as I let the shortbread cool overnight.  I found them easy to cut as I cut them when the chocolate was still soft. The cookie did crumble a bit, but that was fine. Very yummy, just like what I used to get in London.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LKWILLIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/732662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-25T18:39:38.75Z",
                "reviewBody": "I made a terrible mistake with these. I gave them all AWAY!! Oh they tasted wonderful. I sort of wish I had kept a few for myself, although it's better for my waistline that I didn't. :) They were very easy and were delicious. I made a few changes based upon the reviews here. After I baked the crust, I poked holes in it with a fork and let it cool completely. I cooked the caramel over a lower heat and cooked it to the firm ball stage on my candy thermometer. I let that layer cool completely. I melted the chocolate with a little evaporated skim milk to keep it from getting too hard when it set up, and it was perfect. I tried cutting these when it wasn't cold and the cookies crumbled. I put it in the freezer for a bit and then tried to cut it again and the cookies were perfect. Everything came out wonderfully and I'll definately make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-12T01:09:20.467Z",
                "reviewBody": "I followed everyone's posting prior to making this great recipe. Double recipe and cook in 9 by 13 dish. Line pan with foil. Prick shortbread after baking. Cool in freezer between steps and use litte half and half with chocolate. These are super easy and very tastey will make a gain.  GREAT RECIPE!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LindseyJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1671111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-09T13:54:25.107Z",
                "reviewBody": "Fantastic! I made these last night and took the advice of several people and they were incredible. I greased and floured a 9x9 pan and they came out looking just like the picture. It is those of you that used a larger pan that...they came out too thin. I poked holes in the raw shortbread and then cooked for the time stated...then let it cool for only about 10 minutes....then added the carmel mixture (I did add a little extra milk)...let it set up well and then melted the chocolate with a little bit of half and half. I put it in the fridge for about a half hour...scored them and then let them sit in the pan...in the fridge all night. I cut them this morning and all I can say is...WOW!!!! They are incredible!!! The shortbread was prefect...the carmel was nice and thick yet very smooth....no hard in the least and the chocolate just melts in your mouth. It definitely taste similar to a twix bar but so, so much better. Try these....you will be so glad that you did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNAINNC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-28T23:39:33.92Z",
                "reviewBody": "This are great!! I've made them many times. Cook the shortbread let it cool then place it in the freezer while you are making the caramel. Let the caramel cool in the fridge before putting the chocolate on. Another great thing to do is to line your pan with tinfoil then you can lift them out to cut them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERLOVESTOCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-12T02:13:38.293Z",
                "reviewBody": "This recipe tastes incredibly good, but I found two problems with it.  First of all, it is really easy to scorch the caramel filling - you have to stir both constantly and rapidly to avoid that - Because of that I burned my hand so badly it blistered.  The other problem with it is that the shortbread tends to fall off of the rest of the bar, making it very messy to eat or serve.  However, it tastes incredible so I wouldn't want to discourage anyone from trying this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAIORCACY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/527425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-30T02:45:28.47Z",
                "reviewBody": "Yummy!  I found these easy to make and delicious. Brought them in for a potluck and they were gone in 30 minutes!  You're going to be tempted to put the pan in the fridge to \"set\" the caramel but I've found (after doing this a couple of times) that it makes the crust more crumbly and causes them to taste a bit stale even. Be patient - the caramel will set on its own.  Also, be sure to melt your MILK chocolate chips in a double boiler as they don't melt quite the same as semi-sweet in the microwave I've found.  Definitely cut them small - extremely rich.  Love these - make them all the time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROSNANFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T23:40:15.59Z",
                "reviewBody": "My co-workers and I loved these.  Just like homemade twix bars.\r\nHelpful suggestions:  They pop right out of the pan if you grease *and* flour the pan.  The bottom crust is really easy to make in the food processor; just process into coarse crumbs.  The caramel is very good, but you need to watch it the whole time and use low heat.  I also found that the recipe is better if you cool the shortbread before putting in the caramel.  I only cooled these till the caramel was stiff, so the  melted chocolate ran over the sides of the bars, making them more like twix.  Oh, and be sure to run a knife around the pan before trying to get them out.  Happy cooking and eating!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEKEBULLSEYE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/734240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-16T19:01:16.577Z",
                "reviewBody": "Disaster from the beginning! While cooking the caramel it burned horribly. I was able to salvage it but IF I were making this again (which I doubt) I would have used a double boiler to make the caramel. When I melted the chocolate chips it turned into a fudgy texture making it clumpy to spread on the caramel. I have not removed them from the pan except a small piece to taste but the crust crumbled into my hand. While it was tasty these are VERY messy both to make and eat. I don't think I'd bother with these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MERELLAMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/746100/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Caramel Shortbread Squares",
            "description": "See how to make classic scalloped potatoes without cheese.",
            "uploadDate": "2014-02-24T22:43:36.787Z",
            "duration": "PT2M27.214S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F48d929dc-7d9c-4000-9743-badae551289d%2F8b8d6750-6707-4bcf-87d0-8b4d0c8991fe%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3251625189001"
        }
    }
]