[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7296/quick-black-forest-cake/",
        "name": "Quick Black Forest Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1133841.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "1998-03-13T15:03:27.000Z",
        "description": "This version of Black Forest cake gets you an easy, delicious, and moist cake by using cherry pie filling and devil's food cake mix.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 x 13 inch pan",
        "recipeIngredient": [
            "1 (18.25 ounce) package devil's food cake mix with pudding",
            "3 eggs",
            "1 tablespoon almond extract",
            "1 (21 ounce) can cherry pie filling",
            "1 ½ cups semisweet chocolate chips",
            "1 tablespoon butter",
            "2 tablespoons milk",
            "½ cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together: cake mix, beaten eggs, almond extract, cherry pie filling and 1 cup semisweet chocolate chips. Stir until just combined.  Pour batter into a greased 9x13 inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a 350 degree F (175 degree C) oven for 45 to 50 minutes or until a toothpick inserted in the center comes out clean.  Remove cake from oven and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Glaze: Heat 1/2 cup semisweet chocolate chips, butter or margarine, and milk in a saucepan over medium high heat.  Once  semisweet chocolate chips are melted and mixture is combined stir in confectioners' sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread glaze over cooled cake. Serve cake as is or with whipped cream and a cherry.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Donna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647619047619048,
            "ratingCount": 315,
            "itemReviewed": "Quick Black Forest Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "263.4 calories",
            "carbohydrateContent": "41.7 g",
            "cholesterolContent": "38.5 mg",
            "fatContent": "9.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "235.7 mg",
            "sugarContent": "23.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-07T13:04:30.793Z",
                "reviewBody": "Today is my son's birthday and this is the third year he has requested this cake. I mix the cake according to the directions and it comes out moist and fudgy. The almond extract really compliments the cherry filling. I make this in two 9 inch round cake pans and bake them for 35 minutes.Instead of the glaze I frosted it with chocolate icing. I topped the cake with about 1 cup of additional cherry pie filling and used white icing piped around the edge to keep it from running over the sides. It looks gorgeous when finished. Everyone thinks it's from a bakery. Thanks for such a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROOKMAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/885268/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-02T15:55:10.09Z",
                "reviewBody": "I made this cake in a bundt pan and drizzled cherry pie filling on top of the chocolate glaze. It was wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1230323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-14T01:04:32.397Z",
                "reviewBody": "Divine and easy. Hubby gave 5 stars and he is hard to please. I used Pillsbury moist supreme devil. I added 1/2 c oil & 1/2 c water. I also placed batter in 2 greased 9 inch cake pans baked 30-35 minutes. I cooled the cakes and in between the layers I put chocolate icing then covered the entire cake with it. So good!!  Icing simple: 4 & 1/2 c confec. sugar, 1/2 cup milk, 1 c soft butter, 1 & 1/4 c cocoa, 1/2 tsp vanilla and 1/2 tsp almond extract. Beat butter, then add rest and beat....so good and like I said easy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "072705r",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2357408/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-06T23:17:55.56Z",
                "reviewBody": "Okay I hesitated giving this five stars because I didn't really make this. I had every intention of making it. I went to my cupboard (like old Mother Hubbard) and all I had was a caramel cake mix and apple pie filling. Another recipe was born. I followed the same premise using caramel cake mix white chocolate chips and apple pie filling (I chopped the apples finer). Instead of the almond extract I used 1.5 tsps of butter flavoring and 1.5 tsps of rum extract. I heated some caramel frosting and used that for a glaze. It was a major hit and the entire cake is gone. My brother's best friend said it's the best cake he's ever eaten. I can't wait to try it the \"right\" way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigbottombbq/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-07T14:00:17.98Z",
                "reviewBody": "This is hands down a great recipe!  We have used it for 4 years for our church dinner theater and I just pass the recipes out to the cake bakers and the all 25 cakes come back perfect!  It's almost fool proof!  We wanted to change our dessert this year, but with 4 of use looking couldn't find a better recipe!  It tastes great, is so easy, and when put on a plate drizzled with chocolate sauce, whipped cream, a cherry and a wedge of chocoate, it looks and tastes like heaven.  If you're looking for an easy recipe, but still want it to be something special- look no further!  We do mix the mix according to its directions (including the oil), then add all the goodies, rather than just using eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Greta the Great",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/505004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T19:43:22.863Z",
                "reviewBody": "Just made this cake for my husband's birthday and it turned out great. I made the cake almost to the recipe but made only minor changes. Instead of regular chocolate chips which some people on here said didn't work out so well, I used mini chocolate chips and it was perfect. I also saw on another recipe the use of Black Cherry Soda in the cake so I added about 6oz of Thomas Kemper Black Cherry Soda to the mix. I also used a chocolate frosting recipe I got from America's Test Kitchen and then decorated it with chocolate covered cherries. FANTASTIC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2424722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-04T00:31:46.923Z",
                "reviewBody": "Well my hubby requested BFC for his birthday this year so I made this one. Not so great! First off the cake ends up being a little bit dry because there is hardly any moisture in the cake itself. It looks great coming out of the oven and the taste is okay beause the base is a cake mix. I didn't personally care for the taste of the chocolate chips in the cake either. Overall I didn't care for this and I like chocolate cake! The absolute WORST part of this was the frosting! Oh my goodness.... too sweet! (Like makes the roof of your mouth itchy sweet.) If you like the type of frosting that is on Texas Sheet Cakes (and we don't) then you'll love it because that is exactly what it is without the pecans on top. Wish I had known! It would have been much better with a simple chocolate ganache or melted canned frosting drizzled on the top. Adding the pie filling to the cake mix was the only thing I'll take away from this recipe. Other than that it was a big waste of money on our tight budget. I would NEVER make this again. But for those still contemplating this one try this - get TWO cans of cherry pie filling. Make the cake in two round pans and put the extra pie filling inbetween and a layer on top. It might help rescue this one. Be prepared for a sugar rush...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KittyFanatic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1354028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T15:02:44.217Z",
                "reviewBody": "Made this one for an anniversary. Easy and really moist. I used vanilla extract instead of almond and spinkled walnut pieces on the chocolate glaze while it was still warm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/417752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-07T18:07:50.353Z",
                "reviewBody": "I made this cake twice in a weekend for birthday's and it was a hit! I made the cake as directed but instead of the chocolate topping I put real whip cream and mixed it with mini chcoclate chips. This cake came out very moist and very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2931730/"
                }
            }
        ]
    }
]