[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17160/christmas-stollen/",
        "name": "Christmas Stollen",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581814.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2000-01-11T19:11:11.000Z",
        "description": "I got this recipe while I was head baker at London's Dorchester Hotel. It's packed with dried fruit and filled with a marzipan surprise.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 tablespoon active dry yeast",
            "⅔ cup warm milk (110 degrees F/45 degrees C)",
            "1 large egg",
            "⅓ cup white sugar",
            "½ tablespoon salt",
            "⅓ cup butter, softened",
            "2 ½ cups bread flour",
            "⅓ cup currants",
            "⅓ cup sultana raisins",
            "⅓ cup red candied cherries, quartered",
            "⅔ cup diced candied citron",
            "6 ounces marzipan",
            "1 tablespoon confectioners' sugar",
            "¼ teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the yeast mixture with the egg, white sugar, salt, butter, and 2 cups bread flour; beat well. Add the remaining flour, 1/4 cup at a time, stirring well after each addition. When the dough has begun to pull together, turn it out onto a lightly floured surface, and knead in the currants, raisins, dried cherries, and citrus peel. Continue kneading until smooth, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly grease a cookie sheet. Deflate the dough and turn it out onto a lightly floured surface. Roll the marzipan into a rope and place it in the center of the dough. Fold the dough over to cover it; pinch the seams together to seal. Place the loaf, seam side down, on the prepared baking sheet. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 10 minutes, then reduce heat to 300 degrees F (150 degrees C), and bake for a further 30 to 40 minutes, or until golden brown. Allow loaf to cool on a wire rack. Dust the cooled loaf with confectioners' sugar, and sprinkle with the cinnamon.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Lee Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.413043478260869,
            "ratingCount": 92,
            "itemReviewed": "Christmas Stollen",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "177.6 calories",
            "carbohydrateContent": "28.8 g",
            "cholesterolContent": "24.1 mg",
            "fatContent": "6.8 g",
            "fiberContent": "1.4 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "306.5 mg",
            "sugarContent": "17.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-23T14:21:20.5Z",
                "reviewBody": "Try it in your bread machine. Really! Just put in all the liquid ingredients then the flour (I reduced the amount to 2 1/4 cups) and then the yeast on top...after it has started to mix together add the candied fruit a little at a time. Most of it will mix in some may be left at the bottom of the pan. After the first rise remove it from the machine. Turn your oven on to 200 degrees for 5 minutes - then turn it off. Knead the dough a little to get all the fruit in - the dough should be soft and a little sticky - don't add to much flour it will make the final product stiff and dry! Then roll it out and put in the marzipan just like the recipe says. Put it in the warmed oven to rise - I guarantee it will rise up beautifully - as long as you haven't added too much flour! It is a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Maleski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1307201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T00:43:21.77Z",
                "reviewBody": "This is the 4th year I've used this recipe to make stollen as gifts for family and friends. It's great!\n\nA few tips for people first setting out:\n1) Marzipan contains almonds, so take care if you or anyone you make it for has nut allergies.\n2) This makes a HUGE stollen. When the recipe calls for folding the halves it over onto one another, instead put each half on its own tray (or well separated on a large baking pan) and make two in one go.\n3) Sprinkle icing sugar on the stollen just after you pull them out of the oven - don't wait! The heat from the dough will be sufficient to melt the sugar and create a sugary 'crust' instead of just powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rikko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2680292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T10:40:49.56Z",
                "reviewBody": "I have tried several Stollen recipes and this one is the best. The traditional German bread was moist inside with a delightfully sweet marzipan surprise. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SBRADFORD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/427127/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-05T20:46:05.56Z",
                "reviewBody": "My parents are German immigrants and I make Christstollen every year and sell it on ebay. This is very close to the recipe I have developed from authentic sources. I use orange peel lemon peel and citron and I don't use candied cherries. Christstollen is baked throughout the Christmas season in Germany and it is tradition in some parts of the country to eat the last one on Easter - and that was before modern refrigeration (no freezers)! The way this was accomplished is in how the loaf is finished. While the loaf is still warm you brush it with copious amounts of melted butter. I would recommend 1/4 cup butter for this one loaf. It is then THICKLY coated with powdered sugar. This process keeps all the moisture inside the loaf as well as adding wonderful flavor. The reason for the shape of the Stollen loaf is that is to represent the Christchild in swaddling clothes. I shape the loaf by first spreading the dough into an oval shape about 6 inches by 14 inches. If I am using marzipan as in this recipe I lay the log near one edge then roll that long edge over the marzipan gathering the sides in slightly then rolling to about 1 inch away from the other side pressing gently. Stollen is a wonderful accompaniment to coffee or tea and it wouldn't be Christmas in our house without it! Merry Christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "corinaesq",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-21T15:46:11.403Z",
                "reviewBody": "My hubby's family is German and it isn't Christmas without a stollen. Usually we order one from Dresden but last year I decided to make one. I'm giving it four stars because it passed the in law test and was delicious but MAN is it a lot of work. If you're willing to put in the time to find the ingredients and make it, this IS the recipe you want to try. We're buying a stollen this year, simply because I'm being lazy. This recipe is authentic and wonderful. Oma and Opa would approve!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shoegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1509098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-22T20:25:29.35Z",
                "reviewBody": "WOW this was awesome. I have had Stollen for all my life and never made it. I used this recipe and because I am a chef was able to assertain the process from experience of making yeast leavened breads. It turned out excellent my girlfriend could not stop eating it. I think this should be part of anyone's holiday treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChezBouche'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2204230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-07T02:22:35.773Z",
                "reviewBody": "I ended up with a big wet gloppy mess. I threw out the dough without baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CSANDST1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T06:06:56.527Z",
                "reviewBody": "This was great - not only good to eat but pretty. I used fast action yeast instead of regular dried yeast and the recipe worked fine. I stirred the fast action yeast into the dry ingredients then added the warmed milk and egg. Normally fast action yeast takes less time to double and requires one raising time. With all the fruit in this the dough took a good hour and a quarter to double. Then I shaped it left it for about ten minutes and put it in the oven. I thought the dough was easy to handle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vixen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2628000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T10:40:51.747Z",
                "reviewBody": "My mother used to make this for us every Christmas morning a treat that our family eagerly anticapated each year. It's delicous fruity but not overly so sweet and chewy and if you use green food coloring in the icing very festive looking. Though I no longer live at home I still take the time to make this treat for my own family. It's worth the prep time for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAISON22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544813/"
                }
            }
        ]
    }
]