[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16400/roast-beef-with-coffee/",
        "name": "Roast Beef with Coffee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F45942.jpg",
            "width": 1120,
            "height": 840
        },
        "datePublished": "2000-01-23T04:07:56.000Z",
        "description": "Don't pass this up because it sounds strange. It is wonderful! Serve with mashed potatoes. This can also be made with a sirloin tip roast or a rump roast.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "4 to 6 servings",
        "recipeIngredient": [
            "4 pounds chuck roast",
            "5 cloves garlic, minced",
            "1 ½ cups prepared strong coffee",
            "2 tablespoons cornstarch",
            "½ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat slow cooker to low setting OR preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a sharp knife, make 5 or 6 deep slits around the top and side of the roast. Push the whole cloves of garlic down into the slits. Place the meat in a slow cooker OR a 10x15 inch roasting pan and pour the coffee over the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook in slow cooker on low setting for 6 to 8 hours OR bake at 350 degrees F (175 degrees C) for 2 to 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When roast is done, remove from slow cooker OR oven, and pour the drippings into a small saucepan over medium low heat.  In a separate small bowl, combine the cornstarch and water. Mix well and add slowly to the drippings, stirring constantly. Simmer until thickened.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "karela"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8333333333333335,
            "ratingCount": 192,
            "itemReviewed": "Roast Beef with Coffee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "754 calories",
            "carbohydrateContent": "3.9 g",
            "cholesterolContent": "235.9 mg",
            "fatContent": "48.7 g",
            "fiberContent": "0.1 g",
            "proteinContent": "70.1 g",
            "saturatedFatContent": "19.2 g",
            "servingSize": null,
            "sodiumContent": "282.3 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-24T18:19:25.39Z",
                "reviewBody": "I cut this recipe out of the Food Section of a Boston newspaper years ago- \r\n It is also called \"Peking Pot Roast\".\r\n There is one big difference that might make this recipe more appealing to those reviewers who\r\n didn't like it.\r\nBefore cooking the roast, the newspaper recipe called for soaking the roast in red wine vinegar for 2 hours.\r\n It doesn't have to be a lot of vinegar, just 1 cup in a large plastic bag, turning several times.\r\n Afterwards, the roast is rinsed with water, removing excess vinegar.\r\n This not only affects the flavor of the meat but tenderizes it as well.\r\n I was fascinated by the \"Peking Pot Roast\" recipe & that was over 10 yrs ago. Maybe using this additional step will make a difference to the folks who tried this & didn't like it.\r\n Good luck, thanks as always to allrecipe.com",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Lombard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-29T19:17:44.64Z",
                "reviewBody": "What a great dinner we had last night!  I find it difficult to rate dishes based on the way they're written here.  Invariably, this thing and/or that thing gets changed due to others' reviews etc.  But I digress....\n\nThere's another recipe here @ AllRecipes.com, Pulled Pork, that is so completely delicious I can't stand it.  Sooo, I did something similar with this beef (seasoning it a bit more since beef tends not to be as naturally flavorful):  In addition to the coffee, I added a can of beef broth to the crock pot.  This was after, however, I rubbed the entire roast with minced garlic, onion powder, kosher salt and pepper.  Every hour or so, I flipped the roast over and added another dab of kosher salt and pepper.  Throughout the day, the house smelled wonderful; at the end of the day, dinner *was* wonderful!  The meat fell apart as I hoped, so I presented it by layering it against some grilled sourdough bread, along with mashed potatoes and gravy.  The gravy was awesome!  I made it using Wondra.  Both of my sons had seconds of everything.  My husband had a third helping of the meat and gravy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandy Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1541853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T18:01:30.157Z",
                "reviewBody": "I can't believe how fantastic and easy this was! My husband HATES coffee. I have to admit I felt a little deceitful making this knowing just how much he can't stand it, but I remember my sister in law making some really fancy (and complex) roast recipe that called for coffee. Anyway, I made this, substituting jarred, chopped garlic (that's all I had) and my left over morning coffee. I sprinkled the roast with salt and pepper and let her go for 8 hours in the crockpot. When the meat was done, I made the gravy, as described, except I wanted a bit more, so I added about a cup more water and a beef bullion cube. Then salt and pepper to taste (I may have used some onion salt for the gravy). Anyway, it was WONDERFUL WONDERFUL WONDERFUL and my husband had NO CLUE it was cooked in coffee all day. I finally fessed up when he was finished. He was shocked. Will make this again and again! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOTBURRITO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1323985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-04T07:21:50.357Z",
                "reviewBody": "Very tender. Flavorful enough to be enjoyed by people who are watching their sodium intake. If not in a special diet, simply rub salt and other seasonings to taste (black pepper, onion powder, sage, thyme, red pepper, or whatever else you like). Make sure to use coffee with robust flavor (such as that of Arabica beans). Prepare the coffee as instructed on the container. Do not prepare strong coffee by ommitting water or increasing the powder -- this will only make the roast and gravy very bitter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CYBERGIFTS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/568083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T03:13:07.993Z",
                "reviewBody": "This is a great recipe! I had a smaller \ninside round roast(2.5 lbs) I took someone's advice and soaked it in redwine vinegar in a ziplock bag overnight. I forgot to rinse off the meat before cooking it and the house smelled like vinegar all morning. I seasoned he roast well with garlic powder,mustard powder,salt and pepper, and browned it for a few minutes before putting it in the slow cooker. I put 3 quartered potatoes in the bottom of the crock, used a whole head of garlic, and added about a cup of beef broth. It was ready after six hours on low. SO tender and tasty. I was worried about it being bitter or strong with the forgotten vinegar and the coffee, but it was great. The gravy wasn't a favorite. I will definately use this (modified) recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2143570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-22T16:19:22.577Z",
                "reviewBody": "I thought this would be terrible with adding coffee to a roast...boy, was I wrong.  It was great!  My children loved it...even my in-laws!! There is no coffee taste to the meat.  The meat was so tender.  I plan on using this alot for company.  Easy to fix!  Thanks for a great recipe.- DSB - Colorado",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "6534",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/147367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-18T02:44:33.517Z",
                "reviewBody": "Truly delicious! This recipe made an inexpensive cut of beef taste like it belonged in an upscale restaurant. In addition to the coffee, I added about 1-1/2 c. beef broth (made from powdered boullion), 1/2 sliced onion and rubbed roast with blk pepper and chili powder. In 6 hours we had a very tender, very tasty dinner. I used the liquid to make gravy and served with garlic mashed potatoes, corn and homemade bread--how much more of an all-American meal can you get? Tomorrow the leftovers will become tacos to honor the hispanic side of my heritage :-) Thanks for the terrifically easy and tasty recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri Carrillo-Fox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stayhomecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-13T01:52:44.5Z",
                "reviewBody": "I wish I could give a recipe no stars will not make this again EVER.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "EmilyStrange",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1492892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-05T20:53:39.92Z",
                "reviewBody": "The garlic was a little over the top for me but overall this was a good recipe. If the coffee evaporates too much you will get a burned flavor. Dilute the juices if this happens before making the gravy and add a teaspoon or two of sugar to counteract the bitterness. Prevent this from happening by occasionally adding water or beef stock to your pot while cooking. Good recipe good flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "flowersandcandy4me",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688484/"
                }
            }
        ]
    }
]