[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14729/soups-stews-and-chili/chili/beef-chili/",
                    "name": "Beef Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16276/chili-i/",
        "name": "Chili I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F109157.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-01-24T00:16:50.000Z",
        "description": "Thick and spicy chili. Coffee and beer give this chili a unique and dynamite flavor. Garnish with shredded cheese and diced chile peppers.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "2 onions, chopped",
            "3 cloves garlic, minced",
            "1 pound ground beef",
            "¾ pound beef sirloin, cubed",
            "1 (14.5 ounce) can peeled and diced tomatoes with juice",
            "1 (12 fluid ounce) can or bottle dark beer",
            "1 cup strong brewed coffee",
            "2 (6 ounce) cans tomato paste",
            "1 (14 ounce) can beef broth",
            "½ cup packed brown sugar",
            "3 ½ tablespoons chili powder",
            "1 tablespoon cumin seeds",
            "1 tablespoon unsweetened cocoa powder",
            "1 teaspoon dried oregano",
            "1 teaspoon ground cayenne pepper",
            "1 teaspoon ground coriander",
            "1 teaspoon salt",
            "4 (15 ounce) cans kidney beans",
            "4 fresh hot chile peppers, seeded and chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large saucepan over medium heat. Cook onions, garlic, ground beef and cubed sirloin in oil for 10 minutes, or until the meat is well browned and the onions are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the diced tomatoes with juice, dark beer, coffee, tomato paste and beef broth. Season with brown sugar, chili powder, cumin, cocoa powder, oregano, cayenne pepper, coriander and salt. Stir in 2 cans of the beans and hot chile peppers. Reduce heat to low, and simmer for 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the 2 remaining cans of beans, and simmer for another 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Beef Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ROBTX99"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.648556876061121,
            "ratingCount": 1767,
            "itemReviewed": "Chili I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.4 calories",
            "carbohydrateContent": "65.3 g",
            "cholesterolContent": "57 mg",
            "fatContent": "16.1 g",
            "fiberContent": "17.6 g",
            "proteinContent": "32.4 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "1413.6 mg",
            "sugarContent": "22.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:29:44.297Z",
                "reviewBody": "As a side note, I always chuckle when people rate a recipe without first trying it \"as-written\" and then say it isn't good. With this recipe in particular, following the instructions at least once is lesson in learning you won't regret. We were very impressed with this chili.  We did make it as written, the only variable being the \"dark beer\" we selected (since the recipe doesn't specify a brand).  We chose not to use Guiness and used a locally brewed dark that's a bit less sweet since previous reviews had suggested that the recipe had too much sugar. I'd have to agree.  Next time we make it (and it was good enough that there will be a next time!), we'll cut back on cocoa and just a bit on the sugar, as other reviewers suggested.  That said, as-is, it's an excellent recipe. I strongly encourage you to make it exactly as written first, so you know what adjustments you need to suit your taste--it's not \"too\" anything--it has a nice mix of sweet and spice and it's hard to say how much you'll need to adjust to suit your taste.  The balance of flavors is really quite impressive. In other regards, the texture, consistency, and ratio of meat & beans is just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:29:15.89Z",
                "reviewBody": "I made this recipe for an informal chili \"contest\" among friends and was disappointed that the flavor was too sweet.  However, when I pulled the leftovers out of my refridgerator the next day, the flavors had mingled and mellowed into something I can only describe as fantastic!  If you're making the chili to eat the same day, decrease the sugar, by all means.  But if you've got the time, let the pot chill; the result is well worth the wait.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVISAM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:27:24.78Z",
                "reviewBody": "absolutely amazing...I've actually been making this chili since last fall, but haven't rated it. as the weather has been a bit like fall here, it was time to bring out the famed chili recipe. three people stopped by sunday and decided to stay for dinner after sticking their fingers in the pot....they're still talking about it! I only use 1 chili pepper and 1 TBLSPN chili powder so it's not so spicy. I use guiness beer, espresso, 1 large can kidney beans, 1 large can pinto beans, and 1 small can black beans instead of entirely kidney. I teamed it with the amusement park cornbread recipe on this site...another fabulous find! thank you, thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MADISONRAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-29T23:04:03.983Z",
                "reviewBody": "Bob's was the first chili recipe I found with over 300 reviews, so I knew it must have something unique going for it.  I read the last 50 or so reviews and modifications, finding that the majority of reviewers commented on the marked enhancement of flavors when the chili was prepared a day in advance.  Being a person who likes only mildly spicy food (my forehead starts to drip) I could see that modifications to the underlying spiciness would be easy.  I like anything with beer in it (especially my stomach) and chocolate is also a favorite.  My wife responded that with these flavors, it might be more Mexican.\r\n\r\nMy recipe modifications consisted of following others' lead and mixing the type of beans (1 can kidney, black, chili and Great Northern), reducing the sugar a bit, also I substituted 3/4 # of coarsely ground beef for the sirloin. I like a thicker chili so I poured off the liquid of all but the chili beans, as they were in a \"chili sauce\" with cumin and cayenne.  I used only 2 hot chili peppers, finely chopped, and reduced the chili powder to about 2 1/2 T.  I had some Bitburger Bier and knew that it was a bit more \"hoppy\" or bitter, but I think any beer will do.  My preparation modifications consisted of mixing all but the cooked ingredients first and letting them cohabit in the frig for several hours.  I started the simmering process as I began to prepare the meat, onions and garlic, then mixed them into the simmering pot and let it carry on for a couple of hours.  Th",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PHIL THE RELUCTANT GOURMET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-12T16:34:58.39Z",
                "reviewBody": "Excellent Chili recipe. I love it because it has so much rich flavor, not just a tomato based chili flavor. The steak chunks are perfectly tender and delicious.\n\nMade this last night for the 6th time. I finally have it down with modifications. The suggestions I have are 1. Use 1\\4 cup brown sugar, I got many \"too sweet\" complaints. 2. Drain and rinse beans before adding. 3. Bump Ground beef to 1 1\\2 pounds and sirloin to at least 1 pound. 4. Use other beans besides Kidney, I split 50-50 between black and dark red kidney. 5. Add a second can of diced tomatoes.\n\nThe chili is much better the next day, my wife said it is the best batch so far. If you use 4 jalapeno peppers I think it gives a perfect medium heat on the chili.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jimmac24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1937265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T14:28:54.64Z",
                "reviewBody": "Hi Everyone. I am the original poster of this recipe. I posted it back in 2000 under the name ROBTX99, which I no longer use. I want to thank everyone for their great reviews, and suggestions. I spent a few years developing this recipe until I got just how I wanted it. I also now reduce the sugar a little at the suggestion of reviews received. Someone recently posted that this is a copy of a recipe used by Sam Adams. Not sure where that came from since this is my orignal recipe that I have been making since the 1990's. It has won numerous chili cookoffs over the years. Thanks again and ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RJACE52",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7028886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T17:41:06.217Z",
                "reviewBody": "Made this the other night for the family. I used Samuel Adams Black Lager for the beer Starbucks Christmas Blend for the coffee and homemade veal stock I keep on hand for the beef broth. I also used half kidney beans half black. I used four different peppers that looked good in the market at the time. In this case 1 Anaheim 1 Serrano 1 Jalapeño and 1 Poblano--these are mostly on the less hot side of the Scoville scale. People when the recipe calls for \"hot chile peppers\" you're not going to find them in the market marked as such there are MANY kinds of chile peppers and the ones you choose will make your recipe more or less hot. For example if you replaced Habanero for the Anaheim in the peppers I used you'd have a MUCH higher heat content. It turned really well. My wife--not a big chili fan--loved it. I used the full brown sugar and liked the sweetness. I would recommend trying it full sugar first to see if you prefer it that way. It starts out sweet and the chili peppers kick in as an after-taste. Served it with cheddar corn bread and the leftover beer and it was a big hit. The next day it was even better as the flavors come together and sirloin really tenderizes while marinating in the chili overnight. My only complaint is that it had too many beans. But that's a personal preference. Next time I'll cut the beans in half and add more meat instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eMarkM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1658970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:32:23.31Z",
                "reviewBody": "This chili is awesome!!!!! The sweetness balances out the spiciness; the spiciness brings out the sweetness. A perfect combination. This recipe was such a hit!! I was a bit skeptical about some of the ingredients and had to put a little into buying the spices but ohmigod is it worth it! I used just ground beef and also wasn't sure which peppers to buy so I used the ones labeled \"long hot peppers\" which added only a green pepper flavor. Absolutely DO NOT leave out the cayenne pepper!!! I did the first time and it was okay just a little blah. My second batch I added the cayenne and WOW what a difference. Probably could leave out the cayenne if you used hotter peppers like jalapeno or serrano etc. This recipe is a definite \"keeper\" and is definitely worth the extra prep work and buying the extra spices that I didn't have on hand. I will definitely be making this chili again. I usually hate chunks of vegetables but it all cooks down together and is soooo good! The addition of coffee cocoa and dark beer \"scared\" me at first since i don't like beer and had never used coffee and cocoa in anything other than desserts but NO WORRIES MON. Don't be scared. This stuff is awesome exactly as the author wrote it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tingleylover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/341664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:27:10.077Z",
                "reviewBody": "The thing I regret most about this recipe is that I HAD to sample it before serving and then I was too full by dinner time! I did on the other hand watch my husband go back again & again! I browned the ground beef & sirloin drained it & threw it in the crock pot for 7 hours (it was still sweet after about 4 hours so I let it keep going). I will add a little more \"heat\" next time (we like it hot & the kids eat my regular version). Thanks Bob!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-14T22:59:33.757Z",
                "reviewBody": "Absolutely horrid!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARLEY76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/703193/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chili I",
            "description": "Coffee and beer give this thick, spicy, beefy chili loads of flavor.",
            "uploadDate": "2014-05-01T19:05:43.637Z",
            "duration": "PT2M37.09S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe540d792-f12d-49f4-9cb1-15da0532392e%2F5598a6de-88d0-4be1-bb37-84b6f60a2909%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3527939992001"
        }
    }
]