[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17158/desserts/chocolate/milk-chocolate/",
                    "name": "Milk Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15821/aunt-teens-creamy-chocolate-fudge/",
        "name": "Aunt Teen's Creamy Chocolate Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4104013.jpg",
            "width": 3648,
            "height": 3648
        },
        "datePublished": "2000-01-24T23:19:15.000Z",
        "description": "This was my aunt's recipe for fudge, passed down through the family. It's better than any fudge I've ever had at the Jersey shore, and easy enough to whip up in 15 minutes or so.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "3 pounds",
        "recipeIngredient": [
            "1 (7 ounce) jar marshmallow creme",
            "1 ½ cups white sugar",
            "⅔ cup evaporated milk",
            "¼ cup butter",
            "¼ teaspoon salt",
            "2 cups milk chocolate chips",
            "1 cup semisweet chocolate chips",
            "½ cup chopped nuts",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line an 8x8 inch pan with aluminum foil. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, combine marshmallow cream, sugar, evaporated milk, butter and salt. Bring to a full boil, and cook for 5 minutes, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and pour in semisweet chocolate chips and milk chocolate chips. Stir until chocolate is melted and mixture is smooth. Stir in nuts and vanilla. Pour into prepared pan. Chill in refrigerator for 2 hours, or until firm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Milk Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kelly Phillips"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6053061224489795,
            "ratingCount": 2450,
            "itemReviewed": "Aunt Teen's Creamy Chocolate Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "123.6 calories",
            "carbohydrateContent": "18.2 g",
            "cholesterolContent": "5.1 mg",
            "fatContent": "5.5 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "26.1 mg",
            "sugarContent": "12.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-11T23:05:06.25Z",
                "reviewBody": "***PLEASE READ IF YOU ARE HAVING TROUBLE WITH CRUMBLY, GREASY FUDGE!*** I've used this recipe probably 50 times, and I've had it not turn out twice.  The first time I used generic marshmallow cream.  I don't recommend using any store brand ingredients in this fudge.  The second time I used an enameled cast iron french oven, and it didn't turn out that time, either.  Every time I use my calphalon, it turns out great.  Also.....work fast!  The faster the better.  Don't start timing until the mixture is at a full, rolling boil and then reduce the temperature slightly so that it doesn't scorch.  Stir the entire five minutes and have the chocolate chips measured out ahead of time so you can dump them in as soon as you turn off the heat and stir like mad.  Get the chips fully incorporated and pour immediately.  It never fails!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "attilaskitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1894951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-10T21:02:05.843Z",
                "reviewBody": "Absolutely incredible fudge! It is perfectly smooth, creamy, chocolately, and all-around enjoyable. Try putting the marshmallow creme in the microwave for about 15 seconds before adding it to the pan; it will come out of the jar much easier. Though the cooking experience would have been less stressful with one, a candy thermometer really isn't necessary. One tablespoon of butter is just the right amount, and boiling the mixture for around 7 minutes instead of five can assure that the fudge will solidify. Some found that the recipe was a bit too sweet, so taking out 1/4 cup of sugar can tame some of the super-sweetness. Finally, using 2 cups of the semisweet chips and 1 cup of the milk chocolate chips instead of the other way around can make an even richer fudge (especially for those dark chocolate lovers like me). It is THE BEST fudge recipe around, and I am sure that I will make it again and again for years to come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adam M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1011677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T21:56:19.53Z",
                "reviewBody": "This was my first time to make fudge and it turned out great!  Many people at my dessert buffet said that it was the best fudge they had ever had.  It was so creamy - not grainy at all.  I have to say, though, that I messed up the first time I tried it.  Because I had the marshmallow creme in the very bottom of the pan and I got the heat too high too fast, I burned the marshmallow creme into hard brown chunks!  The second time, I kept the temperature at low until it was mixed up well and then I turned the heat up to medium and boiled it.  That worked like a charm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AFINNEY23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/719629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T04:50:57.873Z",
                "reviewBody": "Basically, this represents a terrific, 5-star fudge recipe; I would tweak the instructions, though.  First, cook for 6-1/2 minutes, because at 5 minutes, it really needs to be kept in the fridge to maintain the right texture.  If you DO prefer the super-creaminess of the 5-minute cooking time, then it will be far less \"melty\" if, after refrigeration, you cut it into squares and let the squares \"air-harden\" on racks or trays until the sides are not tacky.  (Obviously, this is kind of a pain, so I go with the 6-1/2 minutes!)  And finally: This is too much butter.   1 tablespoon works well, and the butter can actually be left out completely if you like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CONNIELUNA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-25T19:28:48.313Z",
                "reviewBody": "OMG! You really don't need another review to tell you how creamy this fudge is! I do want to offer you some tips in making fudge as it was passed along to me and it does make a difference. Do NOT substiute butter for margarine. Margarine has a higher water content and it will disturb the balance in fudge making. As well, you should also use whole evaporated milk. I found using 2%, 1% or fatfree evaporated milk, I don't get the absolute best results as i do with whole evaporated milk. I start out stirring until well blended on low heat first so that the sugar is completely disolved. This will prevent grainy texture. I've also been told not to make fudge in high humidity or rainy days as the moisture causes the fudge not to set as well which i guess i find that to be true today as it is raining and humidity is slightly high. Therefore, i do find this fudge is too soft. They say making fudge is very moody. This is the best recipe and will be a keeper in my family.  Thanks for sharing this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori from CT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1502158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T14:02:09.043Z",
                "reviewBody": "Coincidentally, a recipe very close to this is on the back of the Marshmallow Fluff jar.  My daughter and I made it last night.  The secret is to use a candy thermometer to be sure the fudge reaches the soft ball stage (234 degrees).  Ours didn't reach temperature until well after five minutes boiling time, possibly because we kept the flame low to prevent burning.  (Using a double boiler, as someone here suggested, is a great idea; we may try that the next time we make this.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HSMOM26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-22T01:51:33.13Z",
                "reviewBody": "My mother used to make fudge every Christmas, and although I wanted to carry on that tradition the traditional fudge recipes were all so hard, and never seemed to turn out well. I tried this recipe last year, and not only was it quick and super easy, the fudge tasted spectacular! I made 3 kinds (just like Mom!), chocolate fudge with nuts, chocolate mint fudge (added mint extract) and butterscotch fudge with pecans (used butterscotch chips instead of chocolate). My family loved all three kinds, but the butterscotch was rated the best. Thank you Kelly for sharing this recipe! Now I can carry on the tradition of delicious fudge for Christmas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEATHERHIPPO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-16T16:18:49.153Z",
                "reviewBody": "Chocoholics Beware! This stuff is highly addictive! Sinfully rich, decadent, and creamy are just a few of the words that come to mind when describing this fudge. It's so good and so easy to make.  I did cut the sugar back by 1/4 cup and used a non-stick pan which I highly recommend. Bring this to a boill slowly, stir constantly and you should have no problems. I lined my 8x8 pan with Reynolds non-stick foil and it came out perfect. This recipe is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T22:48:34.827Z",
                "reviewBody": "I made this for 3 years now - let me tell you - THANK YOU AUNT TEEN - she rocks whoever she is.  everyone loves the fudge - i have made a couple changes over the years (sorry auntie) but try this:\r\n\r\ninstead of 1/2 cup of semi-sweet - use 1 cup \r\n(it removes some of the buttery/greasy)\r\n\r\nnuke the mallow for 10 seconds first - it will come out of the jar easier!!!\r\n\r\nand my absolute favorite addition is this: replace the semi-sweet with gharardelli chocolate choclate chips\r\n\r\nHEAVEN - \r\n\r\nthanks again! this was great!!! and i agree with everyone else's ideas -must cook longer than 6 minutes until nice brown and YES LOW HEAT - med heat got out of control (i have gas stove) and got really greasy \r\n\r\nhappy holidays!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEGGREEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751672/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Aunt Teen's Creamy Chocolate Fudge",
            "description": "See how to make rich, quick-and-easy fudge.",
            "uploadDate": "2012-06-21T00:27:19.706Z",
            "duration": "PT2M45.04S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F44aa0470-0aa8-4530-bb1b-c09bae808dce%2F5e97e89c-85f9-415a-8e6c-adacd8f36305%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1699346895001"
        }
    }
]