[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16244/savory-bubble-bread/",
        "name": "Savory Bubble Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F964758.jpg",
            "width": 1936,
            "height": 1940
        },
        "datePublished": "2000-01-25T05:04:39.000Z",
        "description": "This is a tender bread which is mixed in a bread machine but baked in the oven.  It is known by several different names including Bubble Bread and Monkey Bread.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 - 1 pound loaf",
        "recipeIngredient": [
            "1 egg, beaten",
            "2 tablespoons butter, softened",
            "½ cup water",
            "½ cup milk",
            "1 teaspoon salt",
            "1 tablespoon white sugar",
            "2 ½ cups bread flour",
            "1 (.25 ounce) package active dry yeast",
            "¼ cup butter, melted",
            "1 teaspoon paprika",
            "¼ cup grated Parmesan cheese",
            "½ teaspoon garlic powder",
            "1 teaspoon dried minced onion",
            "½ teaspoon rubbed sage",
            "½ teaspoon dried tarragon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Measure the egg, 2 tablespoons butter or margarine, water, milk, salt, sugar, bread flour and yeast into dough pan according to manufacturer's directions. Select Dough setting, then Start. When unit signals and display reads 0:00, press Stop and remove dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place melted butter or margarine in a small bowl. In a separate small bowl mix together the paprika, cheese, garlic powder, onion flakes, sage and tarragon. Cut prepared dough into 20 to 25 pieces and roll in butter or margarine then in savory rolling mixture. Stack coated dough pieces in a lightly greased Bundt pan or 9x3 inch tube pan.  Cover with a damp cloth and let rise 30 minutes or until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes or until golden. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUSANNECS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.517241379310345,
            "ratingCount": 116,
            "itemReviewed": "Savory Bubble Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "215.4 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": "39.6 mg",
            "fatContent": "8.9 g",
            "fiberContent": "1.1 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "325.4 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:55:30.403Z",
                "reviewBody": "Very good!!  When my dough was done and I went to make the balls, it totally collapsed into a gooey pile, but I still dipped the wads in the butter, and then in my herbs and parm, and after I let it rise it looked like real dough again.  In the end it was perfect!!  Tasted great, my whole family loved it.  Just don't worry if it looks like it flopped, it will come out OK in the end.  WONDERFUL!!  Thank you, Susanne!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLBeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/106147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T16:38:09.777Z",
                "reviewBody": "I just baked this tonight for the first time (and pretty much only my 2nd time to ever make bread) and it was brilliant. I always tweak recipes, and I dont have a breadmaker, so I started off with warming the water, mixing in the sugar and sprinking the yeast over to foam/cream for a while, before mixing in the rest of the ingredients to make the dough, kneading and allowing to rise for 30min. Then following with breaking off hunks and dipping in the butter, mixed herbs minced garlic etc, and putting in the pan, and again allowing to rise before baking. I also probably had closer to 2 cups of flour as the dough was a bit sticky, and it was still sticky ish but probably easier to handle after that. Oh and I don't really measure my seasonings so they were probably 2x the recipe. The result was beautiful soft bread with a nice hint of garlic and subtle herb flavours, and cheese and tomato that i sprinkled on top. It had a lovely thin crust, and broke apart easily.   Thank you for this wonderful idea! I plan to use the base of the recipe for sweet bread and different savoury flavour combos, as well as a basic white loaf.  Hope for people who dont have breadmakers! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A.Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3960973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:55:30.467Z",
                "reviewBody": "This was a huge hit at the dinner table! This wonderful bread accompanied our Valentine Meal. The Kids loved pulling thier piece of bread apart from the bread ring. We all loved the taste too!! My bread machine did the hard work while I prepared the other parts of the meal. This is permanently in my recipe box!! Thank YOU!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FERBONIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:55:30.873Z",
                "reviewBody": "This is a great recipe! It is easy to make and so delicious. You can add other spices/herbs to suit your taste. Be prepared for the compliments. Thanks Susanne for this wonderful addition to my recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANITA21042",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T15:29:02.653Z",
                "reviewBody": "These were sinfully amazing. I changed it up a bit. After I pulled the dough from the pan I kneeded flour into it as it was too sticky. Then I preped 1/4 cup butter melted 6 cloves minced garlic fresh diced rosemary and about 1 heaping tsp of thyme in a bowl. I dipped the bread pieces in there and put them in a 9x13 pan. After I basted on the remainder of the mixture adding 1 leaf of rosemary to the top of each. Then I grated parmesian and cheddar and sprinkled it ontop prior to baking. My fiance ADORED THEM. They were awesome! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALISONINONTARIO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1457920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-21T00:05:00.577Z",
                "reviewBody": "My family really likes this recipe. It is especially fun for my teenage girls to make since it is so uncomplicated. I would change one thing though which makes it a lot easier. We melt the 1/4 butter and then add the cheese and herbs to the same bowl. That way we only have to dip the dough balls in one bowl and the herbs & cheese are distributed much more evenly through the bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARDARAMIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1374023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:55:29.78Z",
                "reviewBody": "This recipe was okay but it didn't blow me away. I will stick to the sweet version of bubble bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "aeposey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-19T02:47:49.463Z",
                "reviewBody": "Wow!!! My hubby absolutely loved this bread his friends too. I used an angel food pan and it came out looking like it came from a fancy bakery. I used crushed garlic right in the melted butter. The first time I made this I mixed the herbs with the butter and ended up needing more the butter soaked into the herbs. The second time I rolled them in butter then in the herb mixture and they were quite messy and I got a bit too much herb on the balls cause they were so wet. Next time I will mix the herbs with the butter and make a bit extra it seemed to go on more evenly. I used freshly grated parmesan cheese and sprinkled it over each layer both times and it was really nice. I used shredded cheddar the second time(sprinkled between layers) mmmmm it was really good. I didn't have the herbs called for so I just made a mixture of oregano basil parsley and dehydrated onion. This bread was so much fun to pull apart and eat. We had it with baked spagetti and also with beef stew. I bet it would be good to do this with butter brown sugar and cinnamon maybe a Christmas morning treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bakingmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2052399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T18:26:45.523Z",
                "reviewBody": "This bread made such a good impression on my family. Like most other reviews I found the dough to be incredibly sticky once it came out of the bread maker. I kneaded it with a little more flour to make it a bit easier to handle. I used my own Italian herbs minced garlic and Parmesan cheese for the topping I added this to the melted butter which meant I only had to dip the dough once. Next time I think I am going to try using olive oil rather than butter which I think is more traditional with the toppings I used. The bread was very easy to make looked great and tasted amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheBritishBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/apple-strudel/"
                }
            }
        ]
    }
]