[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16092/aunt-fannies-dinner/",
        "name": "Aunt Fannie's Dinner",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7231892.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-01-27T22:23:41.000Z",
        "description": "A quick and easy dinner. This goes great with garlic bread and a salad.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup uncooked elbow macaroni",
            "1 ½ pounds ground beef",
            "½ onion, chopped",
            "1 teaspoon garlic powder",
            "salt and pepper to taste",
            "1 (8 ounce) can tomato sauce",
            "1 cup stewed, diced tomatoes",
            "1 (15 ounce) can whole kernel corn, drained"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and saute for 5 to 10 more minutes. Season with garlic powder, salt and pepper to taste. Add the tomato sauce, stewed OR diced tomatoes, corn and cooked macaroni. Stir well and allow to heat through, about 5 to 7 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Diane Schwenke"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8875,
            "ratingCount": 240,
            "itemReviewed": "Aunt Fannie's Dinner",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "317.6 calories",
            "carbohydrateContent": "25.7 g",
            "cholesterolContent": "68.9 mg",
            "fatContent": "14.3 g",
            "fiberContent": "2.9 g",
            "proteinContent": "23.2 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "564.3 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:07:21.013Z",
                "reviewBody": "Good stuff but I added some ingrediants which I am sure improved this recipe a great deal: used 1lb of ground beef, 8oz noodles, 15oz can of tomato sauce, 1Tbls of worchestershire sauce, 1Tbls brwn sugar, 2tsp of chili powder and apprx 8ox shredded cheddar cheese mixed in to melt. I think perhaps next time, I'll add some mushrooms or green peppers. The extra noodles gave this more substance, the increased tomato sauce made this not so dry and the additional spices gave this a mild kick. Other than those additions/changes, I did follow the recipe (kept the corn, garlic powder etc...) This is a recipe that is very easy to adjust to your tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22503515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-14T01:50:58.34Z",
                "reviewBody": "I really want to give this recipe 4 stars because of it's simplicity and the fact that it is a good 'base,' but it's very bland for my own tastes. Especially if you're using tomato sauce from the can, spices need to be added or else it has that 'metalic' taste to it. I browned my beef with the recommended amount of onion and added some diced green pepper and minced garlic.  I also left out the corn. Then I added more garlic powder, sea salt, pepper, an Italian seasoning bland (about a teaspoon), paprika, and a few pinches of sugar. Then I added the cooked pasta (used shells, and way more than the half cup), and added fresh diced tomatoes. I let that simmer for about five minutes then transferred the mixture to a baking dish and topped with large tomato slices and mozzarella cheese.  I baked it at 350 for about 25 minutes.  Turned out great this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Bakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-03T04:40:42.653Z",
                "reviewBody": "I loved this recipe. It was quick easy and tasted wonderful. I added a can of tomatoes with green chilis and a little chili powder. Kids think it is great too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/116113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-26T18:05:07.373Z",
                "reviewBody": "We just made this last night and it was really good and very quick. I did make changes though. I didn't have ground beef so I used ground pork. I used Sun Dried Tomatoe Sauce (as it already has big chunks of tomatoe in it so I wouldn't have to use the stewed tomatoes) I added purple onion (becauce I find them sweet and flavorful) I also used a few dashs of Franks Red Hot Chicken Wing Sauce a few Tblp Brown Sugar and a few dashs of Black Bean sauce as well as lots of garlic. Basically I made my usual Spahgetti sauce. (I didn't use any corn because that sounds a little strange to me!) I used Rotini instead of maccaroni because I find that the sauce sticks better to it. I then assembled it like a casserole. A layer of cooked pasta half the meat sauce a layer of grated aged cheddar cheese repeat. I then baked it at 350 for about 25 mins till it was all hot and bubbly and melted. Very yummy!!! We had it with ceasar salad and fresh french bread. Mmmmm! My boyfriend had 3 helpings and ended up moaning on the couch uncomfortably full. LoL I'll deffinetly make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey Wolnowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-18T21:42:49.2Z",
                "reviewBody": "Tired and un-inspired I logged on to find a recipe that would use up the ground turkey I had and that didn't require a trip to the store. Your recipe filled my requirements so we had it last night for dinner. Everyone enjoyed it but I think my food snob hubby actually liked it the best. This is not our usual fare but it was very yummy and just what we needed last night. I tripled the noodles called for and added more tomato sauce because of that thus lowering the meat per serving ratio. I omitted the corn just because I wasnt in the mood but would try it in the future. This was a very simple recipe fast and easy thank you for sharing. Bunny Foo Foo",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BUNNY_FOO_FOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-05T23:54:53.31Z",
                "reviewBody": "although this was a quick and easy recipe it was very bland and did not have much taste the corn did not go with it either. SORRY! i do not reccommend this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISSA TY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-31T19:34:58.107Z",
                "reviewBody": "I used a 28 oz can of diced tomates and added about 1/2 a can of water and put the uncooked pasta (shells work well)with all the other ingredients then I cooked it until the pasta was cooked put in a casserole dish and sprinkled cheese on the top. MMMMMMMMMMMM delicious even my brother who hates everything loved it I left out the corn and had a salad on the side instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISS ALLI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/916900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-12T16:52:12.953Z",
                "reviewBody": "You know what? This exceeded my expectations and turned out to be a very satisfying meal. I have a very empty pantry right now and just trying to make do with what I have I stumbled upon this recipe. I pretty much followed it up to the end aside from using ground turkey in place of the beef but once I tasted it I NEEDED to add something. Chose chili powder cumin and a dash or two (maybe even three) of hot sauce and finished it off with a Mexican cheese blend. Was great - thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chikee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2111971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-27T18:42:17.043Z",
                "reviewBody": "A good simple easily customizable recipe for days where you just don't feel like spending alot of time and energy in the kitchen. I doubled the elbows halved the ground beef added 2 cloves minced garlic used seasoned pepper Italian seasoning brown sugar a splash of White Wine Worcestershire cayenne and doubled up on the tomatoes and sauce. Didn't add the corn. We actually enjoyed this dinner very much with the suggested garlic bread and a salad. Thanks Diane!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "~TAYLOR~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969942/"
                }
            }
        ]
    }
]