[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16010/roasted-red-pepper-chicken/",
        "name": "Roasted Red Pepper Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54208.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2000-02-03T19:04:18.000Z",
        "description": "This recipe is rich, but very delicious, and the red makes it festive. It is best served with asparagus and lots of love. Please enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breasts",
            "1 (12 ounce) jar roasted red bell peppers",
            "2 cups bread crumbs",
            "3 tablespoons vegetable oil",
            "1 cup sour cream",
            "½ cup feta cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "With a very sharp knife, cut pockets into the thickest part of the breast of chicken. Stuff as many pieces of roasted red peppers as you can into pockets of chicken one at a time. Pour bread crumbs into a large plastic bag. Place chicken breasts in the bag with the bread crumbs and shake until well coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, heat oil to a medium-high heat and place chicken in the pan. Cook for 5 minutes on one side then turn, cook for 10 minutes on the other side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While cooking the chicken,  in an electric blender blend sour cream and a few pieces of red peppers. Flip the chicken one more time and cook 5 more minutes, or until chicken is done.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the chicken in half and arrange the pieces on a plate. Drizzle with sour cream mixture and sprinkle with feta cheese.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Avery Hayden"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.368794326241135,
            "ratingCount": 141,
            "itemReviewed": "Roasted Red Pepper Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "670.5 calories",
            "carbohydrateContent": "51.6 g",
            "cholesterolContent": "121.8 mg",
            "fatContent": "33.4 g",
            "fiberContent": "2.4 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "14.6 g",
            "servingSize": null,
            "sodiumContent": "1019.1 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-19T00:58:07.193Z",
                "reviewBody": "This recipe was delicious easy and quick to make but just needed a little help. First I pounded the chicken breasts out to thin them out a little. Then I mixed some feta cheese in with the peppers and stuffed the chicken. I added a little salt & pepper to the bread crumbs. Definately use olive oil instead of veg. oil and with the chicken thinned out you only need to cook it about 7 min. on each side. As for the sauce I added a little salt & pepper a dash of garlic powder and parmesan chs and simmered it for a couple of minutes and it was much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ERINJL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1007890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-28T02:09:08.07Z",
                "reviewBody": "Nice presentation even though a little hard to keep together at first. I did not dare \"shake\" in breadcrumbs (would of fell apart) I just carefully \"rolled\" the chicken in them. I only used half of the crumbs called for. I had to use two toothpicks for each breast and then after browning they stayed together nicely. I choose to bake after browning(I poured sauce over all covered and baked for about 20 minutes) I did add some feta crumbles fresh minced garlic and a couple fresh spinach leaves to the chicken \"pocket\" along with the roasted peppers. Due to reviews I also added ground cayenne pepper and chili powder to the sour cream mixture. Loved the flavors of the roasted red pepper the sour cream sauce with the Feta (more than the chicken!) I will make this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-20T04:14:26.767Z",
                "reviewBody": "After reading all the reviews and seeing some had trouble with the recipe I decided to take a different approach. 1. I used partially thawed chicken breasts - this was much easier to handle and to slice. I sliced lengthwise and placed a small amount of the feta cheese inside then red peppers. I then placed in the fridge for 1/2 hour to defrost entirely. 2. I used buttermilk to coat the chicken (while held together with toothpicks). 3. I used panko bread crumbs seasoned with dried parsley oregano and garlic powder. 4. I browned slightly in pan in olive oil. Removed toothpicks. 5. I felt I had to bake in the oven because the chicken pieces were quite large. 350 degrees for 30 - 40 mins. Unfortunately I didn't have any roasted red peppers left to make the sauce. I used 1/8 cup of mild salsa with the sour cream. This was very good! I will definately serve this to visiting guests for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GodivaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T19:52:22.03Z",
                "reviewBody": "This recipe was ok however I disagree that it is \"full of flavour\". The red peppers give it nice but very SUBTLE flavour. (It needs more seasonings!) Perhaps adding something to both the filling and the bread crumb coating would help (Maybe even the sauce?). Cooking it in vegetable oil on the stove isn't a great idea (I used olive oil). The coating got too brown- I suggest baking it in the oven. Also the cooking times given were too long. If I had cooked the chicken for 5 min then 10 min then another 5 on med-high heat it would have been severely overdone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEN-SU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-19T01:05:54.437Z",
                "reviewBody": "This chicken was ok it wasn't half as hard to put together as I thought it would be. I slit the chicken and stuffed it with roasted peppers and secured it with two toothpicks.Then I salt and peppered the chicken and coated with breading and fried in a small amt of oil. When I made the sauce I used reduced fat Feta and reduced fat Sour cream. I added a little garlic powder and a dash of cayenne pepper to it too so that jazzed it up a bit. Then I baked it in the oven for 20 minutes or so at 350 with the sauce on it. (otherwise it never would have been fully cooked)It made a nice presentation but the chicken was kind of bland unless you had it dripping in sauce and there wasn't enough sauce to do that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVECED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1280465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:46:40.897Z",
                "reviewBody": "This dish turned out beautifully for me without any modifications. The flavor was well-balanced and not overpowering and the dish looked gorgeous when plated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BPQ01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:46:43.333Z",
                "reviewBody": "The idea was great but I did make some changes. I added feta and spinach to the stuffing as suggested also added a garlic clove to the pureed sour cream/red pepper mixture salt/pepper the chicken breaded it then put the chicken into a baking dish covered it with the sauce and baked it. Delicious. We all enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JO-KE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/862413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T17:05:03.937Z",
                "reviewBody": "I loved this but had to give it 4 because I changed the procedure quite a bit. I stuffed the chicken with the red peppers, and garlic and feta. I then brushed it with sour cream so the breadcrumbs would stick. I then baked it. I made the sauce as is but I heated it up so the texture was thinner which was better in my opinion. So delicious - even the picky veggie hating bf ate it. :) Thanks for a great base recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Raquel Teixeira",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3165226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-05T18:30:21.163Z",
                "reviewBody": "I absolutely loved this recipe although I made some changes. My husband is not a fan of red bell peppers so I substituted sun-dried tomatoes instead and it came out perfectly! Also I added a clove of garlic to the sour cream mixture and that added a little kick to it! Finally I used goat cheese instead of feta and it was just terrific! I'll definitely be making this one again and soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANIELLECOMO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/588561/"
                }
            }
        ]
    }
]