[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1977/meat-and-poultry/chicken/chicken-breasts/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17155/cheesy-chicken-pepper-pasta/",
        "name": "Cheesy Chicken Pepper Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F554343.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-02-16T18:00:49.000Z",
        "description": "A pasta recipe that incorporates chicken, red peppers, and a creamy garlic cheese sauce.  One of my successful kitchen experiments!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 pound skinless, boneless chicken breast halves - cut into strips",
            "2 red bell peppers, sliced",
            "2 cups milk",
            "½ cup butter",
            "16 ounces shredded Muenster cheese",
            "1 clove garlic, minced",
            "¼ teaspoon garlic powder",
            "2 tablespoons cornstarch",
            "1 pound linguine pasta"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, warm olive oil and add chicken; saute until it begins to turn golden brown. Add red bell peppers and cook until they become limp; cover and simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over high heat, combine milk, butter, cheese and garlic; stir constantly for about 10 minutes to avoid burning. Sauce should now have a thickened sauce-like consistency; if not, add cornstarch in 1 teaspoon increments until desired consistency is reached.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the sauce is complete, combine it with the chicken and peppers mixture; add garlic powder to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour sauce over hot pasta; serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Heidi Waun"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.076923076923077,
            "ratingCount": 39,
            "itemReviewed": "Cheesy Chicken Pepper Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "654.3 calories",
            "carbohydrateContent": "48.6 g",
            "cholesterolContent": "122.8 mg",
            "fatContent": "35.2 g",
            "fiberContent": "2.6 g",
            "proteinContent": "36.4 g",
            "saturatedFatContent": "19.8 g",
            "servingSize": null,
            "sodiumContent": "504.2 mg",
            "sugarContent": "6.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-08T16:00:56.467Z",
                "reviewBody": "THIS RECIPE IS SUPER!! For those of you who had \"chunks\" in your sauce the secret is to heat over med heat use SHREDDED muenster cheese (or shred it yourself) and STIR CONSTANTLY! I did have to thicken with a tsp of cornstarch. To avoid the \"lack of taste\" complaint when frying the chicken I diced half an onion and threw in a minced garlic clove. Along with sauting the red bell peppers I also threw in some fresh sliced mushrooms and seasoned it all with 1 tsp garlic powder (and used another tsp of garlic powder in the sauce). This recipe really delivers if you can master it. It's really not difficult but you have to pay attention to the sauce. Serve with a tossed salad and breadsticks to soak up the sauce and you have a great meal. I received praise from my entire family! Thank you Heidi for being so inventive and sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-17T14:11:24.233Z",
                "reviewBody": "This was excellent! Not to mention it made a ton of food...I changed it up a bit added green pepper onion and zuchinni two cloves of garlic instead of one (with no garlic powder) and only used half as much cheese as the recipe called for. I also used sharp cheddar instead of muenster. It was still plenty cheesy though. I also used 1% milk. I think these changes didn't affect the taste one bit and made it a little healthier. I did need to add the cornstarch and used angel hair instead of linguine. Fabulous will definitely be making it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cbaknapp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1154689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-17T21:24:02.303Z",
                "reviewBody": "I was disappointed with the outcome of this recipe. Perhaps it was because I could not obtain shredded muenster cheese and had to break slices of it up into the sauce mixture. The sauce turned out lumpy instead of smooth (is that normal?) and the taste was very bland. Even after adding lots of garlic powder the taste was still mediocre. It also seemed awkward over linguine to me. Perhaps over a wild rice would be more appropriate? The sauce mixture took far longer than 10 minutes to thicken even after adding corn starch. The chicken and pepper combination was tasty but I felt like the recipe was missing an ingredient...possibly onions or more clove garlic...something to add a little more flavor. I prepared a small portion and I didn't finish it. It was also difficult to stir the sauce mixture (which could very easily burn or stick to your pan) the chicken and pepper mixture and monitor the boiling linguine all at once. Overall not worth the hassle in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "AMBER-SAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/324701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T17:17:04.893Z",
                "reviewBody": "This recipe is really good I read on some comments that it needed more spicing so I went ahead and added my own thing. I seasoned the chicken with powdered oregano garlic tumeric and some salt. I cooked it in the skillet with leek tomato onions and red peppers. As for the sauce I used mozzarella cheese and instead of minced garlic I sliced up a clove and removed them after the sauce was done I cooked the sauce on medium heat and only needed little cornstarch. I stirred the entire time and cooked it for pretty much over 10 minutes but I got it to a perfect consistency. It turned out amazing and my fiance has requested it again for tomorrow already!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs_andersen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5630877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-19T18:00:58.16Z",
                "reviewBody": "There is very little flavor and the Muenster cheese does not lend itself to melting and becoming creamy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1570170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-07T17:26:00.277Z",
                "reviewBody": "I liked the flavor of this dish but the texture of the sauce was not smooth. It turned out very grainy I used shredded Munster cheese and the sauce thickened without adding cornstarch. I guess it was the cheese that gave the texture that it had but I'm not a fan. I think if I were to do this again I would make a basic alfredo sauce and add less than half of the Munster cheese just for the flavor. Thank you for the recipe the flavor was wonderful and different than other pasta dishes I've made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "alcockrell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2737232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-04T21:14:58.31Z",
                "reviewBody": "This is one of the first pasta recipes I ever tried from this site and I have been making almost once per month for the last 6 months! Its wonderful and I have impressed many a guest who have been over to eat dinner with me! The cheese doesn't melt easily. There will be a few small shreds of cheese that just seem impossible to melt entirely. The trick is (as another stated) to stir constantly and once it is smooth...its done. Trust me once over a bed of noodles the small clumps (if any) aren't noticable in taste or appearance. HOWEVER if you overcook the sauce (which I accidently found out once) the sauce will seperate. Be sure not to overcook!! I love this dish and am soo pleased with it I just had to add my comments!! Thank you Heidi! If you have more recipes like this pass them on!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRAVELIN GAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-06T01:11:17.873Z",
                "reviewBody": "This was a very easy recipe to make I had to make a few variations to use what I had on hand. I was in a pinch had no idea what to make that was easy I found this recipe and was really impressed. Used Mozarella cheese instead just because I had it on hand",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2634748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-15T15:44:36.907Z",
                "reviewBody": "This recipe was great!!! It reminded me of a chicken alfredo with a little kick. The only thing that I didn't like was that the sauce was a little lumpy it didn't affect the taste at all it just looked a little weird. But I will definantly make this again and try to see what I did wrong with the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Cabral",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2735260/"
                }
            }
        ]
    }
]