[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16364/tomato-bread-ii/",
        "name": "Tomato Bread II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F433360.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2000-02-17T13:42:24.000Z",
        "description": "A super savory loaf bursting with flavor!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "2 cloves garlic",
            "⅓ cup pine nuts",
            "2 ½ cups all-purpose flour",
            "1 ¼ teaspoons salt",
            "2 teaspoons baking powder",
            "⅓ cup sun-dried tomatoes packed in oil, drained and diced",
            "1 bunch green onion, chopped",
            "5 ounces provolone cheese, shredded",
            "2 teaspoons fresh rosemary",
            "¾ teaspoon coarsely ground black pepper",
            "2 tablespoons shortening",
            "2 tablespoons white sugar",
            "2 eggs",
            "1 ¼ cups buttermilk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small sauce pan, cover the unpeeled garlic cloves with water. Bring to a boil and cook garlic cloves  for 15 minutes; drain, cool, mash and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the pine nuts on a baking sheet and toast at 350 degrees F (175 degrees C) until golden, about 10 minutes; cool and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, sift together the flour, salt and baking powder. Add the chopped sun-dried tomatoes, green onions, shredded Provolone, rosemary, black pepper and toasted pine nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium mixing bowl, cream together the shortening and the sugar. Mix in the eggs, mashed garlic, reserved oil from the tomatoes and buttermilk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the shortening/buttermilk mixture to the flour mixture and stir well to combine. Pour the batter into the prepared loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 45 to 50 minutes in the preheated oven, or until a toothpick inserted into the center of the loaf comes out clean. Cool in the pan for 5 minutes and then turn onto a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stinger"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.166666666666667,
            "ratingCount": 12,
            "itemReviewed": "Tomato Bread II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "220.8 calories",
            "carbohydrateContent": "26.6 g",
            "cholesterolContent": "40.2 mg",
            "fatContent": "9 g",
            "fiberContent": "1.6 g",
            "proteinContent": "9.1 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "477.4 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-16T14:46:42.573Z",
                "reviewBody": "While I do have some criticisms of the recipe itself they so pale in comparison to the actual bread that I can't bring myself to dock this recipe a star for them. If the ingredients in this recipe appeal to you to begin with you've GOT to make this bread. So as the 1st reviewer some helpful tips. I couldn't see boiling the garlic for 15 minutes. It wastes 15 minutes and it wastes a lot of garlic flavor into the water. So I mashed it with the salt called for with the back of my chef's knife into a paste. The pine nuts can be quickly toasted in the microwave - it just takes a minute or two. But here's my main criticism: the recipe directs you to include the oil you've drained off the tomatoes. Now how much is that? Waaay too vague and the amount of oil used could make or break this bread! So rather than trying to guess at how much that should be and rather than the 2 T. shortening I simply did away with both and used a quarter cup of olive oil and called it a day. It was perfect. I didn't have provolone so I used another semi-firm cheese ricotta salata and a couple of tablespoons of freshly grated Parmigiano-Reggiano. A \"bunch\" of green onions is also vague so I chopped up just the green part and added it to my liking. I threw in some black olives because I had some already opened and because I knew they'd be a great addition. Finally I brushed the warm baked bread with melted butter. Golden crust hearty dense and robustly flavorful - this bread is a beauty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-15T19:56:05.14Z",
                "reviewBody": "VERY GOOD! I also chose to replaced the shortening and reserved oil with olive oil. I opted not to boil the garlic and just grate it finely w/ my microplane and used asiago cheese instead of the provolone. This was simple to prepare and the house smelled amazing while it was baking. This bread did not disappoint tasty moist and delicious! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T18:51:57.547Z",
                "reviewBody": "Unbelievable! Everyone loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen Quetin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4578048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-27T21:49:27.067Z",
                "reviewBody": "I made half of this recipe and used a mini loaf pan that I have which worked well. I did as the other reviewers using olive oil eyeballing the green onions and making a paste with the garlic and salt. I had high hopes for this bread but frankly I was a little disappointed. It didn't quite have the pizzaz I was expecting. I'm thinking I would have liked it better with roasted red pepper rather than the sun-dried tomatoes but then I guess it wouldn't be tomato bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-24T19:55:23.29Z",
                "reviewBody": "Absolutely WONDERFUL! This recipe was very easy to follow and produces a very delicious treat with Italian entrees. The loaf was colorful flavorful and I really wouldn't change a thing- it's quite perfect the way it is! Some observations: On the tomato instruction I would add: \"Diced reserving oil for later\"; and a descriptive word for the \"batter\". (Batter will be Thick Lumpy Like Dough etc...) As I wasn't sure if it was the right consistency- mine did come out thick/ lumpy but turned out PERFECT when baked in the stoneware breadpan! I also served it with seasoned Olive Oil for dipping- and it disappeared quickly!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hockeystyx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4810315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-29T23:32:57.997Z",
                "reviewBody": "I made this gluten free... 1 1/2 c. Bobs (GF) all purpose flour 1 c. Bobs rice flour 1 tsp. Xanthan Gum 1 1/4 tsp. sea salt 2 tsp baking powder 1/2 c. sun dried tomatoes 5 oz. cubed provolone 1 tsp. minced garlic 3/4 tsp. Pepper 2 Tbs. Shortening 1/8 c. oil (I forgot to save it from tomatoes) 1/4 c. plain yogurt 2 Tbs. Sugar 1 1/4 c. Buttermilk I basically followed the original instructions just subbed the flour removed a few ingredients I didnt have on hand and added a little moisture (extra shortening yogurt) and xanthan gum. It turned out amazing. I had made this recipe before we were gluten free and loved it. This was honestly just as good. Yay!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jaimee1047",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3217795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-14T02:54:12.357Z",
                "reviewBody": "This was absolutely delicious!! I did make a few changes from reading the other ratings. I also substituted ingredients to use what I already had in the house. To save time I didn't cook the garlic; I just grated it. I left out the green onions but put in green olives. I used mozzarella cheese instead of provolone. I also left out the shortening and oil from the tomatoes and used 1/4 cup olive oil as someone else suggested. You can pretty much do whatever you want and I think it will turn out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Toebbe Fuller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-04T23:54:44.833Z",
                "reviewBody": "Hmm I was expecting this to be really great with the reviews. It just kind of reminded me of an Italian seasoned beer bread. I followed the advice of the reviewer Naples for the most part plus I left out the pine nuts because I didn't have any and subbed about a Tblsp. of minced onion for the green onion. I had a feeling with the ingredients that it would be similar to a beer type bread but decided to give it a try anyway. It was sweet tasting dry and spices and flavorings just didn't go in my opinion. It really sounded interesting but after a couple of slices it sat and got tossed and I really dislike any food waste. There was nothing I could really turn it into with all of the spices tomatoes and garlic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            }
        ]
    }
]