[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19644/moussaka/",
        "name": "Moussaka",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F01%2F876056.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo by LYNNINMA"
        },
        "datePublished": "2000-02-19T21:47:22.000Z",
        "description": "Here is a great recipe for moussaka, a Greek dish. It includes sliced eggplant baked in a ground beef sauce and then smothered in a thin white sauce.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 - 9x13 baking dish",
        "recipeIngredient": [
            "3 eggplants, peeled and cut lengthwise into 1/2 inch thick slices",
            "salt",
            "¼ cup olive oil",
            "1 tablespoon butter",
            "1 pound lean ground beef",
            "salt to taste",
            "ground black pepper to taste",
            "2 onions, chopped",
            "1 clove garlic, minced",
            "¼ teaspoon ground cinnamon",
            "¼ teaspoon ground nutmeg",
            "½ teaspoon fines herbs",
            "2 tablespoons dried parsley",
            "1 (8 ounce) can tomato sauce",
            "½ cup red wine",
            "1 egg, beaten",
            "4 cups milk",
            "½ cup butter",
            "6 tablespoons all-purpose flour",
            "salt to taste",
            "ground white pepper, to taste",
            "1 ½ cups freshly grated Parmesan cheese",
            "¼ teaspoon ground nutmeg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lay the slices of eggplant on paper towels, sprinkle lightly with salt, and set aside for 30 minutes to draw out the moisture. Then in a skillet over high heat, heat the olive oil. Quickly fry the eggplant until browned. Set aside on paper towels to drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, melt the butter and add the ground beef, salt and pepper to taste, onions, and garlic. After the beef is browned, sprinkle in the cinnamon, nutmeg, fines herbs and parsley. Pour in the tomato sauce and wine, and mix well. Simmer for 20 minutes.  Allow to cool, and then stir in beaten egg.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the bechamel sauce, begin by scalding the milk in a saucepan. Melt the butter in a large skillet over medium heat. Whisk in flour until smooth. Lower heat; gradually pour in the hot milk, whisking constantly until it thickens. Season with salt, and white pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange a layer of eggplant in a greased 9x13 inch baking dish. Cover eggplant with all of the meat mixture, and then sprinkle 1/2 cup of Parmesan cheese over the meat. Cover with remaining eggplant, and sprinkle another 1/2 cup of cheese on top. Pour the bechamel sauce over the top, and sprinkle with the nutmeg. Sprinkle with the remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour at 350 degrees F (175 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PEGGY AYSCUE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.433789954337899,
            "ratingCount": 657,
            "itemReviewed": "Moussaka",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "567 calories",
            "carbohydrateContent": "29.1 g",
            "cholesterolContent": "123.1 mg",
            "fatContent": "39.4 g",
            "fiberContent": "5.4 g",
            "proteinContent": "23.6 g",
            "saturatedFatContent": "18.3 g",
            "servingSize": null,
            "sodiumContent": "1017.4 mg",
            "sugarContent": "14.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-23T02:50:33.423Z",
                "reviewBody": "Fantastic! with a few modifications as follows.\n\ndon't fry the eggplant: brush a little bit of olive oil & cook them in a oven at 450 till moderately soft...you don't want mush...\n\nbechamel sauce:  I don't get why everyone is saying this makes too much sauce?!  It doesn't, trust me.  You want at least an inch high layer of this when it's done cooking, so use the ingredients as written.  I do agree with adding the extra eggs.  I made the sauce as directed, then as it cooled I added two eggs yolks one at a time, blended that, then I added the 2 egg whites (which I had first beaten till stiff with a mixer).  Next time I might try the 3rd egg as some recommend for even more firmness.\n\nmeat sauce:  save calories, don't brown the beef in butter!  Increase garlic to at 2-3 cloves.  I used italian seasoning for \"fine herbs\".  Add a big pinch of sugar to cut the acidity.  I used about 1/2 tsp of salt, and 1/2 tsp fresh ground pepper.  I made the meat sauce one day ahead (to save time on the big day & to allow the flavors to come out).\n\nmysterious olive oil:  I don't know where that 1/4 cup of olive oil is supposed to come in?  I never used it.  Certainly didn't miss it.\n\nconstruction:  Use a big/deep lasgane pan.  The 9 X 13 glass pan isn't big enough.  \n\nTo be more authentic you can add a thin layer of potato in the bottom.  Peel two potatoes, slice them about 1/4 in or less slices, brush with small amount of olive oil, roast in 450 oven for about 15 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WSBLEND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1444841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-16T17:57:08.223Z",
                "reviewBody": "Having parents who lived in Greece for years, we had many variations of this dish.  The best one is using sliced potatoes as well as eggplant.  If you add 3 egg yolks to the white sauce, then beat the whites to a stiff peak and fold them in your crust will puff up beautifully.  It is wonderful.  Even my 3 year old loves it.\r\nMirrisa, San Angelo TX",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MIRRISA2003",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/798897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-21T17:10:15.53Z",
                "reviewBody": "Superb!  I live in Greek Cyprus and this recipe is exactly what I was looking for.  I wanted to cut out the extra cup of fat from the olive oil and butter so I broiled the eggplant until browned with olive oil sprayed on top & bottom of thin slices.  Diminished the cinnamon & nutmeg to 1/8 tsp ea., (did use oregano, basil & thyme)and left the nutmeg out of the bachamel.  I used only 2T butter in the meat sauce.  It was fabulous!  I'm glad it makes so much--can't wait for the leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKING66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/995731/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-18T05:00:04.813Z",
                "reviewBody": "The moussaka was very good, but I give this 3 stars for a few reasons. First, if you have never prepared Greek food before (ESPECIALLY moussaka) this recipe is very poorly written - it's way too vague. 9 x 13\" is not a big enough pan by any means - go larger. Second, it calls for way too much onion and eggplant. I cut 1 1/2 onions and 2 eggplants and didn't use them all. The writer called the bechamel a \"thin sauce\" but it actually should be very thick - about the same consistency as a yogurt. Make sure to drain your meat very well and, if necessary, spoon out the liquid before adding the meat to the casserole. Let your moussaka cool for a good 30 minutes before serving. \n\nThis is a good recipe, but my greatest advice if you have never made moussaka before - seriously, review the recipe several times and start cooking it 4 hours before you intend on eating it. Also, if possible, have a friend/child/spouse on hand to help you out. Don't give up, it gets easier as you go!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-10T02:03:27.997Z",
                "reviewBody": "This was awesome!  I have been to Greece, and must say, the flavor was very authentic!  I had to make numerous modifications, however, to make it more lowfat to suit my taste.  I steamed the eggplant instead of frying in olive oil, and omitted the 1/2 cup butter in the meat mixture (don't forget to drain the meat fat before adding the spices).  I substituted 1/4 tsp. oregano + 1/2 tsp. basil + 1/4 tsp. thyme for the fines herbs, and increased the cinnamon to 1/2 tsp (key!).  I cut the butter for the bechamel sauce in half (i.e., used 1/4 cup), and added 1/4 tsp. salt + 1/8 tsp. pepper to it.  I used only 3/4 cup parmesan instead of 1 1/2 cups.  I took other reviewers' advice and folded 3 beaten egg whites into the bechamel sauce (discarded the yolks instead of adding them to the meat mixture) - this was key to making the top part authentic!  In addition, I think 1 layer of eggplant is more of how they serve it in Greece, but if you want a taller casserole, make it 2 layers.  Thanks so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T22:02:13.31Z",
                "reviewBody": "Thanks so much for this wonderful recipe. I had tried one from another site some time ago and vowed I would never make it again. But when I learned of this site, I gave it another try because the recipe was so different, I figured \"how could I go wrong\"? I KNOW how Moussaka should taste (my in-laws are Greek) and this is it! One reviewer suggested adding 3 egg yolks to the bechamel sauce (I did) and another reviewer suggested beating the whites to form a soft peak and fold them into the bechamel sauce (I did that too). I followed everything else to a \"T\" and wouldn't change a thing.Well, maybe just a sprinkle of cinnamon and nutmeg on the top before popping it into the oven.Thank you so much for posting this wonderful recipe...it's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CJOHN199",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T17:59:48.623Z",
                "reviewBody": "This was a really nice find.  I followed all of the suggestions to make it more healthy: eliminating or cutting out fat), I grilled the eggplant, cut out the wine (didn't have any on hand), beat three egg whites and folded into the bechamel and substituted marjoram for parsley as I didn't have any dried.  This recipe is time intensive and the bechamel sauce cannot be interrupted - be prepared for that.  The only thing that I didn't like was that it didn't plate up nicely.  However, the taste was sublime and so next time I make it (and it's entirely appropriate for company), I will make it in ramekins.  A very good, authentic flavor and after revisions, a healthy recipe.  (With all changes, brought total calories down to around 360/serving, assuming 8 servings.)  Very filling w/a green salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CMHGUPTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1347053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-08T03:13:33.937Z",
                "reviewBody": "I'm lucky to live near a fantastic Greek restaurant and their moussaka was to die for. It's easier to buy it there than to make this recipe...HOWEVER, it tasted very good. The prep time is longer than 45 minutes, so please make sure you're not making this after work (like I did). I did use a non-stick pan for the eggplant and spray it with Pam to cut out some of the fat. I also left out the stick of butter in the meat mixture and used a little olive oil instead. I mixed a 1/2 c. parmesan with a 1/2 c. feta - made it authentic! The bechamel sauce turned out well as written in the recipe. I put two cups on top of the first layer of cheese and then the other two cups on top of the second layer of cheese...otherwise, there was too much bechamel for one layer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CreativeCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T19:30:28.36Z",
                "reviewBody": "I enjoyed this recipe. Followed other recomendations. layered the filling with the sauce (middle and top). really needed to organize the ingredients so they would follow the flow of the recipe and I felt there was an extra butter mixed in there. But maybe it's cause I didn't brown the beef with butter. No difference to me still tasted great. also to save time I cubed the eggplant and sauteed in olive oil. I also cut back on the nutmeg because I don't like a lot of that flavor with beef. Thanks for the recipe. (used up a good amt of eggplant from the garden this year)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ABD297",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222090/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Moussaka",
            "description": "A Greek-inpired casserole with layers of fried eggplant, beef, and Bechamel.",
            "uploadDate": "2015-09-29T18:03:20.744Z",
            "duration": "PT3M18.965S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4cfb8afa-81c7-4af7-a479-75cd257aa40a%2Fd91b86ef-1e9b-47e1-a1c2-99204d2e790b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4501931922001"
        }
    }
]