[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16731/cottage-cheese-chicken-enchiladas/",
        "name": "Cottage Cheese Chicken Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F610703.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2000-02-21T22:34:53.000Z",
        "description": "Ever tried chicken enchiladas made with cottage cheese? Now's your chance! This takes some prep time, but it is well worth it. You can make it 1 day ahead, and serve the next day.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "2 skinless, boneless chicken breast halves - boiled and shredded",
            "½ cup chopped onion",
            "1 (7 ounce) can chopped green chile peppers",
            "1 (1 ounce) package taco seasoning mix",
            "½ cup sour cream",
            "2 cups cottage cheese",
            "1 teaspoon salt",
            "1 pinch ground black pepper",
            "12 (6 inch) corn tortillas",
            "2 cups shredded Monterey Jack cheese",
            "1 (10 ounce) can red enchilada sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Meat Mixture: Heat oil in medium skillet over medium high heat. Add chicken, onion and green chile peppers and saute until browned, then add taco seasoning and prepare meat mixture according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Cheese Mixture: In a medium bowl mix sour cream with cottage cheese and season with salt and pepper; stir until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Assemble Enchiladas: Heat tortillas until soft. In each tortilla place a spoonful of meat mixture, a spoonful of cheese mixture and a bit of shredded cheese. Roll tortillas and place in a lightly greased 9x13 inch baking dish. Top with any remaining meat and cheese mixture, enchilada sauce and remaining shredded cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 minutes or until cheese is melted and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "annabell"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.586725109580463,
            "ratingCount": 1597,
            "itemReviewed": "Cottage Cheese Chicken Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "548.5 calories",
            "carbohydrateContent": "34.4 g",
            "cholesterolContent": "97.7 mg",
            "fatContent": "31.2 g",
            "fiberContent": "4.3 g",
            "proteinContent": "33.2 g",
            "saturatedFatContent": "16.3 g",
            "servingSize": null,
            "sodiumContent": "1685.1 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-03T02:31:50.2Z",
                "reviewBody": "This was a big hit at my house!! I would serve this meal for family and friends. Here are some changes I made based upon other reviews I read and my own taste. 1) Instead of boiling chicken, I bought an herb-roasted chicken from the grocery store. I sautéed the onions and peppers alone and added about 2 tsp. of taco powder at the end.  After shredding the hot chicken, I added it to that pan. 2) I put some refried beans in each enchilada. 3) For a beautiful look, I sprinkled the top with sliced black olives. 4) I used about 2 cans of enchilada sauce. Very important! Spray the bottom of the pan and pour some sauce on it before adding the rolled enchiladas. 5) I used flour instead of corn tortillas.  I moistened each tortilla with the enchilada sauce before putting it together. (Pour some sauce in a deep bowl and wipe the tortilla on both sides.) This helped keep the enchilada moist and tasty. This is beautiful! Let stand about 5 minutes before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "saladsunshine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-31T19:04:28.863Z",
                "reviewBody": "The cottage cheese/sour cream mixture was so yummy.  I made the chicken in the crockpot-three frozen chicken breasts with a chopped onion, 1/2 a beer with a sprinkle of cumin, oregano, cinnamon, black pepper and a couple of cloves of garlic, gave it a stir and cooked it on low for five hours and then shredded it, sooo easy and tasty.  Thanks for the fab recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Samitestar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2368136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-06T14:18:50.857Z",
                "reviewBody": "These are absolutely amazing!  When I made them for my husband, he raved about them to everyone!  We recently started the BODY FOR LIFE program, so I just changed a few things to make this a protein-packed, low-fat meal - using fat free sour cream, low-fat cottage cheese, pam instead of oil, and low-fat mexican style mix shredded cheese.  I also layer everything like lasagna rather than rolling enchiladas to cut prep time in half!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "honeybearkitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859498/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T17:24:29.733Z",
                "reviewBody": "I really enjoyed this. Very good recipe.\r\nThe enchiladas turned out moist\r\nand quite flavorful. I had a few substitutions\r\ndue to time constraints: plain nonfat yogurt\r\nfor the sour cream, ground turkey for the\r\nskinless chicken, added my own Mexican seasonings\r\nsuch as oregano, chili powder, and cumin to cut down\r\non sodium. Cheddar cheese with some cotija cheese was added in with the cottage cheese mixture for enhanced flavor. Also, I thinly sliced some  black olives and green onions and added to the top of the enchiladas the last ten minutes of cooking. Served with beans and brown rice\r\nwith  fresh tomatillo salsa on the side. Thank you\r\nfor sharing this recipe. I will share it with my friends and \r\nhave fun playing with it.   ** Spread about 1/2 cup of the enchilada sauce on the bottom of the casserole dish before preparing the enchiladas. Helps keep them\r\nmoist while baking. The important thing to remember is\r\nto use a good amount of enchilada sauce to avoid the\r\nenchiladas from drying out. That took me a long time\r\nto figure out.   COOKGIRL\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Marco Salmon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-18T12:32:31.233Z",
                "reviewBody": "I used whole wheat tortillas, 2% milk Mexican cheese, fat free cottage cheese,fat free sour cream,and green enchilada sauce and these enchiladas were awesome..I have also made them with ground turkey and ground chicken, they are great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Wilson Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/151563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-05T21:56:16.7Z",
                "reviewBody": "Was a little afraid to try this, but since everyone else said it was so great, I thought I would give it a try. GLAD I DID!!! Me and my husband LOVED it. Suggestion....Since its just the two of us, I divided the receipe in half and made up two smaller trays of it. I have some of those ovenware plastic baking trays, so I served one tray for dinner, and froze the other. Now I have a wonderful dinner in the freezer and can just throw it in the oven when I want a delicious dinner, but no time to cook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOBOO9999",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T18:11:53.297Z",
                "reviewBody": "My husband & I also made \"Mrs. Espy's Enchilada Sauce\", also on this site.  We served this to 4 of our friends and everyone LOVED the dish.  The only real change we made was to add a whole lot more enchilada sauce (it was just one big messy dish, but mmmmmm was it good!!).  Our friends were surprised to learn they were eating cottage cheese.  It is important to shred the chicken (not just cut it up) if you've never made enchiladas before.  We cannot wait to make this again; a definite family keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CJ121099",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/294334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-15T12:43:40.293Z",
                "reviewBody": "This was simple and delicious too! I didn't want the hassle of rolling the tortillas so I just quartered the tortillas and put half on the bottom then half after the chicken layer. They were fabulous and I'll definitely make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Fegler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T22:47:10.293Z",
                "reviewBody": "Amazing! I changed a little here it goes. The night before, I boiled chicken in low sodium chk broth, while cooking I chopped onions, garlic and jalapeno and saved all together in a plastic bag with the chicken. The next day I came home at lunch to assemble them. I heated olive oil in skillet while I shredded the chicken then put it in the skillet with chopped veggies and added chili powder, cumin, a couple dashes of cayenne pepper and a dash of seasoning salt. I used fat free cottage cheese and light sour cream. I heated 6 flour tortillas in microwave, then assembled and topped with green enchilada sauce a bit of shredded cheese and black olive slices. Put them in the fridge and the boyfriend popped them in the oven for 30 minutes when he got home. When I got home from an evening meeting, I had a wonderful hot meal. These were to die for! So gooey but less fat. I will make these again for sure! Will use more jalapeno next time and omit the shredded cheese on top as it wasn't necessary. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2498998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-11T18:11:07.823Z",
                "reviewBody": "I cut this recipe in half, trying to use up some leftover ricotta cheese.  I ended up with about 8 enchiladas, using a 6\" corn tortilla.  I could have used 2 cans of enchilada sauce. Even with the ricotta substituted for the cottage cheese, this was just alright.  The enchiladas were very soggy, so maybe it would have been better had I let the enchiladas bake 10-15 min before adding the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KARENKINM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814556/"
                }
            }
        ]
    }
]