[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17135/french-country-bread/",
        "name": "French Country Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F263510.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2000-02-23T00:05:56.000Z",
        "description": "A simple European-style country bread. Just enough whole wheat to give it some flavor but not so much that it's heavy. I use an overnight starter to give it extra flavor.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P1DT2H40M",
        "recipeYield": "2 9x5-inch loaves",
        "recipeIngredient": [
            "½ teaspoon active dry yeast",
            "1 cup warm water",
            "1 ½ cups bread flour",
            "2 teaspoons active dry yeast",
            "2 cups warm water",
            "1 cup whole wheat flour",
            "4 ½ cups bread flour, divided",
            "2 teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "The night before baking the bread prepare this starter: In a medium sized non-metal mixing bowl dissolve 1/2 teaspoon active dry yeast in 1 cup warm water. Add 1 1/2 cup bread flour and mix well. Cover and let sit overnight at room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next day: In a large mixing bowl, dissolve the 2 teaspoons yeast in the 2 cups warm water. Add the starter mixture, the whole wheat flour, 3 cups bread flour and the salt; stir until well combined. Add the remaining bread flour, 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease two 9x5-inch loaf pans. Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into the prepared pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 45 minutes.  Preheat the oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for about 30 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephen Carroll"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.419354838709677,
            "ratingCount": 62,
            "itemReviewed": "French Country Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "101.2 calories",
            "carbohydrateContent": "20.4 g",
            "cholesterolContent": null,
            "fatContent": "0.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "156.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T03:55:30.34Z",
                "reviewBody": "What a wonderful bread. I once used a sourdough starter instead of the overnite version and that worked very well too. Crispy outside and very light and fluffy inside, while still hearty thanks to the whole wheat. I've also tried adding wheat bran and found that even tastier.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIDIER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/134219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-06T16:39:20.413Z",
                "reviewBody": "I thought this had a great flavor and produced a rustic looking nice loaf of bread.  Thanks to the reviewers that suggested to up the salt. I used 1 1/2 tbsp. of Kosher salt.  Although I did both proofings according to the time stated in the instructions, I felt that it was a bit underproofed.  I would take the advice of the reviewer that proofed hers for longer.  This has a nice crumb, although I think with proofing a bit longer, one would get more of a light airy lacy looking texture.  Since this is a rustic bread, I added some sesame, poppy, kosher salt, caraway, and anise seed atop the loaves.  This added to the flavor nicely.  Egg washed the tops and spritzed my oven with a mister for the first 7-8 minutes; this produced a nice crusty crust.  Will definitely make again with the change to the salt and will proof a bit longer on the second rising.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T02:32:47.59Z",
                "reviewBody": "Very easy to make.  The starter method does give additional lift and flavor.  I added 1 Tablespoon of honey because my kids are fussy, it doesn't really affect the flavor.  Great as toast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DEB FRAZIER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/281221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-10T20:09:10.093Z",
                "reviewBody": "This was my first time making an overnight starter and it was fun to wake up to having part of the job done! As other reviewers suggested I increased the salt to 1.5T and even though I'm big on reducing salt normally I am glad I did; this bread has very nice flavor. Used King Arthur White Whole Wheat Flour so my bread came out looking like a white loaf but has the health benefits of containing whole wheat. I mixed this in my electric stand mixer and did have to add about 1.5c more flour before the dough pulled together in the bowl; added maybe another cup while I kneaded it to keep it from sticking. I let it rise for 45 minutes as stated on the 2nd rising but probably could have decreased that as my loaves came out pretty large! I didn't use loaf pans but just turned the loaves out as baguettes onto an oiled baking sheet sprinkled with a little cornmeal; topped the loaves with an eggwhite wash and black & white sesame seeds. We really liked this bread! Thank you Stephen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-02T16:47:20.543Z",
                "reviewBody": "The bread had a great crumb and is really moist. Unfortunately it had absolutely no flavor which I found out after baking the first loaf. For the second loaf I tried to remedy it by brushing the unbaked loaf with a salt solution then sprinkling the top of the bread with kosher salt. This gave it some flavor and supported toppings well. If you're looking for a good everyday bread add some salt to the recipe and go with this one. But if you are looking for a French pain levain or that bread you had in that brasserie in Dijon you will be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CHOUCHOUX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1308810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T02:32:48.7Z",
                "reviewBody": "Really yummy my family loved it! Reminded me of the bread one of my favorite restaurants serve. Really easy to make and looks lovely after it is baked not to mention the great flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCARLETT316",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T02:32:48.2Z",
                "reviewBody": "It was all right but I didn't think that it had much taste to it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CLOUDSSUNRAIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/173221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-27T01:50:50.59Z",
                "reviewBody": "I loved this. I really liked leaving the yeast mixture overnight - I am sometimes so impatient to start the recipe that I don't let it proof properly. The combination of bread flour and wheat flour was superb. I used my bread machine for the kneading and rising steps, and ended up with two perfect loaves. Thanks so much, Stephen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-15T18:25:05.263Z",
                "reviewBody": "I loved this recipe. Seattle has great bakeries so I almost never bake my own bread but if I lived in the middle of nowhere this might be the recipe I'd use for everyday bread. It had a wonderful spongy texture mild flavor and chewy crust. I made the starter the night before made the dough and then because I didn't have time to bake that night I shaped the loaves and let them rest overnight in the refrigerator and baked them the next morning. The loaves got very slightly overproofed but it was worth it for the convenience factor. I used whole wheat pastry flour which is all I had at home and the result was an almost-white bread that would be great for sandwiches (our bread got eaten too fast to try it with anything fancier than butter); it kept well overnight too. The dough was very wet but I just kind of kept kneading it in a mixing bowl which was more of a flopping-the-dough-around action than kneading...but by the time I was ready to shape the loaves the dough had tightened up nicely. I baked one round loaf and one in a loaf pan; I used a baking stone and covered the loaves with cast iron Le Crueset-type pans to trap the steam and give them a thick crackling crust. Wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            }
        ]
    }
]