[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17452/honeys-butter-cake/",
        "name": "Honey's Butter Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3658253.jpg",
            "width": 2220,
            "height": 2219
        },
        "datePublished": "2000-02-24T18:09:17.000Z",
        "description": "It's a good sour cream Bundt cake - I add cinnamon to give it a special taste.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9 inch Bundt pan",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "½ teaspoon baking soda",
            "½ teaspoon salt",
            "1 cup butter, softened",
            "2 cups white sugar",
            "3 eggs",
            "1 teaspoon vanilla extract",
            "1 cup sour cream",
            "2 teaspoons ground cinnamon",
            "1 cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 9 inch Bundt pan. Sift together the flour, baking powder, baking soda and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Add the flour mixture alternately with the sour cream; beat well. Spread half of the batter into the prepared pan. Mix together the cinnamon and 1 cup of sugar. Sprinkle most of it over the batter in the pan. Spread the rest of the batter into the pan and sprinkle any remaining sugar mixture over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the cake comes out clean. Allow to cool for 10 minutes before inverting onto a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DIANE TINDALL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.572815533980583,
            "ratingCount": 103,
            "itemReviewed": "Honey's Butter Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485 calories",
            "carbohydrateContent": "71.2 g",
            "cholesterolContent": "95.6 mg",
            "fatContent": "20.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "316.8 mg",
            "sugarContent": "50.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-27T23:38:45.193Z",
                "reviewBody": "A Would-Be 5-Star Cake (I'll get to the why in a sec.) First it's been suggested but make sure you spend a lot of time creaming the very soft butter and the sugar. It's par for the course with pound-type cakes but worth sharing. I left the butter out overnight and creamed by hand for 30 minutes. Absolutely worth it. The crumb was perfect. Moist and buttery - almost fluffy - but still dense as a pound cake should be. Kudos to the recipe for the ingredients' proportions. They're dead-on. Now onto the dark side. The cake recipe proportions are perfecto BUT the filling might be overkill. Also merely dumping it in the middle of the cake batter and then pouring batter on top ain't always gonna cut it. Some technique is required to keep the sugar from seeping to the sides while baking. When that happens the sugar caramelizes sticks to your greased pan and dismembers portions of your otherwise perfect cake when you flip that sucker over to remove the cake. Just sayin'. I suggest going halves on the sugar filling using a teaspoon to incorporate the stuff only in the very middle of the batter and then slicing through it with a knife to keep the sugar line in-check and relatively thin. Enjoy and thanks for the recipe. It's a good one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NIGHTSTARRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1314779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T22:42:36.1Z",
                "reviewBody": "The fact that the cinnamon-sugar mixture turned hard and crunchy is enough to call this recipe a failure in my opinion. The cake itself is beautiful (until you cut into it), moist and delicious and the cinnamon mixture would undoubtedly have worked better had it been cut in half and then swirled into the batter - but that's not what the recipe directs, unfortunately.  The cake could have been salvaged, I suppose,  if it was \"just\" for family, but since the crunchy middle caused the cake to break apart as you cut it, there was no way I would have Hubs bring this to a business meeting tomorrow as was my intent.  The cake was tossed, which obviously was very disappointing.  This is a case where I wished I would have read the reviews BEFORE I made the recipe. Since the cake is not a success as written, without significant changes, I can only rate it \"one star\" and caution others before making this cake using the recipe as written. I have to assume that those reviewers who rated this recipe higher and loved it were rating a modified version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:01:02.467Z",
                "reviewBody": "This cake had really good texture and flavor.  I baked mine in a 9x13 inch pan, and instead of layering the cinnamon sugar, I just sprinkled it on top and swirled it around with a knife.  It took about 45 minutes to bake, but the center was not set and the top was getting hard becasue of the cinn/sug mixture.  I usually would set a peice of foil on top until it's done, but I let it cook a few more minutes and turned the oven off and let it sit there a while.  The sides did turn out a little dry but I'm still rating this 4, because had I followed the directions as written, it would have turned out just fine.  This is a good cake Diane.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:01:03.907Z",
                "reviewBody": "I can't say enough about this cake! It is FANTASTIC! It is easy to make it tastes incredible and everyone LOVES it! I just use half the sugar cinnamon mixture for the middle though. EXCELLENT RECIPE! THANK YOU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adrienne Stella Pilgrim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/776931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T10:54:19.717Z",
                "reviewBody": "This butter cake got a lot of praise from my boyfriend and his son. They just loved it but I think the recipe calls for too much sugar. I cut it down to about 2.5 cups and still think that's too much!! I think the next time I'll try making it with slightly less than 2 cups...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wayne W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/40440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:01:02.263Z",
                "reviewBody": "Mmmmoist and Deeelicious! I cut the 1 cup sugar layer in half and I didn't miss a thing! My husband ate half the cake by himself and thats a big compliment because he usually restrains himself to a 2 slice maximum. Thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NFL WIFE 95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/645738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T07:10:28.623Z",
                "reviewBody": "Very tasty. 3 cups is a lot of sugar but it incorporated better than I expected. The streusel center also came out better than I thought - it looked a little alarming after I was DUMPING all that sugar into the center! Tastes like a snickerdoodle pound cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOELASSES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-20T19:48:32.45Z",
                "reviewBody": "Great Recipe! I had a piece of the cake this morning and it was so good. I made it last night and let it sit the night...really good. When i was making it i ended up running out of all-purpose flour so i had to use self-rising for the rest of the recipe. The cake still turned out great! I did make an icing melted butter and powdered suger. It was so yummy! The cake would have been yummy with out it but i like sweets. I'll be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Superase",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3560746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T07:10:28.763Z",
                "reviewBody": "Definitely a \"honey\" of a cake that we made for our little honey's 14th birthday celebration yesterday. It was not overly sweet and very moist which we served with coffee chip ice cream on the side. HAPPY BIRTHDAY MISS TYLER!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ]
    }
]