[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15007/desserts/specialty-desserts/liqueur-desserts/irish-cream/",
                    "name": "Irish Cream",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17422/irish-cream-bundt-cake/",
        "name": "Irish Cream Bundt Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9157155.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-02-27T18:16:00.000Z",
        "description": "Great tasting glazed Bundt cake with Irish cream baked in. Excellent for any time or any occasion.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "1 cup chopped pecans",
            "1 (18.25 ounce) package yellow cake mix",
            "1 (3.4 ounce) package instant vanilla pudding mix",
            "4 eggs",
            "¼ cup water",
            "½ cup vegetable oil",
            "¾ cup Irish cream liqueur",
            "½ cup butter",
            "¼ cup water",
            "1 cup white sugar",
            "¼ cup Irish cream liqueur"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Sprinkle chopped nuts evenly over bottom of pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cake mix and pudding mix. Mix in eggs, 1/4 cup water, 1/2 cup oil and 3/4 cup Irish cream liqueur. Beat for 5 minutes at high speed. Pour batter over nuts in pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 60  minutes, or until a toothpick inserted into the cake comes out clean. Cool for 10 minutes in the pan, then invert onto the serving dish. Prick top and sides of cake.  Spoon glaze over top and brush onto sides of cake.  Allow to absorb glaze repeat until all glaze is used up.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the glaze: In a saucepan, combine butter, 1/4 cup water and 1 cup sugar. Bring to a boil and continue boiling for 5 minutes, stirring constantly. Remove from heat and stir in 1/4 cup Irish cream.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Irish Cream"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sue Haser"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.777868852459016,
            "ratingCount": 1220,
            "itemReviewed": "Irish Cream Bundt Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "590.2 calories",
            "carbohydrateContent": "68.4 g",
            "cholesterolContent": "83.2 mg",
            "fatContent": "30.1 g",
            "fiberContent": "1.4 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "476.6 mg",
            "sugarContent": "50.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-30T03:46:17.17Z",
                "reviewBody": "Great cake!. I have had many repeat requests every time I take it somewhere. \r\nI handle the glaze differently than the recipe with much better results.\r\nAfter I remove the cake and let it cool 20 minutes, I poke holes in the cake, make the glaze, then pour the glaze into the bundt pan and replace the cake in the pan. I let it sit another 20 minutes and then turn it out onto a cake round. All the glaze is absorbed and it gives a pretty finish to the crust. Then I sprinkle a few more finely chopped pecans over the top for presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RBFOUR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-30T22:41:13.797Z",
                "reviewBody": "I have made this cake a few times now and have perfected it...  First, try and use an angel food cake pan... I use a yellow cake mix with chocolate pudding mix- it gives the cake a color that doesnt look \"cake box\".. Use one cup of irish cream and make sure that mix for the entire 5 minutes..  For the glaze, add 1/2 shot of whisky (its not strong)- just adds a little extra kick.  \nIf you use the angel food pan, the top of the cake is easier to dress with the glaze.  Use a chop stick to make 20-30 holes all around the top and pour glaze over- glaze will fall in nice drips along the side.\nYou will  NOT be dissapointed with this cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ABIGAILG816",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/924472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-26T19:37:53.467Z",
                "reviewBody": "This is a very pretty, moist cake. The pecans definitely dress it up. It is delicately flavored, with just enough Bailey's to make you wonder what that unusual flavor is. Not overly sweet, great to serve as a coffeecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T21:36:25.607Z",
                "reviewBody": "I have made this cake twice now.  Once for a dinner at work, and the other for an anniversary dinner for my parents.  Both times it was a success, with lots of rave reviews.  I have since passed this recipe on to several other women (and a few guys).  I did follow another reviewer's suggestion and put the cake back into the pan to \"soak\" for about 20 minutes (I put approx 2/3 of the glaze in the cake pan...returned the cake...spooned the rest over the cake \"bottom\" and let it sit for about 20 minutes before removing it from the pan again.  Gives the cake a good chance to soak in the glaze and you get a wonderful sugary crust on the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOBBIANN123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/543337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-28T14:21:54.42Z",
                "reviewBody": "I made this cake last week based on reviews and took it to my hair salon.  Understand that I don't like Irish Cream (such as the Bailey's that I used), but I thought it sounded interesting.  About 30 minutes into getting my hair returned to its \"natural\" color, all of the hair stylists, the salon owner and 4 customers had tried the cake.  You would have thought that I had baked the BEST cake ever in the history of the universe.  Everyone raved and raved and raved.  I have a home dessert business and I received 3 orders that day for this cake for Thanksgiving.  Weird, because I still don't know how it tastes!!  Everyone loved the glaze and the suggestion from another reviewer about putting the glaze in the pan and replacing the cake really gave the cake a nice chewy/cruncy crust. Thanks Sue!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-14T15:37:53.11Z",
                "reviewBody": "I made this cake last night for my coworker's birthday. The only change I made is that I used toasted macadamia nuts instead of the pecans. Otherwise I followed this recipe very closely. It turned out beautifully. As for the glaze you have to gradually put it on or it will end up at the bottom on the dish. I poked plenty of holes in the cake with a skewer spooned a little glaze around the top then took my pastry brush and liberally brushed the inside hole and all around the outside of the cake. I waited a few minutes then repeated that process then waited a few minutes and repeated again etc. until the glaze was gone. The glaze hardened into a nice shiny somewhat crunchy moist and tasty topping. The macadamia nuts were wonderful and really added nice texture. By the next morning when the cake had cooled it was very attractive and it was easy to box up and transport (with no frosting to worry about messing up). I think next time I would try a cheaper irish cream because Baileys is soooo very expensive. For sipping I think the quality of Baileys is essential but for baking I would think that a cheaper brand would suffice. Another thing that's wonderful about this cake - it is very quick and easy to put together. Cake mixes are wonderful in a pinch but everyone at work thinks this cake was made from scratch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1462254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-26T02:18:20.407Z",
                "reviewBody": "2/2006 - This is the best cake EVER!!  I made this for New Year's and it was such a hit I had to make it again for my party today.  I'm so glad that I did.  The recipe is perfect just the way it is.  Make sure to use all the glaze.  It's not too much!\n12/25/06 - I don't like it when people write a bad review and then change all of the ingredients.  I really like this recipe as is BUT.... I wanted to make this today as a gift for a friend.  I didn't have yellow cake mix, I only had sugar-free pudding mix, and I didn't have enough Bailey's.  So I used chocolate cake mix, the sugar-free pudding mix, and Kahlua!!  It was fantastic!!!!  Remember, you really do need to use all of the glaze.  Too many members here complained that they did not taste the alcohol.  The flavor is in the glaze!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/375281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-20T21:54:56.59Z",
                "reviewBody": "I've made this numerous times now (see initial review below) and have some tips. First, use 1 cup of Irish cream liquor instead of 3/4 Irish cream and 1/4 water; and use cake mix WITHOUT pudding already in it. After cake is done, cool for 10 minutes in pan, invert, pour 3/4 of the sauce into the cake pan, put cake back into pan, tilt pan around to distribute sauce. Poke holes into the bottom of the cake and pour remaining sauce onto the bottom slowly, letting the holes absorb some of the sauce, sprinkle with nuts. After 10 minutes, take the cake back out and spoon any sauce still in the bottom of the pan over the cake. VARIATION: chocolate cake mix, chocolate pudding, and caramel Bailey's (yum!).\n\nOLDER REVIEW: Followed the recipe exactly as written except did the thing with soaking the cake upside down in the pan. While the cake was nice and moist, it pretty much tasted like a yellow cake. I didn't catch any hint of Irish cream except through the glaze. The texture of the cake was a little more akin to pound cake, in my opinion. Very dense and moist. Not bad, just not super great. I think next time I will use 1 cup Irish cream instead of water and Irish cream. Maybe try it with caramel Bailey's for a little more kick in the taste department. It's a recipe I will make again, but definitely needs modifications, otherwise to me, it's just a waste of good Bailey's if it's just going to taste like yellow cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SELUNE13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1381782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T04:04:54.207Z",
                "reviewBody": "ROCK-MY-SOCKS GOOD!!!!!!!! I followed the recipe exactly and the reviews for the glaze- I poured about 2/3 of the glaze into the pan, put the cake back in- poked holes in the 'bottom' of the cake and poured the rest of the glaze over it.  DELICIOUS!!!!!!!!!!!!!  We took this to friends for dinner and it was a HIT!  YUM!  Thanks for this easy and delicious cake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COURTNEYGRIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466984/"
                }
            }
        ]
    }
]