[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16152/braciola-i/",
        "name": "Braciola I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3628849.jpg",
            "width": 1962,
            "height": 2530
        },
        "datePublished": "2000-03-01T06:03:43.000Z",
        "description": "A delicious meat dish served with your favorite tomato sauce. Top round steak oozing with mozzarella and Parmesan cheeses. Serve over pasta.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound top round steak",
            "6 ounces mozzarella cheese",
            "6 teaspoons butter",
            "⅓ cup grated Parmesan cheese",
            "2 cloves garlic, minced",
            "¼ cup raisins",
            "salt and pepper to taste",
            "2 tablespoons olive oil",
            "1 (32 ounce) jar spaghetti sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the steak into 4 to 6 pieces and pound each piece thinly with a mallet or the side of a cleaver. Place a slice of mozzarella cheese and 1 teaspoon of butter on each piece, then sprinkle each piece with Parmesan cheese, garlic, and raisins, and season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll each piece tightly and tie securely with string. Heat olive oil in a medium skillet over medium high heat. Saute each roll in the oil for 5 to 10 minutes, or until browned on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop these rolls into your favorite simmering tomato sauce for 1 1/2 hours, or until tender. Remove from sauce, cool slightly and remove the strings before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Michele O'Sullivan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.230088495575221,
            "ratingCount": 113,
            "itemReviewed": "Braciola I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "693.5 calories",
            "carbohydrateContent": "39.7 g",
            "cholesterolContent": "129.2 mg",
            "fatContent": "41 g",
            "fiberContent": "6.2 g",
            "proteinContent": "40.8 g",
            "saturatedFatContent": "17.3 g",
            "servingSize": null,
            "sodiumContent": "1388.3 mg",
            "sugarContent": "25.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-09T19:17:27.437Z",
                "reviewBody": "I have some suggestions I've collected to help the filling stay intact.  \n\nTips:\n1. This is traditional Sunday dish--it's not meant to be difficult. As it was served to me, it wasn't a dish that \"wowed\" on the table in terms of presentation, just on your taste buds! This particular recipe describes \"oozing\" cheese.  Conjures almost a calzone-like explosion of filling.  I'm not sure that's what was actually intended. In my experience, that's not what you get when you slice into braciola, so relax if yours doesn't fit the description. It's ok! Still, you shouldn't be losing *all* your filling.\n\n2. Don't overfill your rolls. Less is more.\n\n3. Leave a 1 inch border between your filling and the edge of the meat, all the way around.  This trick makes sense because then the browning process (prior to putting the meat in the sauce) will help seal the edges. Brown well on all sides! This adds flavor!\n\n4.  Roll tightly. \n\n5. Consider tucking the open edges (think burrito). I found this helpful, although I'm not sure that it's traditional.  If you leave the 1 inch border and brown well, that may be enough.\n\n5.  I used toothpicks to secure my rolls, but most italian chefs seem to recommend using string or twine--and tying it tightly, especially the open edges. \n\nThese are just tips I've picked up and I'm still learning myself. I'd love to hear some real braciole pros chime in with their techniques!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T22:21:56.263Z",
                "reviewBody": "I can count the number of foods my kids won't eat on one hand and raisins happens to be one of them, therefore, I left them out. Even so, this recipe was delicious! I made six rolls and only one leaked. I cut the mozarella into narrow slices and placed it in the center of the meat, making sure I had about an inch of space on either side of the cheese. Working slowly, tuck the right and left sides of the meat in toward the center and roll forward. Repeat this until your roll is formed. At this point, the only escape route for the cheese should be at the end. If you tie it off well, it should be fine. Glad to see everyone's a \"Raymond\" fan!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-22T00:49:58.467Z",
                "reviewBody": "We had never heard of braciola until we watched a popular sitcom which featured this dish.  My husband seemed facinated by it so I searched all over for a recipe, which wasn't easy since I didn't know how to spell it!  Finally, I searched this web site for International Beef Recipes and there it was.  I made it for dinner and WOW!  It is soooo good!  This is March, my husband's birthday is in June and he has already requested braciola for his special dinner.  All of us LOVED it!  It definetely is a five star recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nmchilecat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-14T17:33:33.057Z",
                "reviewBody": "Not bad but a few modifications would improve this recipe. 1. Cheese: Mozzarella gets too runny and gooey when melted (think pizza) and is a little bland. A combination of parmesan and romano gives a nice melting and also adds much better flavor. You can even add some swiss or some provolone for better flavor. 2. Herbs. The filling should have some fresh herbs. A few tablespoons of fresh parsley or basil (or your preference) gives a fuller flavor. 3. Sauce. I shy away from jarred sauces because they always taste of tomato paste. A home-made simply marinara is much better. 4. Bread crumbs. Some like it some not. A handful of bread crumbs makes a nice texture. And you can use an egg to help bind it. Man do I love braciole!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MLEESS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-07T23:56:47.963Z",
                "reviewBody": "dip the cheese in olive oil and roll it in flour will help it keep its place.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimsav",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/yesthosearestcharles/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:38:05.553Z",
                "reviewBody": "This was good but the cheese did seep out during cooking gave the sauce a great flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBIE0492",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-12T01:01:23.22Z",
                "reviewBody": "Instead of cutting it up into 4 pieces I cut it in half. One piece I used tooth picks to hold it together and another I used thread. Don't use thread. It held together nicely but was a complete pain. The tooth picks weren't easy to work with because the area around the toothpick didn't brown. It worked out in the end because it cooked in the sauce but next time I'll be prepared and buy string. I omitted the raisins but included italian breadcrumbs. My husband RAVED about this. It wasn't perfect due to my own mistakes but it was still VERY good. I have a feeling this will be a once every two week dish. Some comments: 1)Thin the sauce. Mine thickened up quite a bit while it was simmering. I had to add water to thin it out so it wasn't so chunky on the meat. 2) Turn the meat while it is simmering in the sauce. It was hectic while I was cooking and never thought to turn it. Big mistake. 3) Use string. It is easier to deal with and ensures that the meat will completly brown on all sides. I had a few toothpicks that broke off when I was turning the meat. 4) Use shredded mozarella cheese. It makes it easier to roll tight. 5) Prepare the meat a few hours ahead. After you have it wrapped tightly and secured put it in the fridge. It helps keep it together. This was a great start. I think next time it will be perfect. The flavor was excellent but the hectic kitchen caused me to make mistakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1516627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T05:44:30.89Z",
                "reviewBody": "This was a hit at my house! I had the butcher tenderize my round steak as it tends to be a tougher cut of meat. It doesn't matter if the cheese runs out it is supposed to all blend together for the terrific taste. Just spoon the sauce back on when you serve it. I also put mine in the crock pot after browning the rolls in a little oil. Don't leave anything out because then it isn't authentic! I serve it with mashed potatoes and tossed salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAMMA GORGEOUS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-18T12:01:13.513Z",
                "reviewBody": "This was a wonderful way to prepare round steak. I did make a few changes I left out the raisins and used shredded 2%milk mozzarella. It was tender and delicious. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baxter-Blubaugh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18006678/"
                }
            }
        ]
    }
]