[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16217/trusted-brands-recipes-and-tips/goya/",
                    "name": "Goya&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215235/home-style-tacos-al-pastor-chile-and-pineapple-pork-tacos/",
        "name": "Home-style Tacos al Pastor (Chile and Pineapple Pork Tacos)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2578523.jpg",
            "width": 1080,
            "height": 1080
        },
        "datePublished": "2010-07-20T22:21:06.000Z",
        "description": "Tacos al Pastor are a favorite in Mexico and Mexican restaurants throughout the world for good reason: The mixture of smoky, spicy chiles, sweet pineapples and fresh onions and cilantro is taco perfection. Traditionally, Tacos al Pastor are made by marinating pork in chile sauce, layering the meat on a vertical rotisserie, adorning with a pineapple and roasting slowly for hours--a process that's almost impossible to replicate at home. So we've taken the delicious, authentic flavors that make these tacos so special, and adapted the recipe for your home kitchen, so you can enjoy it whenever a craving strikes!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "5 Goya Guajillo Chiles",
            "5 Goya Pasilla Chiles or Goya Ancho Chiles",
            "1 chipotle pepper from a can of Goya Chipotle Chile in Adobo Sauce",
            "1 medium white onion, halved",
            "1 (20 ounce) can Goya Pineapple Chunks",
            "¼ cup Goya White Vinegar",
            "2 tablespoons Goya Minced Garlic",
            "1 teaspoon Goya Cumin",
            "Goya Adobo with Pepper, to taste",
            "1 (2 1/2 pound) boneless, skinless pork butt, cut into 1/2-inch cubes",
            "2 tablespoons Goya Vegetable Oil",
            "1 (10 ounce) package Goya Corn Tortillas, warmed",
            "2 tablespoons finely chopped fresh cilantro",
            "1 lime, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring 2 cups water to boil in medium saucepan over medium-high heat. Add guajillo and pasilla chiles. Reduce heat to medium-low and simmer until chiles soften, about 10 minutes; transfer to plate. Remove and discard stem and seeds. Meanwhile, coarsely chop one onion half; reserve remaining half. Strain pineapples; reserve juice and fruit separately.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer guajillo, pasilla and chipotle chiles, chopped onion half, reserved pineapple juice, vinegar, garlic and cumin to bowl of food processor. Puree until smooth, about 2 minutes. Transfer chile mixture to saucepan over medium-high heat. Bring chile mixture to a boil; cook until paste loses raw onion taste, about 2 minutes. Season with Adobo; cool. In large container with lid, or in large ziptop bag, combine pork cubes, cooled chile marinade and reserved pineapple chunks; transfer to refrigerator. Marinate at least 2 hours, or up to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in large skillet over medium-high heat. Strain pork and pineapples, discarding marinade. Add pork and pineapples to skillet. Cook in batches until dark golden brown on all sides and cooked through, about 15 minutes; transfer to large serving plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, finely slice remaining onion half. Transfer sliced onion to bowl with cilantro. Serve pork and pineapple mixture in warm tortillas. Garnish pork tacos with cilantro, onions and limes.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Goya&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Goya"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 39,
            "itemReviewed": "Home-style Tacos al Pastor (Chile and Pineapple Pork Tacos)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": null,
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-14T19:42:24.093Z",
                "reviewBody": "Amazing - a bit spicy and sweet but with subtle complexity to the flavor. I would give this 4.5 stars if I could but I'm rounding up since I can't.\n\nFor the sauce I used 5 fresh Anaheim and 2 dried California chillies instead of gujillo (both are fairly mild in heat), 5 large cloves of garlic, 1 tsp. of garlic powder, a 7 oz. can of chipotle chili in adobo, 1 tbsp. canola oil, about 1/4 cup of extra adobo sauce and I put salt and pepper on the roast before coating it with sauce. \n\nI vacuum-pack marinated the meat for 7 hours and instead of stir frying I sous vide cooked the pork roast for 20 hours at 143 degrees in the marinade. \n\nThe tacos turned out incredible but the meat with a bit of sauce and pineapple was delicious to snack a la cart. The meat had a slight kick from the chipotle so it you like a lot of heat add more of those or maybe add a serrano or two with veins. \n\nThis dish is going in my main rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vagabum Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4199716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-08T15:50:22.58Z",
                "reviewBody": "This was very good the first day, but amazing the following day! I put the whole recipe in my crock pot without marinating, cooked on low all day, and made al pastor burritos the first night. The meat was quite tender and delicious, but I knew marinating would have given it more depth. Taco's the next day were great, and the third day I just ate it straight- yummy! \nI did change the pineapple ratio as I don't care for sweet meat. The first day it was sweet, but the second day it had balanced, and the third day it was spicy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lovefusion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2443076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-03T20:24:27.943Z",
                "reviewBody": "I could not give this more than 3 stars. I followed the Recipe exactly but it had virtually no flavor (and I marinated the pork overnight). I did add plenty of Adobo but this definitely needs some good old fashioned SALT. It didn't taste bad but for all the work this was it was not worth it and that was really disappointing. I will stick with a different recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxie Kirby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3129205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-01T08:24:11.287Z",
                "reviewBody": "Popped the whole recipe in the slow cooker after making the sauce as per the recipe. Cooked on low for 8 hours and it was fabulous! Fall apart tender and everyone loved the little \"street\" tacos we served.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsFisher0729",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrsfisher0729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-23T02:35:18.99Z",
                "reviewBody": "Really good recipe. It was a lot of work but the end result was AMAZING! I would suggest a little more salt in the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LizLaugh8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5930832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-29T18:33:11.067Z",
                "reviewBody": "I didn't have time to marinade so I slow cooked the pork in the sauce instead of just marinading in it.  The results were very good!  The sauce needs additional flavor...more adobo seasoning, chile powder, cumin did the trick.  FYI...this is not a novice recipe.  It is pretty involved, but worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Farmhouse Food",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/farmhousefood/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-22T07:58:13.693Z",
                "reviewBody": "This recipe is an awesome starting point. After making the marinade as directed and tasting it I made a few modifications: The marinade needs to be boiled for more than 2 minutes for it to lose the raw onion flavor and I felt that it needed significantly more pineapple juice for it to have the sweet-heat flavor I was trying to recreate. I ended up adding three 8 oz cans of pineapple juice (total) and boiled the marinade for 15 minutes or so to reduce the liquid and let the flavors come together. I also used 2 tablespoons of adobo from the chipotle can added a few tablespoons of brown sugar and a fair amount of salt (I also added salt to taste to the pork while it was cooking). I used fresh pineapple instead of canned. Otherwise followed the recipe to a T. It was a big hit at my house and will definitely be part of our meal rotation. A few tips: There ended up being A LOT of marinade so I used only the marinade that was needed to saturate the meat and set aside the rest to freeze. Glad that I'll be able to make this meal on the fly next time. When I make this again from scratch I will double it so that I have several meal's worth for the freezer. This recipe is labor intensive for sure but definitely worth it! Especially if you can get more than one meal out of it! Also instead of cooking the meat in batches I saved time by using more than one pan. I had one cast iron and one calphalon and both worked equally well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OaklandKate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5586558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-14T14:16:49.923Z",
                "reviewBody": "I've always loved those little tacos you can buy on the streets of Mexico! Three for one dollar and they are soooo good! This recipe is about as close as you can get.... north of the border. Ole!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cynthiaross/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-27T16:28:15.583Z",
                "reviewBody": "Needs a bit more spice but otherwise very good. I used shredded cabbage and cotija cheese spritz with lime juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ARBUTUSROEHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1191154/"
                }
            }
        ]
    }
]