[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/349/bread/yeast-bread/sourdough-bread/",
                    "name": "Sourdough Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/260540/chef-johns-sourdough-bread/",
        "name": "Chef John's Sourdough Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6103033.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2017-09-26T06:23:25.000Z",
        "description": "Making your own sourdough bread does take a while, but the amount of actual work is minimal--and the bread you'll get is spectacular! See the footnote link to how to make the sourdough starter.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT21H35M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "100 grams sourdough starter",
            "250 grams water",
            "8 grams kosher salt",
            "394 grams bread flour",
            "rice flour for bread form (banneton)",
            "1 10-inch banneton (proofing basket)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Measure out starter into a bowl. Add water, salt, and bread flour. Mix until ingredients are well blended into a very sticky dough. Cover with aluminum foil; let rest 4 hours at 70 to 75 degrees F (22 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "With wet hands, fold dough over on itself 3 or 4 times. Cover with foil and allow dough to ferment for 2 more hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously dust a bread form with rice flour (see Chef's Note for banneton substitution).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape dough out onto a lightly floured work surface (you can use bread flour or all-purpose flour). Shape into a ball with a smooth, unbroken surface, using just enough flour on the surface to keep it from sticking. Transfer smooth-side down to banneton. Pinch together the rougher edges of the surface toward the center to smooth them and maintain the round ball shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and refrigerate 12 hours to slow the fermentation process.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove loaf from the refrigerator and let it rise in a warm spot until the dough springs slowly back and retains a slight indentation when poked gently with a finger, about 3 to 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Line a rimmed baking sheet with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dust surface of dough with flour. Gently invert banneton over the baking sheet and transfer dough onto parchment paper. Gently brush off excess rice flour. Score the top of the dough about 1/8-inch deep with a sharp knife to create a shallow slit running across the center. Mist entire surface lightly with water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the center of preheated oven until beautifully browned, 25 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer to a rack to cool completely (do not slice loaf while it is still warm).\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Sourdough Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.632,
            "ratingCount": 125,
            "itemReviewed": "Chef John's Sourdough Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "204.8 calories",
            "carbohydrateContent": "41.2 g",
            "cholesterolContent": "0.1 mg",
            "fatContent": "0.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "404.8 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-01-22T02:41:21.83Z",
                "reviewBody": "I found this recipe on January 11, 2018 as I was looking for an \"old fashioned\" sourdough bread recipe. I had begun a starter on January 1, before I found Chef John's starter recipe, and have used that starter.  I have already made this recipe four times using bread flour, and twice using a combination of whole wheat and bread flours. Each time turned out great, and I live above 5,000 ft. I do not have a bread form, and have used a bowl sprayed with cooking spray and sprinkled with corn meal. I like the looks and taste of corn meal with this simple bread, so no problem for me. This is a lovely addition to an \"interesting breads\" collection. Thank you for a tasty, simple recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sbgyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5066921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-12T00:28:01.37Z",
                "reviewBody": "This recipe is so versatile.  Sometimes I add oats for half the flour and it still works out GREAT.  I have  added dry orgino and or basil, still perfect.  Today I'm trying adding CHIA SEEDS.  I have made this recipe as is many times I can't count.  I do like to hold back on the salt to keep it from being too salty for my taste.  Other than that, aside from the time it takes to make, it is a wonderful bread that everyone who has tasted it so far loves it.  The aroma from the bread is mouth watering!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Theresa Torrence Allen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/314591/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-04-14T04:02:28.937Z",
                "reviewBody": "I first made this, starter first, when chef john first posted it.  And I must say the starter definitely improves with age. The bread itself is great, but over the year or so I've been experimenting and found that substituting 100 grams of the water with buttermilk produces a much more satisfying bread for my taste. This may have to do with the youngness of my starter, or the area I live in, who knows. But I'd give the recipe as stated 4 stars and the adjusted recipe 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ms.krstn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5223525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-27T19:38:54.613Z",
                "reviewBody": "Really pleased with how the bread turned out. Nice crust and very tender insides with perfect holes. We ate half the loaf in one sitting. Followed the recipe exactly except did an extra “folding” (did it twice instead of once during the first rise). Easy to make, you just have to plan your time.  Definitely will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jiminri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4778826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-20T07:11:13.43Z",
                "reviewBody": "I tried following the recipe but kept ending up with a much too wet dough. It was more like making slime than bread dough. So added flour, a lot more flour until it got back to being a dough and let it slow rise in the fridge. the bread comes out super creamy the first day.  The second day it becomes much, much denser. So I toasted it.  It was better than those quick sourdough recipes, but not yet where I want it to be.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dov Cole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9821942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-07-25T04:40:52.743Z",
                "reviewBody": "This is the best bread I have ever made.  I had been experimenting with sourdough for over a year before I tried this and had lots of failures.  I like using a bit less water than he uses so the dough is a little bit sturdier - not much though, the moistness of the fresh loaf depends on it.  I tried something different last time and came out with a nice dough.  I made the dough before bedtime, and let it rise overnight on the counter, then shaped it and let sit in the fridge for several hours and baked as directed in CJ's  recipe.  Maybe it was a great sourdough day, but it was the best loaf I've made to date.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Clark Chesser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7521082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-11-30T03:58:54.827Z",
                "reviewBody": "The longest part is just making the starter!! Now that I have that I make this all the time.\n\nVery easy directions to follow. Weighing the ingredients was great and the recipe turned out just like it should. I cook mine for 32 mins and it turns out nice and crispy.  25 mins was like, JUST cooked. A baker friend of mine suggested using a cast iron pan lined with parchment if you have it available.\n\nTIP 1: if you're going to substitute the banneton with a kitchen cloth make sure that it is VERY tightly knit fabric. Nothing like towel fibres  or else  your bread will stick. Think more like a handtowel or tablecloth fabric.\n\nTIP 2: Its important to shape your loaf into a ball by pulling the sides into the middle as you turn the loaf. Watch YouTube. This will create tension on the surface of the ball and help it rise really well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adonz15",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17931496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-11T20:16:36.657Z",
                "reviewBody": "I finally got bread with lots of holes in it! I even folded some raisins in. Other than that I made this recipe with the exact measurements. I used a steel bench scraper to manipulate the sticky dough. I didn t refrigerate it but let it stand in the banneton overnight in my cold kitchen about 55-60 F. It looked like it hadn t risen at all. I put it in a warm toaster oven for 30 minutes. I heated my ceramic pot with lid on in a 450F oven. Placed the dough in the hot pot scored it like # a hash tag and replaced the hot lid. Quickly placed the pot in the oven. Baked for 20 minutes at 450F (although temp wavers with opening of oven door. ). Lowered heat to 400F baked for 20 minutes more. I got a nice ear on the dough too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pinkstudio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23445812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-02-26T00:20:25.123Z",
                "reviewBody": "Love it made several times. Made a tomato bread off this site using the starter also cinnamon rolls. Love the sourdough tomato bread ( include paste basil and Sundried tomato) the sourdough taste with the sweet cinnamon rolls was not something we like. Like my cinnamon roll recipe better. We really enjoy this recipe for bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TR6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6233439/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sourdough Bread Part 2: The Loaf",
            "description": "The nearly no-work process to a loaf of fresh sourdough!",
            "uploadDate": "2017-09-19T16:24:47.638Z",
            "duration": "PT9M16.089S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F054f38dc-9d06-4e0d-aa62-2ce19709fa6d%2F40efdb7e-460a-4bcb-8205-470a676fb82f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5580956703001"
        }
    }
]