[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16217/trusted-brands-recipes-and-tips/goya/",
                    "name": "Goya&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215231/empanadas-beef-turnovers/",
        "name": "Empanadas (Beef Turnovers)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1034561.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2017-10-07T13:03:37.000Z",
        "description": "The perfect pastry for all meals! Empanadas, or beef turnovers, are discs of pastry packed with meat. Some turnover recipes call for all manner of fillings, but this GOYA&reg; Empanada recipe features a delicious tomato, onion, garlic and beef mixture. You can enjoy empanadas as an appetizer, a main dish, or even after your main course. Use GOYA&reg; Discos, or frozen pastry rounds, for a flaky beef turnover that will make your mouth water.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "20 empanadas",
        "recipeIngredient": [
            "1 tablespoon Goya Extra Virgin Olive Oil",
            "½ pound ground beef",
            "½ medium yellow onion, finely chopped",
            "¼ cup Goya Tomato Sauce",
            "6 Goya Spanish Olives Stuffed with Minced Pimientos, thinly sliced",
            "2 tablespoons Goya Sofrito",
            "1 packet Sazon Goya with Coriander and Annatto",
            "1 teaspoon Goya Minced Garlic",
            "½ teaspoon Goya Dried Oregano",
            "Goya Ground Black Pepper, to taste",
            "1 (14 ounce) package Goya Discos (yellow or white), thawed",
            "Goya Corn Oil, for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Add ground beef and cook until browned, breaking up meat with a wooden spoon, about 10 minutes. Add onions and cook until soft, about 5 minutes more. Stir in tomato sauce, olives, Sofrito, Sazon, garlic, oregano and black pepper. Lower heat to medium-low and simmer until mixture thickens, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured work surface, using a rolling pin, roll out discos until 1/2-inch larger in diameter. Spoon about 1 tbsp. meat mixture into middle, fold in half to form a half moon; moisten edges with water and pinch to seal closed, or seal with a fork.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a deep saucepan with oil to a depth of 2 1/2-inches. Heat oil over medium-high heat until hot but not smoking (350 degrees F on deep-fry thermometer). Cook Empanadas in batches until crisp and golden brown, flipping once, 4 - 6 minutes. Transfer to paper towels to drain.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Goya&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Goya"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.781456953642384,
            "ratingCount": 151,
            "itemReviewed": "Empanadas (Beef Turnovers)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": null,
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-29T21:38:21.547Z",
                "reviewBody": "In case someone is overwhelmed with the Goya products list in this recipe, it is perfectly fine to use ANY olive oil, ANY tomato sauce, ANY spanish olives, fresh garlic, dried oregano, etc. The only Goya products you would probably need are the  Sazon, the sofrito (unless you make your own, there's a good recipe for it here) and the discos (which is the premade dough that comes ready, frozen in round shape and in packs of 10). Yes, you can make your own dough but I like Goya discos, they are good, convenient and cheap. I added some adobo Goya (not the chipotle sauce but the powdered adobo which is a blend of spices like garlic powder, salt, cumin, etc) because I found the picadillo a tad bland. To make these appetizer size I cut each round of dough in two semicircles, filled, folded and sealed edges with a fork. You can freeze these before frying, then fry when needed without having to thaw it. My son loves them filled with pizza sauce, mozarella cheese and pepperoni. We call them \"empanadillas de pizza\", or \"pastelillos de pizza\". You can fill them with just cheddar cheese, or with guava paste, cooked shredded chicken... well, whatever you are into. Just make sure you don't burn yourself, the filling is very hot and if you don't seal them right they might leak on you and OUCH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-14T16:46:26.497Z",
                "reviewBody": "OMG ... my new favorite!  Out of necessity (not rebellion), I had to change a couple things.  First of all, I double the recipe because I have a big family.  Next, I only had ground turkey meat (20 oz) so I used that instead of the ground beef.  Next I couldn't find the Goya Discos to save my life so I finally settled for pie crust sheets.  So because of that I baked these at 425 degrees F for about 20-30 minutes.  The whole batch made 20 medium turnorvers.  I served these with the Mango Salsa (also on this site) and my family went nuts over these and dovoured almost the whole batch.  I kept eating the filling ... so savory and flavorful.  I did season the meat with garlic salt and pepper and also added a bit more sofrito, but other than that I followed the measurements (doubling of course) and this recipe is a keeper.  Thanks so much for this.  My mom was Puerto Rican from Hawaii and she used to make these all the time but she died with the recipe.  It brought back great memories.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa4Dennis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3374755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T21:06:52.63Z",
                "reviewBody": "Excellent. I used the biscuit dough that comes in the cylinders in the dairy section (next to the cheese and butter) because I wanted flaky empanadas. I baked them and they tasted soooo delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Illegally Downloading Food",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1734973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-08T17:25:33.08Z",
                "reviewBody": "Wow, just like mom's! These really are fabulous. If made true to the recipe, they are wonderful. My mother always added a couple of small dashes of cinnamon, yes, cinnamon, to the picadillo (which I, of course, had to do), and it makes such a lovely addition. Either way, though I do recommend trying a dash or two of cinnamon, these are a winner!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "paloma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5909425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-25T13:05:26.893Z",
                "reviewBody": "This was my first attempt at making empanadas, they turned out great.  Loved this filling, and assembling was fun and easy, just don't be in a rush when you prepare this recipe!  I baked these at 400* for 30 minutes, just a bit too crunchy, I'll lower the heat to 375* next time and bake only 25 minutes.  Thanks for sharing your recipe, Goya!  Love your products and your recipes are always spot-on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-01T06:31:14.833Z",
                "reviewBody": "Dee. Lish. Us. I followed the instructions for the meat as written, and it was soooo tasty. I made a slight tweak as an alternative to frying the empanadas. Instead of deep frying, lightly brush them with olive oil and bake them in the oven on 350 for about 12 to 15 minutes (or until the nice brown color appears). Both ways are delicious. Thank you for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mavis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15996225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-10T19:12:59.14Z",
                "reviewBody": "This recipe is on point. \nI'm not one to measure ingredients, I normally eye-ball it, but this recipe is easy and delicious!!!!!\nThe time consuming part is letting the pastry dough completely thaw out.  \nOne thing I would add is to add some cheese (cheddar or mozzarella) then your adding the beef to the center of the empanada. It gives it just the right amount of umpf'! lol ... Oh yeah, If you don't have oregeno, using regular bottle of italian seasoning works just as well.... \nHappy eating and thanks for posting this recipe on here... I LOVE IT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassie_320",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6538985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-27T22:12:55.44Z",
                "reviewBody": "Really great recipe.  I thought it was missing a little heat so I added cayenne pepper and a few splashes of balsamic vinegar.  I also used refrigerated pie crust with a 4-in cookie cutter.  The crust was flaky and the filling was so delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SJBKENDRICK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T17:33:11.097Z",
                "reviewBody": "Fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aunt Mer Mer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5911436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-18T17:41:06.387Z",
                "reviewBody": "too salty. try 1/2 powder stuff. also put some raisens in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Mazorra Salamy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3030456/"
                }
            }
        ]
    }
]