[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17157/desserts/chocolate/white-chocolate/",
                    "name": "White Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/180504/spooky-halloween-eyeballs/",
        "name": "Spooky Halloween Eyeballs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F498847.jpg",
            "width": 2800,
            "height": 1867
        },
        "datePublished": "2017-12-08T15:00:57.000Z",
        "description": "These taste like Peanut Butter cups.  They are fun to make and kids really get a kick out them.  A bit time consuming, but the end-product is worth it.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT3H20M",
        "recipeYield": "30 servings",
        "recipeIngredient": [
            "1 ½ cups creamy peanut butter",
            "½ cup butter, softened",
            "2 ½ cups confectioners' sugar, sifted",
            "1 tablespoon vanilla extract",
            "12 ounces white chocolate, chopped",
            "2 tablespoons shortening",
            "2 drops blue food coloring",
            "½ cup miniature semisweet chocolate chips",
            "2 drops red food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat the peanut butter and butter with an electric mixer in a large bowl until smooth. Beat in the sugar and vanilla. Cover and refrigerate for 30 minutes. Roll chilled dough into small, eyeball-sized balls and place on 2 baking sheets lined with wax paper.  Refrigerate for another 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the white chocolate and shortening in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave).  Do not overheat or chocolate will scorch. Dip each eyeball into the white chocolate and transfer to the waxed paper until the chocolate has set. You can chill them in the refrigerator.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir a few drops of blue food coloring into the remaining melted white chocolate. Make a round \"iris\" on the top of the cooled eyeball and press a mini chocolate chip in the center for a \"pupil.\" For an extra spooky bloodshot eyeballs take a toothpick dipped in red food coloring and make squiggly lines on the eye.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "White Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cara Lewis Hampton"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.360544217687075,
            "ratingCount": 147,
            "itemReviewed": "Spooky Halloween Eyeballs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "226.6 calories",
            "carbohydrateContent": "21.4 g",
            "cholesterolContent": "10.5 mg",
            "fatContent": "14.9 g",
            "fiberContent": "1 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "91.5 mg",
            "sugarContent": "19.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-10-28T16:49:06.253Z",
                "reviewBody": "Okay, I just made these to top the Halloween cupcakes and here are my recommendations: 1)  After you shape the balls, put a toothpick in them and then place them in the freezer for about 30 minutes or so. 2) Don't bother adding the shortening to the white chocolate. I zapped a bag of white choc. chips in the microwave for 30 seconds...stirred...30 more seconds...really stirred and it melted beautifully (do have to stir for a while to completely melt the choc). 3) Dip the frozen PB balls in the white chocolate and gently push it off of the toothpick (push it up off the toothpick), after you set it down the choc will still \"ooze\" over where your fingers were. 4) I didn't bother with the red squiggles as it looked too time consuming. All in all it looks great!!  The boys really like them!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maegan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3405158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T17:33:48.257Z",
                "reviewBody": "Very good recipe. I didn't change much but I'll share what I did since I tried to address some of the other reviewers' concerns: First I used natural peanut butter - I got a brand new jar poured off the oil from the top and used the whole jar (about 1.5c anyway). This results in a drier filling which is really easy to work with. When I blended it up with the sugar it resembled gravel actually. I then added 2 cups of Rice Krispies cereal - I DEFINITELY recommend doing this everyone loved the crunch in the middle! I also needed a whole 24 oz of white chocolate I guess because I added to the volume of the recipe because of the cereal. I put toothpicks in them to dip them in chocolate. Took an hour to make the pb center and cover them in chocolate then I refrigerated to set the chocolate and took another 15min to finish decorating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaime",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2181140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-28T20:45:16.573Z",
                "reviewBody": "These were so fun! ONE complaint... they don't have any texture. The peanut butter is really good but is very rich and the creaminess combined with the sweetness makes it hard to eat an entire one (which might be a good thing for me ha!) They are much more \"eatable\" when you add something like rice krispie cereal to the peanut butter mix to add some crunch or perhaps crushed peanuts (though I didn't try that... it just sounds good as I'm typing this!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4039473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-18T00:39:27.217Z",
                "reviewBody": "I LOVED this recipe! I pieced together quite a few helpful tips from other reviewers and I thank them for the success of these I can see how making them as written would be very frustrating! Firstly I recommend making the \"dough\" refrigerating it over night and rolling into balls the next day. They form easily this way and you don't have to worry about them being too greasy or mushy. Poke toothpicks in each ball and stick in the freezer for at least a half an hour. I didn't use any shortening in my white choc mixture and it turned out fine although I found I ran out of white choc with about 5 eyeballs left so you may need a bit more. Dips into the white choc while holding the tooth pick allow to dry a few seconds before pushing the ball off of the end. You may leave a fingerprint or a blemish but you can cover it up when you create the pupil. I used decorating icing for the pupils as well as the veins. They looked great tasted exactly like a Reeses peanut butter cup. Will definitely make these again! =) Thank you for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wafflemancer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2989974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T18:32:57.907Z",
                "reviewBody": "These are SO fun to make. And really great for a project to do with your school aged kid. Any \"ball\" candy will work in this recipe even Oreo Truffles or Cake Balls. If you plan on making these to take to school and cannot bring anything with peanut butter you can also do this with Oreo cookies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-30T16:18:48.513Z",
                "reviewBody": "There are several shortcuts I took from other sources. Stick the balls on plastic forks easier to work with stand them in coffee mugs and refrigerate. I have trouble with chocolate melting so I used a can of ready made frosting in the can and melted it in the microwave for 25 seconds took the fork and dipped it into the frosting can. Eyballs were gummy lifesavers with a dark chocolate chip stuck in with frosting. Red veins were made with red readymade frosting in the tube. For the kids I used donut holes instead. fast and easy. they made and ate them at the same time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dare",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3721043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T19:24:07.41Z",
                "reviewBody": "First and foremost- DON'T SKIMP ON THE SUGAR!!! Gahh the peanut butter was a nightmare. I kept having to take it in and out and in and out of the freezer. About 2/3 way done I kinda gave up and switched to semi-sweet chocolate didn't have to worry 'bout the pb showing through or staying behind. I ended up storing them overnight in the fridge and the next morning I realized hey I need more white choc. for the iris. Super. Good thing I didn't use all my squares yesterday!! I found that the bigger the iris the better. The small just looked sad. The red veins really completed the look although I wish I'd had used a mini brush rather than a toothpick. Overall though they looked so cool!!! I really wish I could have taken a pic..makes me sad. This was quite the time-consuming project and I don't know if I have it in me to make again. I do give it 5 stars though because the idea is so novel I hope others will give it a go and hopefully like 'em. I especially recommend it for those experienced with melting chocolate an ddecoration. not me clearly. Thanks for putting up the recipe though!! p.s. upon arrival at the party where they were intended for some had cracked their chocolate pb sticking out. Same with the buckeyes choc.. I think it's cause the mixture was too soft..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaley_Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2266187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-03T18:15:22.627Z",
                "reviewBody": "These were delicious. I made them with natural peanut butter - it is thicker so I did not have issues with them being too soft. Also left out the shortening wasn't necessary for the chocolate glaze. I shaped them into little ghosts instead of eyes. Mini chips for eyes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lesel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3778837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T20:26:10.877Z",
                "reviewBody": "These were a hoot to make. I found the peanut butter mixture quite soft to work with and instead of refrigerating the eyeballs for 30 minutes before dipping I put them in the freezer. It helped but they softened fast. Broke toothpick in half to have a bigger \"drawing\" surface for the red food color. Oh and they taste great--very creamy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Gilson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3816485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-30T18:29:27.423Z",
                "reviewBody": "I was not so pleased with the outcome of this however taste is still great. This is time consuming project so I did it in steps: I made the peanut butter mixture 1st night rolled the balls the next night and the 3rd night I dipped them. I was doing pretty good till I got to the decorating part. Blood shot look: Tried toothpick didn't work (hardly saw the red) then I tried the food coloring pen (waste of money) and then I tried an tiny brush and loved the results. Next night I went to put the blue centers on with the chip and guess what? The red food coloring didn't dry I had to pat the eyeball to remove some of the coloring. Now I'm concerned because if they sweat the red food coloring is going to come off on peoples finger....UGH!!!! So if any one can help let me know.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingGirlJLR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinggirljlr/"
                }
            }
        ]
    }
]