[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16860/trusted-brands-recipes-and-tips/reynolds/",
                    "name": "Reynolds&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/238501/salted-caramel-nut-brittle/",
        "name": "Salted Caramel Nut Brittle",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1731692.jpg",
            "width": 2560,
            "height": 1440
        },
        "datePublished": "2014-07-08T17:43:26.000Z",
        "description": "This favorite candy gets a hearty update with almonds, cashews, pumpkin seeds and sesame seeds.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H18M",
        "totalTime": "P0DT0H33M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "Reynolds Wrap® Non Stick Aluminum Foil",
            "1 cup butter",
            "1 cup sugar",
            "3 tablespoons water",
            "1 tablespoon light-color corn syrup",
            "⅓ cup lightly salted roasted cashews, coarsely chopped",
            "⅓ cup almonds, toasted and coarsely chopped",
            "¼ cup roasted and salted pumpkin seeds",
            "2 tablespoons sesame seeds, toasted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a 15x10x1-inch baking pan with Reynolds Wrap&reg; Non-Stick Foil; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a 2-quart heavy saucepan over medium heat. Stir in sugar, water and corn syrup. Bring to boiling over medium-high heat, stirring until sugar is dissolved. Avoid splashing side of saucepan. Clip a candy thermometer to side of pan. Cook over medium heat, stirring frequently, until thermometer registers 290 degrees F or a small amount of mixture dropped into very cold water separates into threads that are hard but not brittle. This will take about 18 minutes. Adjust heat as necessary to maintain a steady boil. Watch carefully the last 5 minutes to prevent overcooking. Remove from heat and remove the thermometer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into the prepared baking pan. Tilt pan to spread mixture evenly. Let stand 2 minutes. In a small bowl combine the cashews, almonds, pumpkin seeds, and sesame seeds. Sprinkle evenly over candy mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set baking pan on a wire rack. Cool completely and break into large pieces to serve.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Reynolds&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Reynolds Kitchens(R)"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.625,
            "ratingCount": 8,
            "itemReviewed": "Salted Caramel Nut Brittle",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "136.9 calories",
            "carbohydrateContent": "10.4 g",
            "cholesterolContent": "20.3 mg",
            "fatContent": "10.6 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.3 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "67.6 mg",
            "sugarContent": "8.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-05T21:17:28.177Z",
                "reviewBody": "I used parchment paper instead of foil and it worked out very well. \nI also used pumpkin seeds, which I painstakingly hulled myself, and pistachios instead of the sesame seeds and it turned out really, really good. Love the idea of doing multiple nuts instead of just regular, old, boring peanuts. Lastly, I did add 1/2 a tsp of baking soda at the end to lighten it up a tad, but I do this with all my brittles.\nThanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Kathryn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13529216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-24T16:30:00.66Z",
                "reviewBody": "I was very nervous making this because my candy thermometer broke last Christmas and I haven't replaced it yet. If you don't have a thermometer you just have to watch it closely. Once it turns the pretty golden-brown color you have maybe 2-3 minutes left before taking it off the heat. This brittle recipe is so delicious. Addictive even. I didn't have cashews or sesame seeds on hand so I left those out. I also added just a tiny sprinkle of Himalayan pink salt to the top with the pumpkin seeds & almonds. I was hoping to make little gift bags using this to give to my Thanksgiving guests - but it's not going to last that long will have to make another batch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RainbowJewels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rainbowjewels/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-26T09:16:56.807Z",
                "reviewBody": "I ended up having to do a do-over on this recipe. Lord help me LOL!! The 1st time not really reading, I used clear corn syrup...hmm oops, I had banana colored brittle that still harden to the hard crack stage but looked totally wrong. Made a 2nd time and used dark corn syrup and it did the trick. While I didn't have all the nuts for this recipe I improvised with pistachios, banana chips and sugar & cinnamon macadamia nuts with  sliced almonds. Worked just fine, however, I could have used some caramel extract in the candy before setting because it didn't have that caramel flavor I was expecting it to have and wasn't used to not putting in extract. That would be the only thing I would do, would be to add 1/4-1/2 tsp caramel extract. And after making 2 batches, waiting 2 minutes to sprinkle on the nuts, is pointless....you need to do it the moment you pour. Because the 1st batch set so quickly on my counters, that when I broke into pieces the nuts flew off with empty pits on the surface. The 2nd batch I sprinkled immediately and 90% of the nuts stayed on and look much more appealing to the eye then the 1st batch. But will totally make again. TY And note, it was also my 1st time using Reynold Wrap's non-stick foil and will totally be using more of it because it was so nice to have it basically remove it's self from the candy unlike other foils that you have to be careful in removing because of shredding. Loved the non-stick foil!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-26T00:31:35.163Z",
                "reviewBody": "Very tasty! I never made toffee brittle before but like it a lot and I'm not a brittle fan. I had to improvise on the topping because I had no pumpkin seeds or sesame seeds. I used fancy mixed nut combo instead. The only brittle I made before was a microwave version so I felt a little nervous and clueless about doing it stovetop. I stirred and stirred and stirred. Came out perfect. Heeded advice and added nuts right away and honestly it cools so fast it was nearly set before I put all if them on. Be quick. This foil is just about the best kitchen invention ever. Use it for tons of things the brittle did not stick in the slightest. Thanks Reynolds!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2881231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-19T12:46:27.143Z",
                "reviewBody": "This is incredible brittle. I used salted roasted peanuts and omitted cashews and pumpkin seeds since I wanted to use what I had on hand - the toasted sesame seeds added a nice texture. This is definitely the best batch of brittle I've ever made at home and I will DEFINITELY be sharing this one over the Holidays. The Reynolds Non-Stick foil works like MAGIC with this recipe - no clean up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebekah Rose Hills",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sandra_92083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-02T00:02:56.82Z",
                "reviewBody": "The brittle cooks up to a beautiful golden color. Make sure that you sprinkle on your nuts and seeds while the brittle is still hot. I waited two minutes as recommended in the recipe and the brittle was already hardening and the nuts and seeds would not stick. I did have to heat the brittle in the oven so my toppings had a chance to stick. I didn't use pumpkin seeds as we do not care for them. I also sprinkled some Maldon salt on the brittle as I did not think the saltiness of the nuts would come through enough to call this salted caramel brittle. I did use Reynolds non-stick foil and I was surprised that the brittle did not stick. It came off easier than with parchment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsFisher0729",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrsfisher0729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-05T02:05:38.65Z",
                "reviewBody": "Hubby said 5 stars hands down and clean-up was a breeze using the Reynolds Non Stick Foil. The entire sheet of candy lifted right off of the pan without a hiccup. I am 100% sold on this foil. The only problem I ran into was that if you let it sit for two minutes then it gives it too much time to set up and your nuts will not stick properly. I recommend having your nuts chopped and prepared ahead of time and then sprinkling them on immediately. This had such a rich buttery toffee flavor and the topping could easily be changed up with whatever nuts you preferred or had on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-09T22:31:20.467Z",
                "reviewBody": "Forgot to shell the pumpkin seeds. Whoops. But otherwise this turned out really yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8055826/"
                }
            }
        ]
    }
]