[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14363/main-dish/rice/fried-rice/",
                    "name": "Fried Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18294/house-fried-rice/",
        "name": "House Fried Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F202268.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-04-06T15:14:32.000Z",
        "description": "Loaded with shrimp, ham, chicken, and veggies, just like in your favorite Chinese restaurant. This 'House' Fried Rice is delicious and an excellent use of leftovers! Feel free to substitute ingredients, depending on what you have on hand.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ cups uncooked white rice",
            "3 tablespoons sesame oil",
            "1 small onion, chopped",
            "1 clove garlic, chopped",
            "1 cup small shrimp - peeled and deveined",
            "½ cup diced ham",
            "1 cup chopped cooked chicken breast",
            "2 stalks celery, chopped",
            "2 carrots - peeled and diced",
            "1 green bell pepper, chopped",
            "½ cup green peas",
            "1 egg, beaten",
            "¼ cup soy sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook rice according to package directions. While rice is cooking, heat a wok or large skillet over medium-high heat. Pour in sesame oil and stir in onion. Fry until golden, then add garlic. When garlic is lightly browned, mix in shrimp, ham, and chicken. Fry until shrimp is pink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lower heat to medium and stir in celery, carrot, green pepper, and peas. Fry until vegetables are crisp-tender. Stir in beaten egg and cook just until egg is scrambled and firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When rice is done, mix thoroughly with vegetables and stir in soy sauce. Adjust seasoning to your preference and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Fried Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LMFB64"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5094936708860756,
            "ratingCount": 632,
            "itemReviewed": "House Fried Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "236.2 calories",
            "carbohydrateContent": "26.4 g",
            "cholesterolContent": "58.9 mg",
            "fatContent": "8.4 g",
            "fiberContent": "2.4 g",
            "proteinContent": "13 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "602.6 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-10T19:53:27.547Z",
                "reviewBody": "I gave this 5 stars because it is a very good base. After reading reviews here is what I did. I cooked the rice & let it cool.  I then cooked the onion & garlic in the oil.  I added only shrimp, carrot, & peas.  Then I mixed the soy sauce in w/ the veggies. I stirred the mix into my cooled rice.  I then cooked 3 eggs in the same pan & chopped them up to bite size pieces & mixed them in.  I refrigerated the whole deal & just before dinner I heated it all up by frying it so that there was a little crunch.  It came out as good as our local  chinese place!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1309147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-16T02:26:42.483Z",
                "reviewBody": "I stuck closely to the ingredients list, only omitting the green pepper as it didn’t appeal to me in fried rice. But I did change the cooking method quite a bit to produce a better result. For example, to add the carrots to the pan and cook them until crisp-tender when you’ve already got the cooked shrimp in the pan, you’d end up with some rubbery, overcooked shrimp! Also, fried rice should be started with cold, cooked rice.  So...I cooked the rice first, then spread it out on a cookie sheet and stuck in the fridge while I prepared the rest of the ingredients. I quickly stir fried the cold rice in the sesame oil, then the celery and onion, and finally the garlic (so it wouldn’t burn). To that I added the peas and the diced carrots, which I cooked ahead of time in the microwave.  As for the egg, I cooked it like a crepe in a small sauté pan, then rolled it up like a cigar and sliced it, chiffonade-style, very thinly, producing beautiful yellow ribbons of egg.  I tossed the egg in with the shrimp (I used frozen, pre-cooked salad shrimp), the chicken (already had some chopped rotisserie chicken in the freezer) and the ham (a pre-cut ham slice from the market came in real handy for this). Finally, I stirred in the soy sauce and a drizzle of toasted sesame oil. To die for.  The recipe suffers, however, from an instructed cooking method that does not bring out the best this recipe has to offer – therefore, four stars rather than the five it potentially deserves with a few changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-20T19:32:00.487Z",
                "reviewBody": "First I never used recently cooked rice, i always use day old rice, which saves time. I also used SPAM, whenever I have it or cubed turkey bacon. I find that the flavors are much better for my taste. Also whenever I make fried rice, I always tend to layer my flavors with the ingredients.  So I start by cooking the eggs and then setting them a side. I then add a little oil to cook the spam or meat. I brown the meat slightly first, before removing it. Then i add onion and garlic, and slowly cook them, before adding the rice. I then cook the rice and the onion and garlic, so that the rice can absorb some flavor. I then add the veggies, and cook them slightly. At this point I add some taste, i use a little bit of soy and oyster sauce. I mix these a little bit more so that the flavors mix nicely. I then return the egg and spam to the pan. And then i mix them nicely together. After letting the flavors mix together, i end by adding a little bit of sesame oil. Only little bit though, you never want it to be stronger that anything else. I then finish by topping it with fresh green onions. And then it's done....\n\nI've grown up to eat my fried rice this way, my dad always made if on the weekends for breakfast, it was always a treat. He would also make some eggs and spam and we'd have a full on breakfast. Even though it may have had a high cholestoral count. But this is super good....:-D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2tee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T20:10:05.543Z",
                "reviewBody": "The meal I made was for my family of six.  This recipe has great!  It had awesome flavor.  It was colorful. I made it with help from my teacher(I homeschool). On Friday we cook.  I love chicken fried rice!  I'm 11 years old.  My name is Nanda S. Holler.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BATATATWO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-18T18:20:36.56Z",
                "reviewBody": "This is a very good recipe. Fried rice is supposed to be a great way to get rid of leftovers. So... to get the rice right... you do have to cook the rice first (preferably a day ahead) rinse it and chill it. The rice should not be overcooked and needs to be chilled when making fried rice. Also the sesame oil is very powerful. I use only a teaspoon or two along with regular oil. In keeping the spirit of getting rid of leftovers add leftover bits of veggies or meats from the week. I always add beansprouts. Fresh is best but I keep a can on hand just in case I can't get to the market.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-25T17:38:39.517Z",
                "reviewBody": "In my opinion, shrimp must go to the mix after veggies are done.  If you start cooking onions first they will also be mushy by the time carrots are done.  So this is the order that Chinese chefs use - I looked at them cooking numerous times:  cook rice to half done, let it cool.  In the wok heat oil with garlic, add carrots and celery. If the oil evaporates during frying, add a bit of water for veggies not to dry or burn.  When veggies are almost crisp done, add shrimp and chopped scallions, soy sauce and a bit of hot sauce.  After shrimp is turned pink, stir in rice.  When rice is hot, stir in egg (uncooked!  not cooked like someone here mentioned yack!).  Oh, and it only takes 20-25 minutes to make for me, including chopping veggies.  Enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10385689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T22:17:33.287Z",
                "reviewBody": "Out of all the recipes for fried rice I tried this one because I liked that it included sesame oil as an ingredient in addition to the soy sauce. I thought that would help for an authentic Asian flavor. Also, I like the flexibility factor of the ingredients. As recipe suggests, you can freely substitute for what you have on hand. I added scallions and garlic. And I used cut up beef hot dogs as the meat since it's all I had and I can't afford to use shrimp!! I omitted the celery since I don't often have it in my frig. I also made the rice a day ahead as I've heard is the best thing to do for fried rice. It came out very pretty to look at, and was very moist. My boyfriend says he would it eat \"again & again\" so I guess it's a keeper! The only thing I will do differently next time is possibly cut back on the soy sauce a little. Oh, one more thing...my boyfriend said it was better than his Mom's,  so I pretty much know that I've done something right! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONICA B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-24T15:15:29.067Z",
                "reviewBody": "There are several issues I had with this recipe.  Yes, technically, this is fried rice.  But, as has been stated in numerous other reviews, you should try to use rice that's left over, day old or longer.  It dries it out a little.  In a pinch, I have made rice, then spread it out onto a sheet pan and placed it uncovered in the refrigerator to dry for at least a few hours.  Certainly make sure you don't overcook the rice to begin with.  Another thing is that the shrimp gets very overcooked.  Cook it separately, remove it, add it back at the very end.  Sesame oil is not a cooking oil.  It's a seasoning oil. When subjected to high heat, it will burn easily.  And you should only use toasted sesame oil.  I add it with the soy sauce.  Fry with peanut, canola, or vegetable oil of some sort. Finally, there is no place in most average kitchens for medium-high or medium heat when stir frying.  Unless you have a very high output stove, (Almost nobody does at home) keep that burner on HIGH.  This is all supposed to be cooked as quickly as possible, searing and not steaming the food.  Don't overlook the recipe's suggestion to adjust the seasonings to taste.  Soy sauces vary in strength and salt content.  If the rice is too bland, add a splash of soy until it tastes right.  No salt is necessary because there's plenty in the soy sauce.  Black pepper is a must though.  Don't overcook the veggies and add some chopped green onions at the very end when you add the shrimp back to the rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Bennybbc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2731615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T17:30:18.357Z",
                "reviewBody": "I have tried many times to make fried rice and it has always turned out mushy and disappointing. This one was delicious though! The rice remained firm and it was a perfect amount of flavor with the onion, garlic and soy sauce. I omitted all meat and used onion, frozen peas and carrots and egg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PANANAKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/619296/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "House Fried Rice",
            "description": "Quick-and-easy fried rice loaded up with shrimp, ham, chicken, and veggies.",
            "uploadDate": "2013-12-26T18:53:26.287Z",
            "duration": "PT2M20.39S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd79faafb-965e-440a-a761-9dfc8f81431c%2F65162034-ec0a-4cd4-acc2-e80737520683%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2976302337001"
        }
    }
]