[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2270/main-dish/savory-pies/shepherds-pie/",
                    "name": "Shepherd's Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20098/american-shepherds-pie/",
        "name": "American Shepherd's Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F510282.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-06-16T22:09:42.000Z",
        "description": "This is an 'Americanized' version of that old standard, Shepherd's Pie.  My family loves it!  You can prepare your mashed potatoes as you normally would -- adding butter, milk, sour cream, whatever!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 - 2 quart dish",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "½ cup chopped onion",
            "½ cup chopped celery",
            "1 (10.5 ounce) can condensed vegetable soup",
            "½ teaspoon dried thyme",
            "3 cups mashed cooked potatoes",
            "1 cup shredded Colby longhorn cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C) and lightly grease a 2 quart baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium-high heat, stir and cook ground beef, onion and celery until juices run clear.  Drain. Pour mixture into baking dish with vegetable soup and thyme; stir well. Spread mashed potatoes on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 20 minutes.  Sprinkle shredded cheese on top and bake 5 minutes more, or until cheese has melted.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Shepherd's Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "EEYOREASIL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.272357723577236,
            "ratingCount": 492,
            "itemReviewed": "American Shepherd's Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "342 calories",
            "carbohydrateContent": "25.3 g",
            "cholesterolContent": "69.6 mg",
            "fatContent": "16.7 g",
            "fiberContent": "2.2 g",
            "proteinContent": "22 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "817.5 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-13T09:38:48.36Z",
                "reviewBody": "This seems to be one of those recipes where anything you want to throw into the pot is acceptable. As long as the end product tastes good, the endevour has been a success.  Several of the reviews mentioned that the \"pie\" was bland. This was my clue to expermient. So I put in some things to give it a kick.  First I added a can of cream corn (cause I really like corn) as several reviewers mentioned and I used mushroom soup instead of veggy soup, then three cloves of finely cut garlic. In the potatoes, I added milk and a LARGE tablespoon of creamy horseradish sauce (anything with the word horse in it should give it a \"kick\"). I added a dash or two of worchestershire sauce and a dash or three of garlic salt. I tossed in a can of white beans (this one gave it a real boost and I highly recommend concidering the beans as an additive). I also used more than the three cups of potatoes. I used three good sized russet potatoes. I have no idea what Colby longhorn cheese is, so I had some medium chedar that I used. The end product of this concoction was absolutely delicious! My wife, who is kinda pickey, had three helpings and I had four. Between the two of us we ate three quarters of the \"pie\" at one sitting!! This was really, really good and full of great flavors. Thank you Lisa for a great recipe idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROOKIE COOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-18T13:44:05.64Z",
                "reviewBody": "This is truly the best Shepherd's pie we've ever had! I more than doubled the recipe and used about 3lbs of hamburg. I used a little less thyme then it called for and used condensed golden mushroom soup. I totally forgot to add the onion and celery while cooking the burger, so I sauteed them in a little butter afterwards and added it to the burger & soup mix. I layered the hamburger, then corn, then the potatoes and WOW, it was so good! There were 4 adults (very hungry ones!) and the entire 9x13 pan was gone. My dad said it was the best he ever had...even better then my mom's (which is saying a lot!) I'm making it again for Sunday football...hope there's enough! Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLGRAFIX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1049137/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T01:21:02.64Z",
                "reviewBody": "I love shepherd's pie, but the rest of my crew could probably do without, so this review is all my own. I like this recipe becasue it is your \"basic\" shepherd's pie recipe, so you can add or take away what you like. I spruced up my meat mixture a little more by adding chopped bell pepper, canned tomatoes and garlic to my ground meat.  It makes it a little heartier, and  I like to flavor my mashed potatoes with some garlic and onion powder.  I don't measure out the cheese...I just throw lots and lots on top. I would definitely recommed using this recipe as your foundation, and then play around with it. Thanks Lisa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T04:43:24.453Z",
                "reviewBody": "Discovered this recipe a while back, and this has become one of our favorite dishes. I add at least another onion and tons of garlic to the browning meat. I also use lots more vegatables (frozen stir-fry veggies give it a fun, interesting, and easy boost) and two cans of vegitable soup because I make a big bunch of it. I always use instant pototoes (SO much faster than the other kind and I can't really tell a differenc) and pour on the thyme because I love the unique flavor. I also pile on the cheese--because I love it! My family loves this, and I make enough to have leftovers. The best thing, though, is that you can totally change/add/remove anything you want!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLEYJANE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T01:21:31.2Z",
                "reviewBody": "This was delicious.  As I was using 1 1/2 lbs. ground beef, I increased the onion to 2/3 cup and left the celery at1/2 cup.  Just make sure celery and onion are cooked through.  I also used two cans condensed vegetable beef soup and I added about a cup of frozen peas and carrots, which I cooked first.  I only sprinkled on a little bit of thyme.  Used lots of potatoes.  Family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanette Gettings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T04:46:25.42Z",
                "reviewBody": "I never even heard of Shepard's Pie, but I thought I'd give it a try. The recipe has turned out great every time I've made it. I've even made it with boxed mashed potatoes and it still has a lot of great flavor. I personaly add a few more spices to the ground beef, throw in more veggies and use a blend of cheddar/munster cheese on top instead of Colby. It really fills you up and is great for those of us who have very little time to cook. Even my sister-in-law, who is a chef, liked the recipe. Thank you !!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GECKOGIRL_CMT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-09T14:58:18.373Z",
                "reviewBody": "I didn't like the version of this with the vegetable soup and it didn't go over well with my family. I'll stick with cream of mushroom soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "FIRE2HEART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T04:42:45.217Z",
                "reviewBody": "Heavy but tasty. I used instant potatoes and added carrots and frozen peas. I ve never heard of colby longhorn cheese so I used colby jack. After my additions this made about eight servings. It reheated well as leftovers. Next time I will try cream of mushroom soup instead of the vegetable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRAPHITE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/635264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-03T20:25:57.56Z",
                "reviewBody": "This recipe was fantastic. I changed it just a little.I left out the thyme and added cajun spices and italian seasoning to the ground turkey while browning it. I also added 1 cup beef broth along with the veg. soup. I used monterey jack with jalapeno peppers. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BIKERBABE_NC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/746392/"
                }
            }
        ]
    }
]