[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/530/pasta-and-noodles/noodles/",
                    "name": "Noodle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21476/edible-spiders/",
        "name": "Edible Spiders",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F24248.jpg",
            "width": 2080,
            "height": 1368
        },
        "datePublished": "2000-09-19T12:19:30.000Z",
        "description": "A cute Halloween snack that is fun for kids to make and eat. Marshmallows grow chow mein legs and and candy coated eyes.",
        "prepTime": "P0DT0H30M",
        "cookTime": null,
        "totalTime": "P0DT1H0M",
        "recipeYield": "24 spiders",
        "recipeIngredient": [
            "1 cup semisweet chocolate chips",
            "1 teaspoon butter",
            "24 large marshmallows",
            "1 (6 ounce) package chow mein noodles",
            "1 (12 ounce) package mini candy-coated chocolate pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a microwave-safe bowl, combine chocolate chips and butter. Microwave until melted. Stir occasionally until chocolate is smooth. Pour chocolate into a sealable plastic bag and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a cookie sheet with wax paper. Stick 4 chow mein noodles into each side of marshmallow for legs, and arrange on wax paper. Using scissors, cut one corner off the bag of melted chocolate. Drizzle over the marshmallow spiders. Attach 2 candies to each marshmallow for eyes. Chill until chocolate hardens.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Noodle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brenda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5348837209302326,
            "ratingCount": 43,
            "itemReviewed": "Edible Spiders",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "165.1 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": "2.5 mg",
            "fatContent": "7.7 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "48 mg",
            "sugarContent": "16.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-29T00:52:08.24Z",
                "reviewBody": "Instead of drizzling melted chips over marshmallows try melting chips with a small amount of cooking paraffin. Keep this mixture on low heat after melted jab each marshmallow with a fork and hold over pan. Drizzle this mixture over marshmallows drop onto wax paper & fill in tong marks on top of marshmallow with small amount of mixture. This way you have more control over how the chocolate covers the marshmallows.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "K-SANDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/479434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-28T16:15:38.797Z",
                "reviewBody": "These treats were great. I didn't use the bag or the butter. Instead I used shortening with semi-sweet & butterscotch chips which gave a great finish to the spiders. Definitely enjoyed by all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathryn Schilling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1507881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T20:59:34.45Z",
                "reviewBody": "My (almost)4-year old daughter and I made these last night to take to an Assisted Living facility where the kids were going to visit for Halloween - she helped me \"stuff\" the legs on (great chance to practice counting!)while I did the chocolate part. I had a difficult time with the chocolate not being easy to spread/squirt out of the bag - it got thick despite my adding more butter and even some milk. I ended up patting it on top joking that it looked like a toupee. Used peanut butter chips for the eyes (the color matched the legs!)and they really did look cute! Lots of \"oohs and aahs\" from the children and residents: )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-29T17:34:30.17Z",
                "reviewBody": "I made these for my twin 5 year olds' Kindergarten Party at school. The kids all loved them! Of course I did make some changes to the recipe... I used 1 bag of milk chocolate morsels and one bag on butterscotch morsels melted together in the microwave 1/2 a pretzel stick for each leg mini M&Ms for the eyes and only about 1/2 of a large marshmallow for the body. I put a dallop of chocolate on waxed paper added the pretzel legs (so they stuck out of the chocolate) and added the candy eyes then transferred to the freezer for a couple of minutes to harden (it doesn't take long). After they were set (they looked like smooshed spiders-reminded me of the spiders in the Garfield comic strip after he smacks them with a newspaper!) I dipped a 1/2 a marshmallow in chocolate and set it on top of the \"smashed spider\" (not covering up the eyes though!) which then gave it a \"puffy spider\" look. It was rather time consuming but it was worth it because the kids really enjoyed it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Meg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/869411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-26T05:01:01.38Z",
                "reviewBody": "I made this for my Cub Scout pack meeting for Oct. They were a huge hit. They turned out so cute. They did take a long time to make. I started to use the chocolate chips in the bag but it did not work good at all. Luckly I had Almond Bark. I turned it on low and it worked beautifully. I poked the marshmallows with a toothpick and dipped. I did take the extra chocolate off with the second toothpick. I just smoothed the chocolate over the hole and it looked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELISSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1223782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-28T01:42:47.327Z",
                "reviewBody": "I only give this 2 stars because while it was a cute little idea it didn't work out quite like it claimed it would. After melting the amount of chocolate chips and butter that it called for the chocolate was thick like frosting and would definately NOT drizzle. I had to add much more butter and a little creamer to make it drizzle better. And putting the chocolate in the bag to be drizzled was NOT a simple task either. It got all over the zip seal and the bag didn't close properly and ended up exploding. I think the ingredients need to be altered and maybe a gallon ziploc bag should be suggested so that it is large enough that if it won't seal it's not going to shoot chocolate everywhere when you try to use it as a squeeze bag. However I do want to say that I made these for my toddler's daycare class and I was the only mother who actually made something for the party instead of buying a bag of candy to pass... the toddlers LOVED them! So in the long run it was worth the hassle;0)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mattieannsmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-28T18:26:55.967Z",
                "reviewBody": "This was time-consuming very messy but fun treat when preparing for Halloween. I used a couple TBLS of butter and using a knife dipped each marshmellow into the melted choc./butter mix. Luckily I had a whole \"assembly line\" of hands ready - my boyfriend attached pretzel sticks for the legs and my daughter added the M&M eyes. I might take the butterscotch chip suggestion into review if I ever decide to make these treats again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-01T18:27:42.183Z",
                "reviewBody": "My husband made these for our sons school Halloween party yesterday (while I was making the black cat cookies off of this site). These tasted awesome and looked terrific. He squished the marshmallow a bit for a more realistic body. I didnt pick up any mini m&m's thinking I could use frosting at the end. It would have worked. Instead of running out my husband hand rolled little bits of taffy into 48 little eyeballs. I figured trying to drizzle the chocolate would make a complete mess so I put the chips in a double boiler along with some candy wax and dipped them with. It went rather quickly that way. They were awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-10T11:52:10.61Z",
                "reviewBody": "So cute! These were a hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Casey Carter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/817482/"
                }
            }
        ]
    }
]