[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21862/barbecue-beef-cups/",
        "name": "Barbecue Beef Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F17353.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2000-10-04T03:38:47.000Z",
        "description": "This is a quick and easy recipe given to me by a friend.  My family loves it.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "¾ pound lean ground beef",
            "½ cup barbeque sauce",
            "1 tablespoon dried minced onion",
            "1 (12 ounce) package refrigerated biscuit dough",
            "⅓ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Grease the cups of a muffin pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large heavy skillet over medium heat, cook beef until evenly brown. Drain excess fat. Stir in barbeque sauce and dried onion. Simmer for a few minutes over low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Flatten each biscuit, and press into cups of the prepared muffin pan. Make sure the dough comes to the top of the pan. Spoon a portion of the meat mixture into each dough cup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 12 minutes. Sprinkle with cheese, and bake for 3 more minutes.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.380541871921182,
            "ratingCount": 812,
            "itemReviewed": "Barbecue Beef Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "353 calories",
            "carbohydrateContent": "32.4 g",
            "cholesterolContent": "45.8 mg",
            "fatContent": "17.2 g",
            "fiberContent": "0.6 g",
            "proteinContent": "16.5 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "874.3 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-29T22:56:53.357Z",
                "reviewBody": "We really liked this recipe.  I paid attention to the other reviews and added my own twist to it.  After filling the muffin cups with dough, I baked the dough by itself for 2 minutes before adding the beef filling.  This made sure the entire bottom was firm and cooked thru.  I added chopped onion, green pepper, garlic, crushed red pepper, worstechire sauce, prepared mustard, honey, and hot sauce.  I mixed the cheese in to the beef mix.  This made it turn out kind of like a sloppy joe.  It tasted great!  Also, I used butter crescent rolls, and the cup was perfect!  This is a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dani",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T04:01:58.56Z",
                "reviewBody": "My husband and I did not care for this. Maybe it was the type of biscuits we used (grands flakey buttermilk). BUT This works great with scrambled eggs sausage pieces and bits of bacon inside them smothered with white gravy and topped with cheese. It's a great new way to biscuits and gravy! We call our creation \"breakfast in a biscuit\".:) I give that one 5 's!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ARMYWIFECA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1346727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-19T16:27:21.187Z",
                "reviewBody": "We had these for dinner tonight and they were really good!  They were similar to another recipe I had tried before but these were much better!  I used Grands® reduced fat biscuits and they were the perfect size for my muffin pan.  I think almost any type of filling can be used for some variety.  I'm planning on making this again but with a tuna salad filling instead of the ground beef and bbq sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "YUMYUM123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-12T21:37:12.247Z",
                "reviewBody": "I brown 1lb ground beef with 2 diced onions , and add a 16 oz jar of honey bbq sauce, and a can of niblet corn.  I mix about 2-3 cups of shredded cheddar and or jack cheese in the meat mix before filling cups.  I make 16 \"cups\" from 8 jumbo flaky biscuits. My kids call them barbeque cupcakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OLDBATTLAX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-13T17:08:28.467Z",
                "reviewBody": "I use bread instead of dough and it has a better flavor. Cut the crusts off and butter the side of the bread that is going into the cups. I also use Tomato soup and 1/2 cup of ketchup instead of BBQ sause. The kids love them and they freeze well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTINE1996",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1398441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T17:53:45.75Z",
                "reviewBody": "You can be very creative with these. I added a lot of bbq sauce corn chopped onion and green pepper and some spices. Next time I will give it even more flavor. I wouldn't use the larger biscuits. They don't leave much room for the meat. I agree with some of the other reviews. You could modify this recipe to any style - pizza cups (meat cheese pizza sauce) breakfast (egg cheese bacon); buffalo chicken (shredded chicken hot sauce mixed with cream cheese and ranch); even dessert (replace biscuits with cinnamon roll dough and add apple pie filling)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bezick2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3021644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-06T16:44:50.29Z",
                "reviewBody": "This was absolutely delicious! The filling is so good but I did a few things differently with the recipe. First I did not use store bought biscuits. I made homemade ones using the Never Fail Biscuits recipe also found on this site. I diced up fresh onions and sauted them with the beef instead of the dried onion. Also when the meat was simmering with the bbq sauce I grated some cheese into the mixture. I couldn't wait to taste these as they smelled so yummy all through the cooking process. I still put grated cheese over them even though I added a little into the beef filling. As I stated before they were great! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne J.R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-12T01:26:24.263Z",
                "reviewBody": "Easy and fun for kids to help make. My Mom gave me this recipe after she made it for my kids years ago to their rave reviews. They loved it then and now at 17 and 19 they still ask for it. We put 1 Tablespoon brown sugar in the meat mixture. To make them a little more meaty use a full lb. ground beef. If the mixture seems dry I often add more BBQ we always use regular refrigerated flaky biscuits fresh onions and maybe a little more cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PYTNPLACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/484714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-16T03:15:36.623Z",
                "reviewBody": "Very good!  Much better than I expected!  When I was reading the recipe I was thinking that plain ground beef cooked with BBQ sauce needed something more, so here is what I did:\nI melted 1 tablespoon of unsalted butter in a skillet, and browned 2 cloves of minced garlic, and one sweet yellow onion which I had finely chopped.  Seasoned well with kosher salt and fresh ground black pepper, and cooked till the onion was very soft.  I then added about a tablespoon of brown sugar, and let the onion and garlic carmelize a little more.  Added 1 lb. of 90% lean ground sirloin to the onion/garlic, and cooked JUST till no longer pink.  Drained off any excess grease with a spoon (wasn't a lot).  Then added probably more than a cup of my favorite bottled BBQ sauce, and let simmer maybe 10-15 minutes.  Right before spooning the beef into the biscuits I added about 1/2 a cup of grated cheese and mixed it in to the beef mixture.\nUsed 'Grands Flaky Layers' for the biscuits, and a pre-shredded colby/jack blend for the cheese.  Ended up baking them for about 20 minutes total, but they got nice and brown.\nThese would be fantastic for poker night or a superbowl party, as you really can carry them around and eat without any utensils!\n\nI'm thinking that all kinds of combinations would be good....greek seasoned ground turkey topped with feta cheese maybe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Wiens Craddock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707132/"
                }
            }
        ]
    }
]