[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/756/desserts/candy/mints/",
                    "name": "Mints",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24067/peppermint-patties/",
        "name": "Peppermint Patties",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F583884.jpg",
            "width": 1304,
            "height": 1304
        },
        "datePublished": "2018-03-21T16:17:14.000Z",
        "description": "I have made these every year as one of many Christmas treats. My family really loves them, it wouldn't be Christmas without them!  When you dip, tap the fork on the edge of the pan to shake off excess. Slide the patty onto waxed paper --  you can use the fork to make a little swirl on the top to make it pretty.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H55M",
        "recipeYield": "28 patties",
        "recipeIngredient": [
            "¾ cup sweetened condensed milk",
            "1 ½ teaspoons peppermint extract",
            "4 cups confectioners' sugar",
            "3 cups semisweet chocolate chips",
            "2 teaspoons shortening"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine condensed milk and peppermint extract.  Beat in enough confectioners' sugar, a little at a time, to form a stiff dough that is no longer sticky.  Form into 1 inch balls, then place on waxed paper and flatten with fingers to form patties.  Let patties dry at room temperature two hours, turning once.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over low heat, melt chocolate with shortening, stirring often.  Remove from heat.  Dip patties, one at a time, into chocolate by laying them on the tines of a fork and lowering the fork into the liquid.  Let cool on waxed paper until set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Mints"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PATTY STOCKTON"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.489795918367347,
            "ratingCount": 245,
            "itemReviewed": "Peppermint Patties",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "182.6 calories",
            "carbohydrateContent": "32.9 g",
            "cholesterolContent": "2.8 mg",
            "fatContent": "6.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "12.6 mg",
            "sugarContent": "31.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-05T16:22:20.4Z",
                "reviewBody": "After experimenting with this recipe a few times, and reading the tips from other reviewers, I think I have it down.  Here is what I have come up with to make the recipe easier to work with.  For starters, I mix everything in my kitchen aid mixer.  I find that I need 1/2 cup less sugar then the recipe calls for to get the perfect consistancy.  When the \"dough\" is combined well I roll it out on a cookie sheet lined with parchment paper and put it in the freezer for about 1/2 hour.  (NOTE: If you are going to do patties it is actually easier to leave them at room temperature to harden up because the frozen dough reacts too quickly with the hot melted chocolate and breaks down very easily.  The room temperature dough does not react as quickly and therefore does not break down very fast.) Another problem I ran into was getting the chocolate mixture to be the correct consistancy.  I found it was easier to work with if it is more liquid like - done by adding a very small amount of milk or cream.  Once the chocolate is the correct consistancy I brushed it onto the rolled peppermint mixture and returned it to the freezer.  I then applied a second coat after the chocolate had set and again returned it to the freezer.  Flip it over and repeat.  Once the whole thing is set it is very easy to cut it into squares or even to use a round cookie cutter to make circular shapes.  The candy is to die for and worth all the work involved in its creation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "J Marcy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/524470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T06:56:21.75Z",
                "reviewBody": "This was a great recipe! I used peppermint oil instead of peppermint extract, and the first time I made this, I thought that they were the same thing.  But now that I've learned that oil is about 100 times stronger than extract, I've made it again and it tastes heavenly.  If you ever use peppermint oil, three drops is plenty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BETSYVVV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T01:40:06.233Z",
                "reviewBody": "Will definitely make again! But here's a tip: freeze the patties first before dipping them in the chocolate and don't make them much wider than your fork. I had problems with them becoming soft when dipping them in the heated chocolate. A few fell apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEET BABOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-18T22:44:11.45Z",
                "reviewBody": "I used a combination of this recipe and the Eagle Brand one summitted here, as I wanted to use a whole can of condensed milk.  This makes a lot of patties!  This combination of condensed milk and powdered sugar is just the best!  It makes a fantastic dough which is really easy to manipulate.  Rather than form them into balls individually, I roll out the dough and cut out the patties with a cookie cutter.  You can stick to rounds or use something pretty like a heart.  I definitely recommend following the suggestion to freeze before dipping in chocolate.  I'll never buy peppermint patties from the store again - these are great and far cheaper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARA-S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-23T07:32:27.083Z",
                "reviewBody": "I changed it a little and It made it SOOO easy and much cleaner! I simply put a little chocolate on the bottom of a cupcake liner and then put in the peppermint patty (after I froze them for 5min) then added a little more chocolate. Froze again for 5mins. They came right out of the liners and all had pretty designs! I used the renolds foil cupcake liners, they seemed to work better than regular cupcake liners!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsGossman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8183387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T08:46:08.247Z",
                "reviewBody": "These are the BEST! I've been making these for 5 years now and have given them away in gift baskets along with the recipe on a nicely decorated recipe card for Christmas. What a HIT!  They are so light and refreshing for an after dinner sweet. Served best directly from the freezer.  Also a couple of tips...when kneading the dough use powdered sugar on the silpat or countertop NOT corn starch and do not cut the sugar as it changes the consistency and makes it much harder to dip successfully.  When the chocolate starts to get lumpy from cooling reheat and add a little more shortening until smooth again.  I find it easier to dip \"frozen\" patties with tongs rather than forks, just don't submerge patties for too long and you can always cool and double dip for better coverage.  These goodies are worth their weight in gold so don't get discouraged or give up! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PokerMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1692154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T03:37:26.17Z",
                "reviewBody": "The patties themselves (w/out chocolate) were excellent! May I suggest to make smaller rather than larger patties. If they are large they won't dry enough on the outside and will break when you hold them for more than a few seconds. My reccomendation: Instead of dipping these (they melt in the pot) freeze them and then brush the melted chocolate onto them with a basting or pastry brush. Then flip and repeat when dry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2145088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-26T08:23:46.093Z",
                "reviewBody": "JUST like York patties. Great texture. I added extra peppermint extract...almost a whole teaspoon more. Gave it the perfect strength. Also had a TOUCH of almond extract in it...people like that. Tip: make the patties really small like only an inch when flattened. Better in smaller doses. Also add paraffin to chocolate for sheen. Freeze after. Best served \"frozen\" The peppermint mixture WILL NOT FREEZE. So don't bother trying to get it to for easier dipping. Use a slotten spatula for dipping. LOVE THEM",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Theresa's Cookin'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1940451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-06T19:44:23.45Z",
                "reviewBody": "I have made this recipie as christmas gifts for the past two years - everyone loves them! They keep in the fridge or freezer for a long time - so they can be made ahead of time. I found using an electric fondue pot to keep the chocolate melted while doing the dipping works really well - just make sure you keep the setting on low!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katrina Colleen Wilken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1115243/"
                }
            }
        ]
    }
]