[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24610/onion-rings/",
        "name": "Onion Rings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4583046.jpg",
            "width": 3348,
            "height": 3347
        },
        "datePublished": "2018-03-21T16:18:18.000Z",
        "description": "A slightly sweet batter makes these crispy rings extra special and delicious! You may want to double or triple the recipe.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 quart oil for frying",
            "1 cup dry pancake mix",
            "1 large Spanish onion, sliced into rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large, deep skillet over medium high heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare pancake mix according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "One at a time, dip Spanish onion rings into the prepared pancake batter, then into the hot oil. Fry until crispy and browned, about 3 minutes. Drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "T"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.442857142857143,
            "ratingCount": 280,
            "itemReviewed": "Onion Rings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "329.6 calories",
            "carbohydrateContent": "29.1 g",
            "cholesterolContent": null,
            "fatContent": "22.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "485.1 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-02T13:51:38.873Z",
                "reviewBody": "Fun recipe. I had just bought a huge bag of \"just add water\" pancake mix from my warehouse store and wanted to find some other way to use it up. I heated up my electric fryer to 350 degrees F. I added a few teaspoons of spicy powdered seasoning until the mix was slightly pink (I used Old Bay but I have tried Cajun Curry and Seasoned salt and pepper too. I dredge chunks of food in the dry mix and set aside. I then mix a little beer into the dry mix to make a thin batter re-dip the food in it and then drop them gently one at a time into the hot oil. I fry until the food floats and turns deep golden brown. The oil stays clear because the batter sticks to the food holds up really well to heat and complements a variety of flavors. Try it with chunks of chicken seafood eggplant carrots onion rings squash bell peppers cheese stuffed jalapenos peapods green beans hot dogs broccoli cauliflower etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-03T13:32:12.967Z",
                "reviewBody": "I felt that this recipe required some seasoning so I added my usual garlic and onion powders, a special blend of bread dipping spices, hot sauce and I replaced the liquid with beer. Even though I dressed this up a bit, I'm still giving this recipe five stars because using pancake mix is ingenious. I used Bisquick. I also floured my onions first to help the batter adhere. For those who mentioned that their onions were greasy probably did not have the oil at the right temp. It should be about 350 degrees. A simple candy thermometer will help with that. My family loves onion rings but rarely orders them in a restaurant because they hate how the onion always slides out from the coating. Amazingly, this did not happen (maybe due to the flour coating) and my gang said that these were the best rings they had ever eaten. Can't thank you enough \"T\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-21T17:50:29.59Z",
                "reviewBody": "This batter was really good. I coated the rings in the dry pancake batter to start with and then put them aside. Then I used 1 cup of beer in place of the liquid and added lots of seasoned salt. Then when they came out I sprinkled with salt. The only problem was that I set the stove at med/high heat and it was way too hot. The rings became too browned after cooking only 10 seconds. Even after I turned the dial down to 4 they were coming out the same way. I had to stop frying them because my whole kitchen was filled with the smoke that was coming out from inside the pot and the smell of onion rings has still not gone away after 15 hours (and I've kept my windows open all night) I would not make these again unless I used a deep fryer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:00:46.293Z",
                "reviewBody": "Are there even words to express how GOOD these are? we are a family of 9 and we all loved these. I have never made onion rings before.I had a bunch of brown onions and needed to use them up.I used buttermilk pancake mix that said to mix with water not milk.I added some salt pepper and seasoning salt.Love at first bite.Somebody pinch me...have I ever tasted anything so good?My 12 yr old screamed when she ate these! I added too much salt to the second batch...had to throw them away...better go easy on the salt you can always salt them when they are done. These are the bomb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CTR7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/493613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T10:45:19.42Z",
                "reviewBody": "Not bad but not great. The batter coated and stayed on the onions well. This is my first time deep frying but the recipe worked well. It lacked any real flavor it tasted just like the recipe says. I liked the slightly sweet flavor but everytime I had a bite I couldn't help but think it was lacking spices. I probably won't try this exact recipe again but may try and \"imprve\" it by replacing the water with beer and adding salt pepper and maybe some additional spices. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SAVANNAH0410",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-06T17:33:02.483Z",
                "reviewBody": "WOW!! I used Krusteez pancake batter and it was perfect! It didn't even need salt. I used the batter for french fries and that was awesome too but with potatoes it did need some seasoning. I will never have to order onion rings again! Super Super Super! (Do make sure your oil is hot enough--mine got cool at one point and the rings were greasy and spongey and yuck--as soon as the oil returned to the right temp they were perfect again!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3DJBEADS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1252146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:00:47.373Z",
                "reviewBody": "I was so excited to see that pancake mix was used in this. I'd never thought of it and I have struggled for years to get my batter just right and now I can say NO MORE STRUGGLING. I used this recipe and added a little season-all for a spicy kick. WOO HOO.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VERLUGHMINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T07:07:19.107Z",
                "reviewBody": "My kind of recipe! I used Krusteaz Buttermilk Pancake Mix that only needs water added. Even my husband liked these and he is not usually a fan of onion rings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:00:45.327Z",
                "reviewBody": "These were so easy and yet so good! I used buttermilk pancake mix and I didn't have enough milk that the box called for so I used evaporated milk for the rest. I also added some salt and pepper to the batter. Most of my children don't eat onions or onion rings but they all went for these!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMMSEJS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/755603/"
                }
            }
        ]
    }
]