[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/751/desserts/candy/truffles/",
                    "name": "Truffle Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24691/basic-truffles/",
        "name": "Basic Truffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F529419.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2018-03-21T16:18:27.000Z",
        "description": "This is a basic truffle filling to which you can add your own flavorings or extracts. You may use this to fill the chocolate shells you make using candy molds or roll into balls then into powdered sugar, cocoa, sprinkles or other toppings",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "35 truffles",
        "recipeIngredient": [
            "12 ounces bittersweet chocolate, chopped",
            "⅓ cup heavy cream",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, combine chocolate and cream. Cook, stirring, until chocolate is melted and mixture is smooth. Remove from heat and whisk in flavoring.  Pour into a small dish and refrigerate until set, but not hard, 1 1/2 to 2 hours. Use to fill candies or form balls and roll in toppings.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Truffle Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gina Mork"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2748091603053435,
            "ratingCount": 131,
            "itemReviewed": "Basic Truffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "61.8 calories",
            "carbohydrateContent": "5.6 g",
            "cholesterolContent": "3.5 mg",
            "fatContent": "4.1 g",
            "fiberContent": "0.7 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "1.4 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-08-07T23:20:55.333Z",
                "reviewBody": "I made this recipe up to take to work with me for the office Christmas Party. The first batch I made I added some orange flavoring to it and it turned out well. However I wanted Irish Cream Truffles when I made it the second time around. I didn't want to go out and purchase a 13 bottle of Irish Cream liqueur (we don't drink) so I decided to substitute those new flavored creamers for the heavy cream. You wouldn't believe it but it worked out so wonderfully!!! These are easy to make and it's a wonderful basic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VICTORIAP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/540664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-18T02:03:17.42Z",
                "reviewBody": "This is a great basic recipe.  Anyone that complains about the taste of the chocolate is overlooking one HUGE point: If you start out with cheap chocolate you will get a truffle that tastes like cheap chocolate, or just doesn't work.  A higher quality chocolate will yield a better truffle.  Also, the less actual chocolate in the chips the more problems you will have getting them to the right consistancy.  One more point-If you don't care for bitter sweet chocolate, don't use it.  That's why there are so many varieties in the baking section.  I recommend Guittard, in my mind the best you can buy before Godiva.  Ghriradelli is good as well, but the Guittard has a richer, more European taste (since it is).  They cost a bit more, but you won't believe what you'd get!  Much cheaper than Godiva!  PS- I apologize for any spelling errors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Z",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-02T04:00:03.2Z",
                "reviewBody": "I used 3/4 c. cream as dictated by the traditional truffle recipe.  Instead of the vanilla, I used 3 Tablespoons (yes big T!) of Kahlua.  Oh my gosh--so good!  If you have trouble rolling, definitely leave in the refrigerator for another hour or so.  It will make it much much easier.  Once you coat with cocoa powder, let it sit for a few minutes.  Then re-roll (the topping makes it less sticky) in order to make a good shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MedMimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-16T00:38:05.237Z",
                "reviewBody": "i Have made this recipe for years with great reviews. my secret is to make this recipe and let sit in refrigerator with saran wrap for a week or so it give it a creamier texture and the flavor is much more intense",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Babydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2577477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-25T19:00:30.75Z",
                "reviewBody": "Excellent but extraordinarily time-consuming. I created a batch using the recommended amount of whipping cream and it turned out really well. I also tried using the amount suggested by another reviewer (quite a bit more) and the batch did not turn out. I froze the chocolate/whipping cream mixture and it still melted easily when dipped in chocolate. I couldn't even coat it with chocolate. I would stick to the original recipe next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allrecipesrocks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2579354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-03T11:03:45.093Z",
                "reviewBody": "This was my method: I used 1 & 1/4 cup or so Ghirardelli semi-sweet chips 2/3 cup heavy cream 2 tbsp unsalted butter and the vanilla. I made several flavors but quite a few people concurred that the vanilla/peppermint was the best. I rolled them in powdered sugar rather than attempting to coat them with a shell (impossible for me!) Freezing the blobby little melon-baller scoopings for a half hour and rolling with my hands after that was the only way they came anywhere close to attractive. I gave them to tons of family this Christmas and everyone loved them. (My brother in law especially he must have asked at least 4 times if I was absolutely sure they were all gone- I think he searched my fridge for good measure just in case I was holding out!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLEGREYKITTEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/361142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-17T17:49:36.653Z",
                "reviewBody": "I am no expert at making candy, in fact this was the first time I ever attempted it.  It was so easy to make these, and it took me about 4 hours to make 200.  I made 6 different varieties, and they were all great.  I made the regular recipe, coconut with coconut extract instead of vanilla and rolled in toasted coconut, mint made with mint extract and rolled in crushed peppermint candies, almond made with vanilla extract but with toasted almonds in the chocolate and rolled in raw crushed almonds, raspberry vanilla (this variety required 1 tsp vanilla and almost 2 tsp raspberry extract), and mocha, which I made by blending some flavored coffee powder into the chocolate mixture and rolling in a blend of the coffee and cocoa powder.    A few hints: save yourself some grief and buy a chopper (I used mine for the chocolate, candies, and nuts).  Have the chocolate, cream, and extract ready before you begin melting the chocolate.  It is easiest to roll and cover the chocolate if you wait until the chocolate has set firm.  Then scoop the chocolate, warm it in your hands, and roll into ball.  Also, I was very concerned it would be difficult to get the toppings to stick- it was actually very easy for them to stick.  I hope this review helps.  It was actually kind of relaxing to make these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Shadbolt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1647000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-31T15:30:36.78Z",
                "reviewBody": "This is an excellent recipe that makes a quick and elegant dessert. I dipped my truffles in melted white chocolate and rolled some in chopped nuts. I took them to a party and people loved them! These also freeze well for a great dessert to keep on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSAN ELLIOTT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/468467/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-22T19:57:12.06Z",
                "reviewBody": "These truffles were too bitter. Truffles using semi-sweet chocolate are better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504592/"
                }
            }
        ]
    }
]