[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24683/spicy-mexican-torte/",
        "name": "Spicy Mexican Torte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F658188.jpg",
            "width": 1024,
            "height": 768
        },
        "datePublished": "2018-03-21T16:18:26.000Z",
        "description": "This is a great recipe my husband loves to make - it's a whole meal in it self and very simple to put together. Serve with salsa, sour cream, or guacamole if desired.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound chorizo sausage, casings removed and crumbled",
            "1 cup chopped onion",
            "2 cloves garlic, finely chopped",
            "1 (4 ounce) can chopped green chile peppers, drained",
            "8 (10 inch) flour tortillas",
            "2 cups shredded Pepper Jack cheese, divided",
            "1 (16 ounce) can refried beans, divided",
            "1 (7 ounce) jar roasted red peppers, drained"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet or frying pan, cook chorizo, onion and garlic over medium heat. Cook, stirring occasionally, until sausage is done. Drain off grease, stir in chilies and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 10 inch pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 2 tortillas in pie plate. Spread half of the sausage mixture over tortillas.  Sprinkle with half of the cheese.  Place 2 tortillas on top of cheese.  Spread with beans.  Place 2 tortillas on beans and place peppers on tortillas.  Place 2 tortillas on top of peppers.  Spread with remaining sausage mixture.  Sprinkle with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake in preheated oven for 40 minutes.  Uncover and bake 15 minutes more,  or until cheese is melted and center is hot.  Cool 10 minutes before cutting.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Tsfoust"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.347368421052631,
            "ratingCount": 95,
            "itemReviewed": "Spicy Mexican Torte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "682 calories",
            "carbohydrateContent": "51.7 g",
            "cholesterolContent": "89.8 mg",
            "fatContent": "38.7 g",
            "fiberContent": "6 g",
            "proteinContent": "30.4 g",
            "saturatedFatContent": "15.7 g",
            "servingSize": null,
            "sodiumContent": "2074.1 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:52:12.467Z",
                "reviewBody": "This was good! Pay attention to the instructions since it neglected to tell you about the second layer of beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Luvs2Cook!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-15T17:34:28.78Z",
                "reviewBody": "This was GREAT! I used two tortillas on the bottom and only one between the other layers. I probably will only use one on the bottom next time. I also omitted the red pepper and it turned out just fine. It has a nice \"kick\" to it and even my husband liked it (he's very meat and potatos). Next time I might try some Rotel tomatos with chilis mixed in with the chorizo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRAISELDR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/414042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:59:02.99Z",
                "reviewBody": "This recipe is great. I used turkey sausage to omit some of the fat; turned-out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-24T19:06:46.65Z",
                "reviewBody": "I gave the basic recipe 4 stars as I always change things as I try them based on our preferences. Anyhow I cooked the chorizo with the garlic and onions then when almost done I added a can of black beans drained but not rinsed. After they got a little tender I then added our own homemade salsa very spicy and that became my sausage mixture for layering. I also used Mexican \"melting cheese\" instead of pepper jack and mixed in a little cheddar. Lastly I fried my tortillas and layed 2 of them out side by side in the bottom of a glass casserole dish no problem cutting them as others had mentioned. From there I followed the directions for cooking ended up with three layers not really \"torte\" like but turned out very good topped it off with a little sour cream we loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Hofstatter Noftz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/320423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-09T01:12:45.23Z",
                "reviewBody": "I 1st have to give out a shout to \"mauigirl\" for emailing me this recipe when she found out I was making the \"Tweaked Homemade Chorizo\"recipe from the site...I totally am glad I made this. It was wonderful. I had a few little bumps in order to stay to a T with this recipe. But it wasn't something I was looking to tweak at all. But it was worth the 4 days I had to wait on the chorizo to try this. It's excellent. My hubby got the wrong size tortillas and after a suggestion from mauigirl I did the same as she did. I used a springform cake pan it was just awesome doing that...note to others: better then a pie plate and more presentable. Layers hold up better and you can easily put thing in evenly. So I had the 12-in tortillas and I knew the mixes & toppings wouldn't accomendate. So I used the whole batch of the chorizo recipe increased the onions 1/2 cup garlic to 4 cloves cheese by 1 cup more refried beans 1/2 a can more and well I didn't have enough roasted red peppers so I accomendated with 1/2-3/4 cup of mild chunky salsa. It turned out awesome. I could have reduced the amount of tortillas to 4 as my opinion. And I think I'd totally try it with corn tortillas too. hmmm. Thank you. It was fabulous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T17:33:49.923Z",
                "reviewBody": "I have a healthier version from a long ago Family Circle recipe. It's meatless which is great for going vegetarian. I've been making it for years and my picky daughter liked it too. Preheat your oven to 374 and heat a bit of olive oil in a cast iron skillet. Chop an onion add it to the skillet & saute for 5 min or so add 3/4 C. frozen corn kernels and saute another 5 min. until lightly browned. Then add 1 tsp of dried oregano 1/4 tsp of ground cumin and a crushed or chopped garlic clove and saute for a minute. Add 2 Tbsn flour and cook 1 min. stirring. Add 1 15 oz can of chopped tomatoes undrained 1 can of black beans drained & 1 small can of chopped green chilis. Cook 2 min. or until thick. Remove all and place in a bowl. Then cut 6 6\" corn tortillas (you can use more if you need them). Spread about half a cup of the bean mixture over the bottom of the skillet half of the tortillas overlapping if necessary then half of remaining bean mixture over that sprinkle w/ a few green onion sliced and some chopped cilantro if you want. Then place the remaining tortillas and remaining bean mixture. Top w/ 1/4 c corn 1/2 cup shredded cheddar cheese & 1/2 tsp paprika. Bake for 30 min. Let stand for 8 or so min. Serve w/sour cream salsa or whatever you want. Note the only fresh things you put in were the onion & the scallions. Straight from the cabinet & tastes fresh and great! Trust me! I also shred some cabbage mango & lime juice to serve with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alene Wendrow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7072794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T13:54:24.5Z",
                "reviewBody": "I've been looking for this recipe for weeks (I had this a long time ago). Anyway I made this for Cinco de Mayo and it is so good! I used an 8\" cake pan with 2\" high sides and it fit in there nicely. My store didn't have chorizo so I used regular sausage and added some crushed red pepper flakes black pepper and hot sauce to spice it up and it turned out just how I remember-DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-12T15:26:13.353Z",
                "reviewBody": "Awesome! I made this for dinner last night and my husband and I both loved it! He quickly packed up the leftovers and declared them to be \"his lunch for tomorrow\". I always try to make a recipe exactly as it's written the first time I make it but I had to make changes to this one based on what I had on hand and what the other reviewers advised. So here's what I did: Instead of chorizo I used leftover shredded chicken because that's what I had Used whole wheat tortillas because we always use whole grains Used low fat Mexican blend shredded cheese skipped the red peppers Added a can of corn because we love all \"corny\" things:) So I used a glass pie pan sprayed it with PAM. Laid down one tortilla rather than two based on prior reviews and I'd say they were spot on with that recommendation. Then I put in 1/2 of my chicken mixture to which I added 1/2 can of enchilada sauce because is just looked like it needed it! Sprinkled with cheese and then laid down the next tortilla and spread that with 1/2 can of beans and sprinkled with cheese. Next tortilla and remainder of chicken and a sprinkle of cheese. Last tortilla and remainder of beans topped with the other 1/2 can of enchilada sauce and then the remaining cheese. I then took a sharp knife and poked holes down through the layers for the enchilada sauce to seep into. Baked at 350 for about 35-40 minutes. It was FABULOUS. We will make this one regularly for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynne Cournoyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-15T23:37:38.92Z",
                "reviewBody": "This was fabulous! I only layered one tortilla at a time since they were lo carb and very filling used two different cheeses cheddar and hot pepper and loads of roasted red peppers. This is a new favorite! Thank you so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/294060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-27T00:22:36.467Z",
                "reviewBody": "If you follow it as written the charizo completely over powers all the other flavors and is very salty; using the two tortillas with each layer makes it really hard to cut. My family and I love Mexican food but this was a no keeper unless it was drastically altered.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "daryld",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3179074/"
                }
            }
        ]
    }
]