[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
                    "name": "Cherry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24698/chocolate-covered-cherries/",
        "name": "Chocolate Covered Cherries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F491718.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2018-03-21T16:18:28.000Z",
        "description": "Easy, delicious cherries. Just like you buy in the box! It's best to let the candies ripen for 1 to 2 weeks.",
        "prepTime": "P0DT1H0M",
        "cookTime": null,
        "totalTime": "P0DT1H0M",
        "recipeYield": "60 pieces",
        "recipeIngredient": [
            "60 maraschino cherries with stems",
            "3 tablespoons butter, softened",
            "3 tablespoons corn syrup",
            "2 cups sifted confectioners' sugar",
            "1 pound chocolate confectioners' coating "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Drain cherries and set on paper towels to dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine butter and corn syrup until smooth.  Stir in confectioners' sugar and knead to form a  dough.  Chill to stiffen if necessary.  Wrap each cherry in about 1 teaspoon of dough.  Chill until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt confectioners' coating in a heavy saucepan over low heat.  Dip each cherry in by its stem, and place on waxed paper lined sheets.  Chill until completely set.  Store in an airtight container in a cool place.  Best after 1 or 2 weeks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Cherry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Meredith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.708454810495627,
            "ratingCount": 343,
            "itemReviewed": "Chocolate Covered Cherries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "68.2 calories",
            "carbohydrateContent": "10.5 g",
            "cholesterolContent": "1.5 mg",
            "fatContent": "3.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "5.1 mg",
            "sugarContent": "4.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-03-14T15:26:55.437Z",
                "reviewBody": "As always, I made a slight modification just to make things easier: I bought tubs of the microwavable dipping chocolates that is now available in most stores to dip the cherries in.\r\n\r\nHere is a very helpful tip: Buy the mini-muffin/cupcake/candy cups to place each cherry in after dipping. I found mine at Michael's craft store but I know they have them in grocery stores, as well.\r\n\r\nI think it looks nice to use these when presenting them, especially if they are in a candy box.\r\n\r\nAlso, it is helpful if you dip the cherry and place it directly into the cup...because when you pick the cherry up from whatever surface, there is a spot where the chocolate doesn't cover and the juices from the filling will seep out. What happened to me the first time round with this recipe was this: I placed the dipped cherries onto wax paper to dry. Then, I moved the cherries from the wax paper into my container. The filling seeped out through the bottom part of the cherry that had touched the wax paper and there was no chocolate there. So, it helps to put them into the candy cups directly after dipping them.\r\n\r\n\r\nHoped this all made sense!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison S.F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T20:54:07.533Z",
                "reviewBody": "WOW! These are hands down the absolute best chocolate covered cherries I have ever eaten!  I have never really cared for them until now, but I wanted to make some for my husband so this recipe looked easy enough.  Boy was I surprised when I bit into one of these.  I can't stop eating them.\nI had such good results that I thought I'd share what I did:\nI wanted to make a big batch so I used 4 jars of Great Value (Wal-mart) maraschino cherries WITH STEMS-hint:  these are not with the canned fruit, they are on the isle with ice cream toppings.  I tripled the dough recipe and used 1 bag of dark chocolate chips mixed with 1 bag of semi-sweet chocolate chips and 1 TBSP shortening.  This was the right amount of chocolate and dough for the number of cherries. I drained and chilled the cherries, wrapped in dough then briefly chilled before dipping them in the chocolate.  I left the stems on for ease of dipping in chocolate.  I let them sit overnight then pulled the stems out the next morning.  Where the stem left a small hole I patched it with a dab of chocolate.  Once dried, I flipped them over and used a butter knife to spread an extra layer of chocolate on the bottom to cover any thin areas where they sat on the wax paper.  This took a little work but I had NO leaking and from dipping them with the stems on they had a nice even coating on the outside and looked very much like the store bought kind.  Everyone that has had one has LOVED them.  I will definitely make these again and aga",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2478636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-30T17:55:03.57Z",
                "reviewBody": "It's cold here in Illinois (everywhere?) right now so a great time for candy making.  My dad gave us Brach's dark chocolate covered cherries every year for Christmas and now they don't make them.  I was hoping this would be like them.  I didn't have the chocolate bark so I used the little dark chocolate \"buttons\" I buy every year at Christmas from the local candy supply store.  Also, my cherries didn't have stems but this wasn't a problem.  The key is to buy the little Wilton candy dipping packet that has 3 or 4 different kinds of dipping tools.  Also, DROP THESE ON A COLD WAX PAPER COOKIE SHEET - helps them set right away.  Only a couple needed re-dipped.  If you have a little uncovered spot on the bottom, just pick it up after setting, and re-dip just that little spot.  All that being said, these are good but WAY too sweet.    Update:  I tried this again with the milk chocolate (same buttons from candy making store) and they are way better so I'm upgrading to 5 stars.  Thanks! Another update - I tried this at Christmas with the \"chocolate bark\" and really hated it - yuck!  Use real milk chocolate!  If you can't find the candy \"buttons\", use milk chocolate chips.  It really does make all the difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROSNANFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T23:34:08.517Z",
                "reviewBody": "I never would have thought that I could make candy like this--on the first try! I used Ghiradelli Chocolate chips melted in a cereal bowl over some simmering water and added a little shortening. Worked like a charm. I was hoping the white center would \"dissolve\" into just juices and sure enough after just a few days they have. I'm so impressed with myself and this recipe. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VeaterGal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1823666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-21T12:28:18.157Z",
                "reviewBody": "Very easy to make....took advice of one person who left a review and I put them directly into mini paper cups for truffles...not a good idea...the chocolate takes form of the cup...instead I would just place them on a wax paper lined cookie sheet and peel them off after. Taste excellent though! UPDATE I made these 2 weeks ago and put them away to get gooey in the middle...and I tried one last night and they are not gooey AT ALL!! It's basically a cherry wrapped in fondant covered in chocolate! What happened???",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2198986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T19:03:12.81Z",
                "reviewBody": "These are better than store bought and suprisingly easy to make. I was worried about using to much of the sugar dough and was probably too skimpy. I'd be sure to use the full teaspoon next time. After 3 or 4 days they were already nice and creamy. I think next time I might also try adding a bit of paraffin to the chocolate coating... they seemed to lose their lustre within the first week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAYBEDAUL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/966245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-03T23:34:53.547Z",
                "reviewBody": "This is a very yummy and simple recipe. Chocolate covered cherries are my favorite candy and I am very picky about them. The only thing I will do next time is double dip the bottoms- they tend to spring a leak and get a bit sticky. Rave reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "8BARRSTREET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/865021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-10T01:33:26.42Z",
                "reviewBody": "Out of this world!! I can't wait to try these out on family and friends on the holidays. These are perfect just the way they are but next time I'm going to try adding a few drops of mint flavoring to the dough mixture to have chocolate mint cherries just for something a little different. Also after the first dipping of chocolate( I used Chocolate Almond Bark and it worked really well) try dipping them a second time half way in melted Vanilla Almond Bark. I think they would look great. Thank you for sharing the recipe.I will be making these alot for special occasions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-11T18:11:05.09Z",
                "reviewBody": "These were amazing and not that hard to make. HELPFUL HINT: I put a baking sheet in the freezer for about an hour before I made these, then took it out and covered it with aluminum foil. When you put the dipped cherries on them, they cool instantly and don't leave the bottom of the cherry without chocolate. PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katiemae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katiemae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T19:42:46.143Z",
                "reviewBody": "this did not work the inside part didn't dough up and it was a mess and it all went down hill from there",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sundropkisses",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sundropkisses/"
                }
            }
        ]
    }
]