[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17290/side-dish/stuffing-and-dressing/",
                    "name": "Stuffing and Dressing Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16173/side-dish/stuffing-and-dressing/sausage-stuffing-and-dressing/",
                    "name": "Sausage Stuffing and Dressing Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24741/cornbread-stuffing-with-sausage/",
        "name": "Cornbread Stuffing With Sausage",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9418955.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2018-03-21T16:18:32.000Z",
        "description": "The name says it all! Ground sausage is cooked with celery and onions, then baked with cornbread, bread crumbs and chicken broth.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound ground sausage",
            "2 cups chopped celery",
            "2 large onions, chopped",
            "5 cups crumbled cornbread",
            "5 cups seasoned bread crumbs",
            "2 ¾ cups chicken broth",
            "1 ½ teaspoons poultry seasoning",
            "1 teaspoon sage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sausage, celery and onions in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine sausage mixture with cornbread, bread crumbs, chicken broth, poultry seasoning and sage.  Mix well and transfer to a 9x12 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, covered, for 45 minutes or until well set and cooked through.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Stuffing and Dressing Recipes",
            "Sausage Stuffing and Dressing Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5364238410596025,
            "ratingCount": 151,
            "itemReviewed": "Cornbread Stuffing With Sausage",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.7 calories",
            "carbohydrateContent": "51.1 g",
            "cholesterolContent": "40 mg",
            "fatContent": "19.3 g",
            "fiberContent": "4.3 g",
            "proteinContent": "15 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1401.8 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-11T08:28:43.49Z",
                "reviewBody": "This is the simplest stuffing recipe in the world. This recipe never fails at thanksgiving.  I do deviate from this recipe though and for the best I think.  I use all cornbread no other bread, for broth I used the stock made with the neck from turkey.  I also recomend cooking your cornbread (Jiff) 5-10 min longer than recomended.  This does two things one it gets a denser crust on the edges adding some great texture and two it dries better allowing for more absorbsion from drippings and the initiall mixing enhancing the flavor.  You will not go wrong with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BWAUDEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-03T07:21:12.403Z",
                "reviewBody": "I made this stuffing for Thanksgiving this year! Absolutely delicious! There were 5 families total and everybody really liked it. I did not alter the ingredients in this recipe at all. First, I cooked the chopped onions and chopped celery slowly (on med-low heat)by itself in a little bit of melted butter until all of it was tender soft.  Then, I cooked my sausage in a separate skillet(I used Jimmy Dean - Pork Sausage). Next, I combined them in a big bowl and put them in the refrigerator to let the flavors blend. Several hours later, when it was closer to our dinner time, I warmed up this mixture in the microwave. I added the rest of the ingredients exactly like the recipe called for, and then baked it.  Very Yummy! I had so many wonderful comments. This will definitely be our annual Thanksgiving stuffing recipe! It turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AKMOM3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1273060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-23T23:24:55.47Z",
                "reviewBody": "After some changes this stuffing turned out alright. I have to say I really think the 5 cups of bread crumbs is a misprint. I only put two cups of crumbs and about half a cup extra of chicken broth and it came out fine. Unless you like really dry stuffing i wouldn't recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn Brunick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1191614/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-18T19:43:55.393Z",
                "reviewBody": "Mine is just a little different and it comes out great. I use a roll of sage sausage and omit the additional sage seasoning. Also cook your cornbread a few days ahead of time, wrap tightly and store in the fridge.  It dries out which is good for making stuffing :)  Also, bread crumbs are to fine. I get a bag of dried bread chunks or toast old bread (white/wheat combo is fine) and add.  I also only use one onion, about 1/2 cup celery and 1/2 cup green pepper and I don't cook it with the sausage. it goes into the stuffing mix raw and cooks in the oven. Finish off the mix with seasoning salt and fresh ground black pepper...the mixed peppercorns are great. add enough broth or water til sticky, but not drippy wet. Also if you are running short on time or don't like all the chopping, omit all the veggie chopping and use chicken broth with herb seasoning. College in makes a good variety.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2384984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T19:48:03.48Z",
                "reviewBody": "My mother used to make her cornbread stuffing this way when I was growing up, and it's the best way I know to make cornbread stuffing.  I start off by baking a small pan of cornbread by mixing one cup each of cornmeal and flour with 2 tsp. baking powder, and water.    Once cooled, the cornbread is crumbled into a large mixing bowl along with the sauteed onions, chopped bell peppers, and celery.  In addition to the pork sausage, we cook the turkey neck, gizzards, and the turkey heart in a small pot with 3 cups of water.    The cooked meat is removed from the neck bone and chopped along  with the cooked gizzard and heart, all of which is then added to the cornbread mixture.    The remaining broth is added to moisten the stuffing with additional water as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gilda George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebony3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-26T02:41:24.74Z",
                "reviewBody": "I had to make Thanksgiving dinner on my own and needed a stuffing recipe because I, quite frankly, have always hated it.  This looked like a winner, both in prep and ingredients.  I used 2 Jiffy cornbread mixes and had a fair amount leftover; Pepperidge Farm Herb Seasoned Stuffing Mix (I can't imagine our recipe giver Sal meant bread crumbs like Progresso), and just to save a step I took another reviewer's suggestion and used sage sausage, therefore omitting the 1 tsp of sage.  I made the stuffing the day before Thanksgiving, then baked it the day of (I let it sit at room temp for about 20 minutes and then baked it per the regular directions).  This dish was the hit of Thanksgiving dinner, so I decided I better see what all the fuss was about -- I could have eaten the entire pan!  Delish!  It had a little kick to it, don't know if that was from the sage sausage or all the onions, but wow!  I will make this every year from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIRBY97",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/130892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T22:29:10.717Z",
                "reviewBody": "I was really disappointed by this recipe my husband told me 5 cups of bread crumbs were way to much I should have listened to him because this was to bready I even added more broth all I tasted was the bread crumbs. It was alteast edible though so I gave it 3 starts",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bcastellano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1785702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T00:54:49.507Z",
                "reviewBody": "This is one of the best recipes I have ever tried. I've been trying to find a recipe that was similar to my mother's. This is the closest to it and the best. I have used this recipe 3 times already and I am sure I will use it even more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHANH24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T20:41:57.74Z",
                "reviewBody": "My husband liked this recipe a lot; however I wasn't fond of it at all. I was confused on the bread crumbs. I used the finely chopped bread crumbs but was wondering if recipe really meant the herbed cubes that are usually used for dressing. The finished product was just a gooey mess in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "GDEEZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603952/"
                }
            }
        ]
    }
]