[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
                    "name": "Dips and Spreads Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24756/soft-spread-butter/",
        "name": "Soft Spread Butter",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F824859.jpg",
            "width": 1798,
            "height": 1536
        },
        "datePublished": "2018-03-21T16:18:34.000Z",
        "description": "This is a homemade margarine or soft spread 'butter'.  While it is not lower in calorie, it has a higher ratio of unsaturated to saturated fat than butter, and unlike margarine, it contains no trans fat. Create a flavored butter by adding garlic or cinnamon, or anything you chose!",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT3H20M",
        "recipeYield": "2 1/4 cups",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 ¼ cups canola oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a lidded, plastic storage container stir butter until it has a smooth, frosting-like consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slowly, one tablespoon at a time, stir in the first 1/2 cup of oil; mix until smooth.  Stir in the remaining oil a little more quickly, mixing well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Refrigerate for 3 hours, or until set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Store in refrigerator.  If the 'butter' melts after being left out, refrigerate to restore solidified quality.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Dips and Spreads Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cal Schroeck"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 22,
            "itemReviewed": "Soft Spread Butter",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "114 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "13.6 mg",
            "fatContent": "12.9 g",
            "fiberContent": null,
            "proteinContent": "0.1 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "36.3 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-02T20:09:22.983Z",
                "reviewBody": "Excellent taste! This is an all natural butter that is still spreadable! Make sure to soften and not melt the butter. Now that I've got the hang of making it I'll never use anything else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "srgothard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/159024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-08T14:28:08.767Z",
                "reviewBody": "I use this same method, only I use light flavored or regular olive oil, depending on your preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish Gillogly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1617389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-22T22:52:06.89Z",
                "reviewBody": "I cut this back to 12 servings. The reason why I made this is because I wanted a soft spread that I could add minced garlic and chopped parsley to for homemade garlic bread. This was exactly what I was looking for. I did use SALTED butter. I was able to mix this up around noon (with the added spices) and use to spread on garlic bread at dinnertime. It blew my mind. Who knew that homemade soft spread would be this easy to make and without chemicals? I'm really impressed. I'll use this recipe again for sure. NOTE: Twelve servings (1/3 cup of both salted butter and 1/3 cup oil) makes enough to spread on two sides of one large italian bread loaf. I only used half, there's plenty for next time I make garlic bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-29T17:03:25.667Z",
                "reviewBody": "I made this using my KA mixer.  I had doubts that it would come together but I kept beating it and it did.  It's liquidy when done but does set up in the refrigerator.  I made the full recipe with some added salt since my butter was unsalted.  The taste is good and i would make it again.  The recipe yielded around 2 cups.  Thanks Cal for a good recipe that replaces store bought junk. UPDATE:  My initial batch eventually separated.  So I adjusted the second batch.  I defrosted 2 sticks of butter in my 1300w microwave for 39sec.  The butter was very soft and partially melted.  I put the butter in the KA with the whisk attachment and whisked it until it was smooth.  I added a total of 1cup of canola oil with the first half added very slowly.  This time I added 4 pinches of table salt.  UPDATE:  The spread did not separate when i used my updated method. Update:  I whipped it longer this time so the spread is white and I made 2.5 cups instead of 2c.  Will update with results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AllieGeekPi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7938254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-25T22:29:12.433Z",
                "reviewBody": "This stuff is ace! Plain butter has 35% saturated fat per tablespoon or 1/3 a days worth. That is a lot! I have reduced butter usage in everyday cooking for cholesterol reasons. The only 2 options available at the market that are not margarine are whipped butter and butter with canola oil. Whipped butter is just butter with air whipped into it which reduces the sat fat by half by doubling the volume. They are only selling half the amount of butter too!The butter with canola oil at the grocery store is over 3.50 for 15oz. \"This recipe tastes and spreads exactly like that butter.\" Stick butter cost about 65 cents a stick which makes this more affordable. I just put two sticks of butter in the empty clean 15oz container for the same products. I microwaved the butter about 25-30 seconds until softened and not melted and then followed the directions for adding the canola oil to it. Make sure to use salted butter or add a little salt. Thank you so much for posting this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T23:04:45.213Z",
                "reviewBody": "I've done this twice now and it works! Just do it 1:1 and add a touch extra oil - then you can use it with any amount of butter you might have already softened. It really makes the butter stretch in our family of 7.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingInSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2310458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T21:02:36.04Z",
                "reviewBody": "What a wonderful idea. Olive oil would be the oil of choice since that is the oil most often used by the Mediterian people who seem to be very heart healthy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "butterfly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/butterfly/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-04T17:56:38.617Z",
                "reviewBody": "This is a terrific way to lower the fat for spreadable butter without buying the fake stuff in the tub. Like others recommended I softened 1 cup butter. Beat it till it was light and creamy in my KitchenAid mixer. Then I slowly poured in 1 cup canola oil and beat another 5 minutes occasionally scraping the sides of the bowl. I also added 1/4 teaspoon of sea salt for flavor. This makes a great deal of spread and I can see that i will not only save on fat I will also save on the cost of butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-04T22:13:21.547Z",
                "reviewBody": "I made half a batch. I had trouble getting my butter and oil to come together (it eventually happened). Perhaps my butter wasn't at room temperature. I added a garlic powder blend from Penzey's and some parsley flakes. Great flavor! Next time I believe I will keep the butter and oil amounts equal. I feel that it's a little too soupy at the current ratio.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsFisher0729",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrsfisher0729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-26T19:02:18.74Z",
                "reviewBody": "This spread has had great reviews but I wasn't exactly wow'd by it. I know there always has to be one right? I can see possibly using it for a flavored butter. But for everyday butter to put on the table I still prefer the whipped butter sold at the store. One thing that I really don't like about it is how quickly it starts to separate at room temperature. Having oil puddle around the corners of the butter dish isn't very appetizing. I've read the reviews and this could be a result of too much canola oil but as I try to do I followed the recipe exactly as written the first time. Nutritionally the two are very close and yes whipped butter does take a few minutes to soften (but not long). And there is very little cost savings making this as compared to buying the store brand of whipped butter. If it works for you go for it but I'll be sticking with the whipped butter. This will be eaten and it was worth a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            }
        ]
    }
]