[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25964/blackberry-wine-cake-ii/",
        "name": "Blackberry Wine Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F112288.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:20:52.000Z",
        "description": "An easy cake to make. Cake mix is combined with blackberry wine and blackberry flavored gelatin, then baked in a Bundt pan.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "1 (18.25 ounce) package white cake mix",
            "1 (3 ounce) package blackberry flavored Jell-O®",
            "4 eggs",
            "½ cup vegetable oil",
            "1 cup blackberry wine",
            "1 ½ cups confectioners' sugar",
            "½ cup blackberry wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together cake mix and gelatin mix. Make a well in the center and pour in eggs, oil and blackberry wine. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Pour 1/2 of blackberry wine glaze over top of cake while still warm. Let set for 10 minutes then remove cake from pan. Allow cake to cool fully before pouring the remaining glaze on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Glaze:  In a small bowl, stir together the confectioners' sugar and 1/2 cup blackberry wine.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "EYEPEAR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.533333333333333,
            "ratingCount": 45,
            "itemReviewed": "Blackberry Wine Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.6 calories",
            "carbohydrateContent": "41.8 g",
            "cholesterolContent": "46.5 mg",
            "fatContent": "11.5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "242.5 mg",
            "sugarContent": "33.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-12-25T12:13:52.773Z",
                "reviewBody": "UPDATE DEC 2010 If you can't find true blackberry wine (Manichewitz) and French Vanilla cake mix don't waste your money or time in my opinion. Grocer was out of the wine and I used another so-called blackberry wine that was anything but. Same thing w/cake mix. Didn't begin to take like the original cake. If you've never tried the cake with the originally suggested ingredients you won't know the difference. BUT if you have made this cake with the originally suggested ingredients and then switch to something lesser you will be disappointed in my opinion. LOVE this cake! If you can't find Blacberry gelatin I have used raspberry with great success. I also recommend the French Vanilla cake mix. I pour 1/2 of the glaze over the cake while it is cooling in the pan for 10 minutes. Then I invert it onto my cake plate and spoon over the top the remaining glaze. This gives you a moist cake on the top and bottom. Definitely a crowd pleaser and one my family has enjoyed for years. It tastes even better if you can plan ahead and let cake sit for about 3 days before cutting. The flavor intensifies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UNCgal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2490459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T17:56:06.27Z",
                "reviewBody": "The cake itself was good. It was super moist and had a great flavor. The glaze was way too much. Thankfully I only used 1/2 of what the recipe calls for then I dusted the top with powdered sugar. Awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "a0325",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2702787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T02:42:10.5Z",
                "reviewBody": "My motherin-law made this over the holidays. She got the recipe from a cookbook in North Carolina. This is my new favorite cake! So easy and so good. She used Royal Blackberry Gelatin available at Winn Dixie stores. I love it. So glad you have this recipe posted!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JGHILDEBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-01T17:57:59.59Z",
                "reviewBody": "I have been making this recipe for years and used to think my grandmother invented it until I found a very old newspaper clipping with the recipe at her house. I have given blackberry wine cakes as gifts served them at dinner parties and potlucks and it is always remembered long afterward. A few notes to help those of you having trouble with the glaze. My version has a half cup of butter melted on the stove with the sugar and wine stirred in and boiled together for a few minutes. Then while the cake is still in the pan poke a thousand (or so) holes in the bottom with a fork or skewer and pour about two-thirds of the glaze over it. Allow the cake to soak up the glaze for 30 minutes before turning it out onto a cake plate. Then reheat the remaining glaze and pour it over the top for color. Allowing the glaze to soak in makes this cake so moist you could literally leave it uncovered for days and it would not dry out. I have tried adding fresh blackberries to the glaze and to be honest it makes the cake look like a mess. If you really want the berries I would suggest adding them around the base of the cake after you are completely finished as a garnish. This is an especially good cake for folks who don't like icing. Don't be surprised when people cut 3\" wedges for themselves or when you catch yourself having some for breakfast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mel Kidd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4041055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-03T22:03:04.027Z",
                "reviewBody": "I used Jell-O's Blackberry Fusion gelatin and it worked great. After pouring half the glaze on the bottom of the cake I mashed up some blackberries and added them to the glaze before pouring it over the top. It was GREAT! I served this at a dinner party and it was devoured. Due to some of the comments on here I was concerned about it being too sweet but it was just right and very moist. I will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali Shinnick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2910954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-06T23:51:22.003Z",
                "reviewBody": "This was a very tasty moist cake and was a hit at a recent picnic. Good news for those who have a hard time finding blackberry gelatin Jello brand has started selling a \"Blackberry Fusion\" flavor (Summer '07) which is a mix of blackberry and raspberry. I used that and it turned out great! None of the stores in our area sell the Royal brand of gelatin so I was very happy to see Jello's new flavor. After reading many negative reviews for the glaze I opted to brush the warm cake with warmed blackberry preserves which added a nice flavor. Thanks for the delicious recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/265314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-21T02:40:02.763Z",
                "reviewBody": "Mine stuck so badly to my Nordicware non-stick bundt pan (which I had sprayed with Pam) that I could only get it out by digging with a spoon. What I could get out tasted very very good but I'm very sad that I didn't get a nice cake out of it. I highly recommend greasing and flouring your pan even if yours is non-stick like mine. Great taste! Can't wait to try it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBOSLOBIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-31T20:05:54.66Z",
                "reviewBody": "This was a great cake!! It was impossible to find the Blackberry Gelatin so I used the Black Rasberry Gelatin and it blended right in. In the future (or in season) I would like to try it with some fresh Blackberrys in the glaze. It was a big hit at work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Michele Robinson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T03:36:49.5Z",
                "reviewBody": "My stepmom made this today for my Dad and it was delicious! This is so moist! This was great with and without whipped topping. The entire family raved about this cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            }
        ]
    }
]