[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/108/appetizers-and-snacks/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26705/bagna-cauda/",
        "name": "Bagna Cauda",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4885528.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2018-03-21T16:21:45.000Z",
        "description": "Ever since a family friend introduced us to this Italian dip, we have made it a tradition on New Year's Eve. You have to really like garlic to enjoy this. I have heard that some people omit the cream and substitute olive oil also. Serve with crusty Italian bread, raw cabbage wedges, lettuce, bread sticks or crackers.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "2 cups",
        "recipeIngredient": [
            "½ cup butter",
            "10 cloves garlic, minced",
            "2 (2 ounce) cans anchovy fillets, drained",
            "1 pint heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt butter in a medium saucepan over medium heat. Stir in garlic and cook until tender. Reduce heat to low. Mix in anchovy filets and heavy cream. Cook and stir until thickened. Remove from heat, cover and chill in the refrigerator approximately 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the mixture to medium heat, stirring occasionally, until bubbly. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Seafood"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julie P."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.583333333333333,
            "ratingCount": 36,
            "itemReviewed": "Bagna Cauda",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "224.1 calories",
            "carbohydrateContent": "1.9 g",
            "cholesterolContent": "81.1 mg",
            "fatContent": "23.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "14.2 g",
            "servingSize": null,
            "sodiumContent": "345.1 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-04T17:52:34.89Z",
                "reviewBody": "My family has made this every year for Christmas as a tradition for 40 years. It is a northern Italian recipe. BUT we made it like the previous poster. NO CREAM... USE olive oil instead. It is all put in an electric skillet on medium heat in the center of a table. (HINT: duck tape the cord to the table and to the ground so no one trips over it.) Cook until the anchovies dissapate and the flavor sets in...about 30 minutes. Do not burn. We use 4 cubes butter 4 cups olive oil 4 cans anchovies and about 4 whole cloves of garlic. Add more as you eat and cook. We all swarm around the skillet with our skewers and dip in filet mignon shrimp lobster cabbage mushrooms and good crusty Italian bread. Indulge with a glass of wine too! It is fun to cook eat and socialize. No one would ever know that there were anchovies in it. It is really garlicy and your house \"reaks\" of garlic for several days afterwards too! Every new person that tries it is very apprehensive at first but the next year they invite themselves and couldn't imagine a Christmas without it. I would not recommend anybody to use the cream. but that is just my opinions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3KIDS5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/31630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T00:49:19.903Z",
                "reviewBody": "I am a garlic lover and when I came across this recipe I thought it would really be good. Keep in mind: I can't think of ANYTHING that I don't like. I love to cook especially different things. I had my family for Christmas day this year and I told everyone they had be bring something different something they hadn't made before. I thought this would be so much fun. Well I chose to make this Bagna Cauda. Everyone in my family loves garlic as well so I thought it would be a big hit. I'm sorry to say....this has to be the worst tasting stuff I have ever made or tasted! When I was making it...I thought \"I hope it tastes better than it smells!\" Well...when I got some on my finger and subconsciously I went to the sink to wash them instead of the normal 'licking' it off...I knew I was in trouble!:-) But..I thought I'd still taste it and see. I have to be honest and tell you that I gagged. I couldn't even swallow it! I had crusty bread with it. I don't know what others see in this but I for one won't ever make it again. About 5 other family members tried it because they couldn't believe it could be 'that bad'. Well..they all agreed hands down...it was horrible. I'm sorry! I guess it's something you had to grow up with!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JPUPPE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/777071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-02T06:10:59.32Z",
                "reviewBody": "Whoo boy! we just finished our bagna-cauda. It was delicious!. My granny used to do this for grand occasions where there were at least ten people round the table and to me this bagna-cauda means good memories. Unfortunaley by the time I asked my granny for the recipe she was already ninety-nine and she had forgotten the recipe!!. This recipe is extremely similar except that I'm thinking that she might have put more anchovies and garlic in it plus a little olive oil and pepper. And we always served as fondue it in a founde pot to keep it hot. All in all this is a wonderful recipe even my husband who doesn't like anchovies loved it. A note for those who don't know what to serve it with we eat it with boiled potato chunks italian bread celery gren bell peppers cooked broccoli and cauliflower raw carrots cooked green beans and steamed onions and boiled cardoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAVILU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/426044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-16T14:03:47.643Z",
                "reviewBody": "And I thought WE were the only ones who ate this!  We have this every New Year's - handed down through many generations of my family.  We do it just a little different.  We use 1/2 olive oil and 1/2 real butter and saute' the anchovies and garlic over low heat until they fall apart.  We then put it in a fondue pot and add the cream about 6 oz. at a time.  We fondue steamed cabbage wedges and raw mushrooms and catch the drips with the crusty Italian bread.  When the bagna cauda starts to thicken, add some more cream and let warm up before dipping some more.  When I was younger, we tried this out on our boyfriends.  If they didn't like it or wouldn't try it, they weren't keepers!  Luckily, my husband and brother-in-law love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/susan/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T18:30:32.7Z",
                "reviewBody": "My family has been making this for years to go with fondue but it is good for any occasion! I use 1 stick of butter 2 can anchovies minced or chopped lots and lots of fresh garlic and some olive oil. I've never tried it with cream or chilling it first... I put everything in an electric skillet on med-low heat and let is simmer until the achovies dissolve in with the butter and garlic. Then we dip cabbage and bread into the sauce. Add bits of butter or olive oil if you need a bit more liquid after people have snacked for awhile. Rich and delicious!!! Don't forget to brush and use listerine for the next couple of days:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BREYNV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/452417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-27T00:59:15.773Z",
                "reviewBody": "OMG!!! Someone actually makes this recipe the same way (well almost) my dad did when I was a little girl. I'm now 56 years old. Most Bagna Calda recipes don't add the cream but my dad always did. He actually added evaporated milk. This recipe is awesome - brings back some old memories!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bambino",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3164218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-10T05:58:10.027Z",
                "reviewBody": "I make this dish every holiday but served this specific version for my latest New Year's Feast and it ended up being the main attraction. Opened with the dip and when my guests finished the meal we all stayed at the table just dipping foccacia. I was asked for the recipe and typically I do not tell people about the anchovies until after they have tasted it but it did not sway my friends as they all were pleased to know what that special something was:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TARENELLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1342846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T00:50:15.437Z",
                "reviewBody": "I thought we were the only family who ate this stuff LOL. My husbands family has passed this down a few generations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REMNANT11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/642425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T00:49:55.153Z",
                "reviewBody": "THANK YOU JULIE!!! I love this recipe. A friends family used to make this every new years day and I have never been able to track down the recipe. SInce finding your recipe I have made this for 2 different parties and everyone loved it...even those who swore they would never touch an anchovy:) THANK YOU AGAIN!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAHAINLALA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/385820/"
                }
            }
        ]
    }
]