[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/35450/chocolate-mascarpone-phyllo-triangles/",
        "name": "Chocolate-Mascarpone Phyllo Triangles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2130850.jpg",
            "width": 2048,
            "height": 1379
        },
        "datePublished": "2018-03-21T16:23:34.000Z",
        "description": "These are absolutely delicious, flaky and delicate, with a chocolate mascarpone pecan filling. Rich, but not too sweet. Once you try creating with phyllo, it is not difficult as long as you follow instructions. Be sure to keep the sheets under a damp cloth while preparing the triangles. Drizzle each triangle with a little honey when serving.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "18 triangles",
        "recipeIngredient": [
            "2 cups mascarpone cheese",
            "⅓ cup HERSHEY®'S Cocoa Powder",
            "1 teaspoon vanilla extract",
            "½ cup honey",
            "¾ cup chopped pecans",
            "2 cups clarified butter",
            "1 (16 ounce) package phyllo dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, beat together the mascarpone cheese, HERSHEY'S &reg; Cocoa Powder, vanilla extract and honey. Mix in pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush top of one sheet of phyllo dough with clarified butter, and fold in half lengthwise. Place two heaping tablespoons of the mascarpone cheese mixture in one corner of the folded phyllo sheet. Fold sheet over the filling, forming a triangle. Trim ragged edges. Repeat with remaining phyllo sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place triangles seam side down on a medium baking sheet, brush with remaining butter, and bake in the preheated oven 20 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mary Bayramian"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 25,
            "itemReviewed": "Chocolate-Mascarpone Phyllo Triangles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "447.2 calories",
            "carbohydrateContent": "22.4 g",
            "cholesterolContent": "89.4 mg",
            "fatContent": "39.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "21 g",
            "servingSize": null,
            "sodiumContent": "134.4 mg",
            "sugarContent": "8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-13T14:36:50.443Z",
                "reviewBody": "I live in Europe (have for 15 years) in a country next door to Italy where they use mascarpone cheese and phyllo dough all the time.  Maybe I can help everyone with the leakages problem.  I have never seen anyone try and make separate triangles or squares with phyllo dough.  It is always used in a pan and then cut later.  Even though I haven't tried this recipe yet, when I do, I will layer the bottom of a pan (15x11\" or 9x13\") with 3-4 sheets of phyllo (brushing the butter in between each layer).  Then spread the filling over the layers and finishing with 3-4 more sheets of phyllo brushing the butter on the top, as well.  The baking time will probably vary.  Once it's baked, let it cool completely then cut in squares or, as they like to do here, cut diagonally to the right and then the left making diamond shapes.  Hopefully, this will work.  If anyone tries this before I do, let me know how it works.  Hope this help!\nI finally tried this recipe and made it the way I suggested above (keeping the filling exactly as written).  It turned out just fine as far as the consistency and everything holding together.  But next time I will NOT add honey, but will, instead, add brown sugar and cinnamon.  One other thing, make sure you beat the mascarpone REALLY well so that it's nice and fluffy.  That will make the consistency much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joan B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2180581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T15:36:10.773Z",
                "reviewBody": "Despite reading all the reviews and ensuring that the mascarpone filling I made was a very thick paste the filling spilt out everywhere within the first 10 minutes of cooking. I think the oven temperature is too high as well as after 15 minutes my pastry was almost at a burnt stage. I threw everything out which was a very costly exercise given the price of mascarpone. I won't be trying this out again I'm afraid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RECHJM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1079541/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-14T05:58:42.7Z",
                "reviewBody": "This was great!! Next time I'd serve the phyllo dough with some of the mascarpone-chocolate mix and some mascarpone with a little sugar and vanilla mixed in as a little break from the delicious rich \"chocolatey-ness\" of the recipe. Mine weren't bitter at all and they didn't leak very much. Yummm!!! The trick is to make the chocolate mix pretty thick like a paste. Then it really shouldn't leak too badly. If you need to add more sweetening add confectioner's sugar and you should be all set! Serve with a drizzle of dark chocolate syrup and powdered sugar.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Colinb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3027698/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T07:32:19.2Z",
                "reviewBody": "I love these triangles! Phyllo dough is easy and fun to work with and this recipe is delightfully lite and not too sweet. Thanks Mary!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOTTSBELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mottsbela/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-06T18:51:57.29Z",
                "reviewBody": "KEY to avoiding leaking-- cut your phyllo into strips and wrap around a spoon of filling in a triangle shape just like folding a flag-- then you will have many more layers of phyllo to contain the filling and not so much of a seam. (I wonder if the author intended this? but not very clear from the instructions..)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Georgette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T01:48:28.003Z",
                "reviewBody": "I halved the recipe because I've never worked with phyllo. They were a complete mess (mostly my fault) but SO good! I added a tablespoon of sugar and increased the vanilla because of reviews of bitterness. Definitely decrease the amount of filling in each triangle or you'll be cleaning the bottom of your oven just like me! Next time I'll try the mascarpone substitute on this site because the real thing is hard to find and VERY expensive where I live.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Todzwif",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2097815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T13:00:53.5Z",
                "reviewBody": "I scaled the recipe down to 4 servings & I added a couple of tbp of sugar to the filling. (it was a bit bitter before & I didn't want to add more honey for fear of making the filling runny). Like Princess Antz most of the filling leaked out while baking (I baked @ 375 for 20 minutes & they were a perfect golden brown). Although there was enough left to be able to enjoy the dessert still....hence the 4 stars. (It would have gotten five if the filling was sweeter & most of the filling hadn't been lost). Next time I think I will try not putting so much filling in but I don't think there is anyway to seal phyllo dough so I'm thinking this recipe might be better suited in phyllo cups. The taste was excellent...there is just some issues w/ the logistics of the recipe. I drizzled each w/ a little honey & garnished w/ chocolate curls. Thansk Mary Bayramian...despite the problems w/ the recipe it was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T17:54:55.273Z",
                "reviewBody": "Made this into a layered dish after reading reviews about oozing and while the filling was amazing the phyllo was overtaken by it. Next time I will keep the phyllo all on top and bottom without doing layers. The filling tasted like really good chocolate croissant filling. Yum yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cstank",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2737608/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-03T01:29:11.107Z",
                "reviewBody": "Phyllo is very delicate. When making your triangles only use 1 tblespoon of mixture. then take some eggwash toseal the edges before baking. Also instead of cocoa use semi sweet baking chocolate. This will give it better flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chef giovanni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2475527/"
                }
            }
        ]
    }
]