[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17021/meat-and-poultry/pork/ground/",
                    "name": "Ground Pork Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/37683/ragu-bolognese/",
        "name": "Ragu Bolognese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6334581.jpg",
            "width": 2852,
            "height": 2852
        },
        "datePublished": "2018-03-21T16:24:34.000Z",
        "description": "This is the real deal, an authentic recipe for a meat sauce.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup extra virgin olive oil",
            "½ cup butter",
            "1 cup minced onion",
            "½ cup minced celery",
            "¼ cup minced carrot",
            "1 pound ground veal",
            "1 pound ground pork",
            "½ pound ground beef",
            "¼ cup finely chopped pancetta bacon",
            "½ cup milk",
            "2 cups tomato sauce",
            "2 cups beef broth"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil and butter in a large saucepan over medium heat. Saute onion, celery and carrots until soft. Add veal, pork, beef and pancetta, and cook until evenly brown, 15 to 20 minutes. Pour in milk, and cook until liquid has evaporated, about 15 minutes. Stir in tomato sauce and beef broth. Cover, and simmer 2 1/2 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Ground Pork Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mike Oxsolong"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.384615384615385,
            "ratingCount": 78,
            "itemReviewed": "Ragu Bolognese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "750.5 calories",
            "carbohydrateContent": "8.8 g",
            "cholesterolContent": "182.4 mg",
            "fatContent": "63 g",
            "fiberContent": "1.9 g",
            "proteinContent": "36.6 g",
            "saturatedFatContent": "23.5 g",
            "servingSize": null,
            "sodiumContent": "990.6 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-12T21:18:57.043Z",
                "reviewBody": "Excellent sauce, but I definitely omitted the butter and cut the olive oil in half! Otherwise you're looking at one greasy sauce.... I minced the carrot, celery and onion by giving it a whirl in a mini food processor and then sauteeing it all in the olive oil along with some minced garlic. I sauteed the beef, pork, veal (1 lb. each) and pancetta separately draining the grease. I then added that to the veggies. I then added 1 & 1/2 cups of beef broth, 1/2 cup of red wine, and a few splashes of balsamic and let that reduce (it takes a while). Plus, if you want it to look like the picture, I had to add a cup of half and half along with 2 & 1/2 cups of \"personally prepared\" tomato sauce and 6 oz. of tomato paste. You may also want to add some spices if you're using plain tomato sauce. I was liberal with the garlic and also added some salt and a bit of sugar to cut the acidity of the tomatoes. You really have to play with this a bit to get the desired flavor you want and it definitely needs to simmer for at lest 3 hours. But, when it's done - it's fabulous! We served it over penne pasta with a side of garlic bread and had plenty of leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T15:39:51.77Z",
                "reviewBody": "While I agree with most everything in this recipe if you are going to take this much time (as you should) to make a good ragu you should reduce the meat several times with infusions of broth balsamic vinegar wine. Otherwise he is right real deal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JLDELAP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/113347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T00:30:32.193Z",
                "reviewBody": "I would've given it a 5 because it was great. But only after my changes. How can there not be any seasonings added. Is this a given? I'm glad I tasted it before I let it simmer for 2.5 hrs. Taste it before you simmer it. I added 4 cloves of garlic (next time I will add it with the onion). I also added salt and pepper to taste.  Each time I stirred it it started tasting a little better, so I kept adding seasonings. I also added 2 bay leaves when I added the milk.  I'm not a big pork person, so I bought whole pieces instead of ground. I cut it up into little pieces. (obviously next time I will buy ground!). I also cut the butter and oil in half, as other people suggested. The meat has it's own oil.  But it turned out really tasty. Even better after I let it simmer.  Take my advice and taste it, that way you can add the seasonings before you let it simmer. If you add it after, it won't be as good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "musicvixen24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5402145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-31T15:43:51.577Z",
                "reviewBody": "This ragu recipe is outstanding. I make it ahead and put in quart size bags in the freezer. When I want a fast authentic tasting meaty spaghetti sauce I combine one quart sized frozen package of ragu and mix with my favorite jar sauce and serve over pasta. I follow the recipe to the letter mmmmm good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-28T00:17:29.99Z",
                "reviewBody": "Worked in an Italian restaurant for years and this Bolognese is light years ahead of the one we made. Next time, I will probably saute the pancetta, then the vegetables and finally the meats, draining them off as to get the full effect of the butter and the milk. I also will use vension as it is readily available to me. Mike, thanks for sharing this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Paige",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T18:09:13.503Z",
                "reviewBody": "Really very, very good.  I followed one reviewer and added balsamic vinegar.  A keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "deedle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3211959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-15T21:25:08.72Z",
                "reviewBody": "This was a great start to my own personalized sauce. I did not follow this recipe to the \"T\". I started with the basics and then went my own way. First, I used a meatloaf mix (pork, veal, beef) 1.4 pounds and then about another pound of beef. Instead of putting the meat in with the veg, I cooked them separately. I cooked off the veg in the stock pot, adding 5 cloves of garlic toward the end (before adding any meat or liquid).  I browned the meat, drained, returned to pan and added RED wine, broth and threw in a few tbsp of balsamic. I let this cook for about 10 minutes and then dumped it in the stock pot and added the milk and let simmer uncovered. I then added the pancetta to the pan where I had just cooked off the ground meat. I let the pancetta get brown, dumped that in the stock pot then deglazed with RED wine, broth tomato sauce and about 1 cup of the meat/veg mixture from the stock pot. I let this reduce down until the meat had absorbed all of the liquid and then added this to the stock pot.  All the while adding salt, pepper, italian seasonigs and a bit of paprika to both the stock and fry pans. After combined, I added more wine and the rest of the tomato sauce and let simmer covered. Amazing flavor. An didnt measure anything, just eyeballed it. Also used one large can of tomato sauce rather than just the 2 cups that was recommended in the recipe. I did use about a full stick of butter but very little olive oil. You always skim the oil off of the top prior to serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rpacek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5322552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-11T17:28:30.32Z",
                "reviewBody": "This is the BEST bolognese I have ever had! I added 1 cup red wine after the meat was cooked and let that reduce. Then followed the recipe with the addition of a whole 28oz can of crushed tomatoes rather than the 2 cups called for. Let it simmer away on the stove. Served it over bow tie pasta with some garlic bread. The family LOVED it! Next time I will try this in the slow cooker so I don't have to be around 2 1/2 hrs to stir it. YUMMMMMMMMMM... you will not be disappointed! (P.S. as with any recipe make sure you taste and season accordingly to your family's preferences)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SpiritedSadge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2260727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T16:35:16.247Z",
                "reviewBody": "Time consuming and worth every minute of it! The complexity of flavor is exciting in every bite full. Few small changes...De-glazed the pan with 1 cup white wine after the meat had cooked through, used tomato paste instead of sauce, added just a few strokes of fresh grated nutmeg to the finished sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Blue eyes baker 64",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1091003/"
                }
            }
        ]
    }
]