[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/699/world-cuisine/asian/japanese/",
                    "name": "Japanese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42231/sesame-crusted-mahi-mahi-with-soy-shiso-ginger-butter-sauce/",
        "name": "Sesame Crusted Mahi Mahi with Soy Shiso Ginger Butter Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1103883.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2018-03-21T16:26:26.000Z",
        "description": "Mahi mahi fillets are encrusted with black and white sesame seeds, and pan seared. The sauce is rich and creamy, and flavored with soy, ginger, shallots, and shiso (a Japanese herb related to basil and mint).",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "3 shallots, minced",
            "2 teaspoons minced fresh ginger root",
            "1 lemon, juiced",
            "½ cup dry white wine",
            "½ cup heavy cream",
            "½ cup unsalted butter, chilled and cut into small cubes",
            "3 tablespoons soy sauce",
            "4 shiso leaves",
            "coarse kosher salt",
            "ground white pepper",
            "2 tablespoons canola oil",
            "6 (6 ounce) mahi mahi fillets",
            "4 tablespoons sesame seeds",
            "4 tablespoons black sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a sauce pan over medium heat, combine shallots, ginger, lemon juice, and white wine. Cook  until liquid is reduced to approximately 2 tablespoons. Stir in heavy cream, and bring to light boil. Reduce cream by half; do not burn. Stir in soy sauce, then transfer to blender. Blend on low while slowly adding butter, a few cubes at a time, until all of the butter is emulsified. Roughly chop or tear shiso, add to sauce, and blend for about 10 more seconds. Season to taste with kosher salt and pepper. Keep sauce warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large saute pan over high heat. Season both sides of the fillets with kosher salt and white pepper. Mix together white and black sesame seeds, and place in a plate or flat dish. Press the TOP side only of each fillet into the mixture, and press seeds into fish so it sticks. Make sure that the crusted sides are evenly crusted with the seeds. When oil is smoking, add fish, sesame seed side down to pan, and be careful of oil splatters. Pan sear fish for about 30 to 45 seconds per side. Place pan into oven, or transfer fish to baking sheet, and cook in oven for about 5 to 6 minutes. Serve sesame crust side up with ginger butter sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Japanese"
        ],
        "recipeCuisine": [
            "Asian",
            "Japanese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Ryan Nomura"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.731543624161074,
            "ratingCount": 149,
            "itemReviewed": "Sesame Crusted Mahi Mahi with Soy Shiso Ginger Butter Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "501.6 calories",
            "carbohydrateContent": "11 g",
            "cholesterolContent": "191.9 mg",
            "fatContent": "34.6 g",
            "fiberContent": "2.6 g",
            "proteinContent": "35.6 g",
            "saturatedFatContent": "15.8 g",
            "servingSize": null,
            "sodiumContent": "775.7 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-19T23:11:47.647Z",
                "reviewBody": "Better than any restaruant can do!!!! This recipie rocks and is easy to do. I sought out and bought the Shiso and could not really taste it - so don't worry if you can't find it. I also found that I needed to cook the fish in the oven a bit longer than suggested to get it cooked all the way through. You owe it to yourself to try this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MDROUILL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1079232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-05T13:53:30.95Z",
                "reviewBody": "I was initially skeptical about this recipe combining western ingredients with an eastern recipe but my husband and I who are both self-professed foodies were very pleased. I saw no need to bake the fish I kept everything on the stovetop and it came out beautifully. I grated more ginger added more wine and cream and a touch more soy sauce. I used sole for my fish which cooks very quicky. Seared seasame was wonderful. After flipping the fish once I turned the heat to low covered the pan briefly while I blended the sauce. I turned the heat on hi again afterwards and poured some of the sauce on the fish and let it simmer for a few seconds. Then I turned the heat off completely and covered the pan so that the fish could sit in the warm sauce while we ate our udon beforehand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADUDTE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1202034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-20T17:00:31.423Z",
                "reviewBody": "WOW!!! OMG! This is BY FAR the best fish I've ever had! The sauce was the best part - Dee-Lish! I use 2 TBSP of ginger for the sauce. Also make sure the lemon you use is a large one. I usually make this with seared tuna steaks brushed with sesame oil then salt & peppered. All my friends have had this recipe and beg for me to make it! Thanks for the great recipe!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKYGRETCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T01:36:11.093Z",
                "reviewBody": "This also works with other fish besides mahi mahi. Halibut wahoo swordfish salmon and tuna also work well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ryan Nomura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-24T14:44:50.717Z",
                "reviewBody": "Amazing! I made this for a dinner party last night. This morning the emails are flying around about how amazing it was. The friends who were unable to attend last nights dinner party are begging for a repeat. The friend that did attend last nights dinner party are begging to be invited to the repeat. I was unable to find the shiso leaves but as others did I substitued fresh basil and mint. I used halibut as opposed to Mahi-mahi. It was cooked to a nice medium-rare to medium and was melt in your mouth good. I served this with Miso soup sticky rice and sauted green beans. Thank you for the recipe... My friends now think that I'm a much better cook than I really am!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-01T14:09:43.577Z",
                "reviewBody": "Amazing! This is one of the best fish dishes I have made. The sauce was labor intensive but can be made in advance and just warmed on the stove. My sauce was a little too thin so next time I will have to reduce more or add a thickener. But the flavor was fantastic. I used basil instead of shiso but next time will just omit it and add more wasabi as per another poster's suggestion (I only added a tiny bit next time will add at least a tsp). Don't skimp on the ginger in the sauce either. We liked it so much we're making it again with tuna tomorrow. Serve with steamed green beans sauteed with yellow bell pepper and toasted sesame seeds. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Delilah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440608/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-02T16:40:42.403Z",
                "reviewBody": "I found this to be a pretty good dish.  If you are having trouble finding shiso leaves, then go to any half way decent sushi restaurant, offer to buy 4 leaves, and they will more than likely give them to you.  Basil and/or mint do not make good substitutes, you would be better off simply omitting the shiso.  The sauce is basically a beurre blanc sauce with a Japanese influence. Muscadet is the traditional wine used for beurre blanc sauce, but any dry acidic white wine will do.  I usually use a Sauvignon Blanc with a very nice acidity to it, and I never use a wine for cooking that is not good enough to enjoy on its own.            I like my beurre blanc to have a very high acidity to it, like this one does, but for those who don't like a very acidic sauce, I might recommend cutting back a tiny bit on the lemon juice.          Next time I will try cooking the mahi mahi in olive oil, instead of canola, as I think that will improve on the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RandyLee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2950116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T16:42:24.043Z",
                "reviewBody": "If there were more stars offered this recipe would get them. It is FANTASTIC! The sauce is out of this world good! I didn't use mahi mahi becuase it wasn't fresh so I used orange roughy. I too was unable to find shiso leaves. I served the fish on a bed of jasmine rice (Allrecipe.com recipe) for a dinner party and everyone raved about it. This is my new favorite fish recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T03:16:23.483Z",
                "reviewBody": "Absolutely delicious. Sauce is also great on Ahi tuna and - you wouldn't believe it - pork tenderloin! You may also try adding a 1 tsp wasabi paste to the sauce into the blender and use less soy sauce (we try to use less salt in our food).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisabeth W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1639494/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-08T16:23:49.627Z",
                "reviewBody": "The fish was really good but the sauce was awful! It made me feel sick by the few drops that made it in my stomach. I will make the fish again but not the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chicago Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2063127/"
                }
            }
        ]
    }
]