[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42579/asiago-sun-dried-tomato-pasta/",
        "name": "Asiago Sun-Dried Tomato Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F91853.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:27:00.000Z",
        "description": "This recipe is sooo good and definitely not low fat. The creamy sun-dried tomato Asiago sauce is delicious!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 cups heavy cream",
            "1 cube chicken bouillon",
            "1 tablespoon Asiago Cheese",
            "1 tablespoon cornstarch, mixed with equal parts water",
            "1 cup chopped sun-dried tomatoes",
            "1 (16 ounce) package bow tie pasta",
            "¾ cup bacon",
            "¼ cup butter",
            "1 cup diced red onion",
            "2 cloves garlic, chopped",
            "1 cup chopped green onion",
            "1 pound grilled skinless, boneless chicken breast, diced",
            "1 cup heavy cream",
            "2 tablespoons chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, cook 2 cups cream until just bubbling. Watch carefully, to ensure that it doesn't boil over. Stir in bouillon and Asiago cheese. Stir with a whisk until dissolved. Add cornstarch mixture, and simmer until sauce is thickened, stirring constantly. Mix in the sun-dried tomatoes. Set aside, or cover and refrigerate for later use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a large saucepan over medium heat. Saute red onion until soft and translucent. Stir in garlic and cooked bacon, and cook for 2 minutes. Stir in green onions, chicken and 1 cup cream. Cook, stirring, until cream is heated through. Add Asiago cream sauce, and heat through. Toss with cooked pasta until evenly coated, and sprinkle with chopped parsley.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Michelle"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.616407982261641,
            "ratingCount": 451,
            "itemReviewed": "Asiago Sun-Dried Tomato Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "733.1 calories",
            "carbohydrateContent": "51.4 g",
            "cholesterolContent": "187 mg",
            "fatContent": "47.1 g",
            "fiberContent": "3.5 g",
            "proteinContent": "28.7 g",
            "saturatedFatContent": "26.6 g",
            "servingSize": null,
            "sodiumContent": "539.2 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-01T17:21:30.717Z",
                "reviewBody": "As written, this recipe is quite bland, but with a few easy adjustments, it became an AMAZING side dish that got (muffled, from a full mouth)incredibly good feedback from the boyfriend.  I used 1/2 2% milk and 1/2 cream, but almost a 1/3 cup of grated asiago, and it was perfect and creamy.  Also, skipped the butter and just threw the garlic and onion in at the beginning of rendering the bacon.  I left out the chicken, as that was my main dish, but cut the bacon into larger chunks and it was great!  Also doubled the garlic amount, and added salt, pepper, cayenne, and red pepper flakes to liven it up a bit.  At the end of sauteing the veggies i threw in about 8 oz sliced fresh mushrooms, and it was phenomonal!!  Tossed the cooked pasta with fresh chopped parsley, olive oil, pepper, and a little parmasan and served with Mushroom and Swiss Chicken (see review)...I thought my boy was gonna fall to his knees and start to sob from sheer appreciation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RANCHGIRL_59714",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ranchgirl_59714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T17:35:05.903Z",
                "reviewBody": "This is a fabulous recipe, especially if you follow some of the other suggestions in the reviews. Definitely use the 1 cup of asiago cheese for the real flavor of the cheese. I also substituted 2% milk for one of the two first cups of cream. I could have done without the sundried tomatoes. I realized too late that they should have gone in first thing so they could soften up and provide the flavor they were supposed to. I also used about 1/4 cup of chives in place of the green onion for color and for a less pungent onion flavor, the red onion provides plenty of that. A fabulous recipe, well worth the effort! Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karie Maurer-Enneking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/521166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T18:38:00.903Z",
                "reviewBody": "Made a few minor changes and thoroughly enjoyed this dish. Changes: Did not use bacon Used half milk half cream Used olive oil for veggies added a bit of butter for taste Doubled garlic Used 3/4 c asiago Added 1/4 cup chardonnay with initial cream and tomatoes Soaked sun-dried tomatoes ahead of time and simmered sauce after tomatoes went in on really low heat for about 15 minutes. Had to add a bit more milk. I think simmering the sauce with the soaked tomatoes really helped their flavor dispense.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bunsen78757",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1561341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-30T20:48:57.333Z",
                "reviewBody": "I didn't have asaigo cheese so I used parmesan. I also traded out the heavy whipped cream with milk and butter (1 cup heavy cream = 3/4 milk 1/3 cup butter) to lighten it. This is a wonderful recipe! Very delicious! Thanks Michelle! My family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/405389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T16:52:23.683Z",
                "reviewBody": "Wow delicious! In reference to previous reviews that complained of the tomatoes being too dry I would recommend either buying the sun-dried tomatoes packed in oil or re-hydrating the dry kind by immersing them in a little olive oil and water and microwaving for 30-40 seconds. Drain them and add them at the same time as the asiago and bouillon. I only made a few slight modifications. The heavy cream is really not necessary I used 2% for the first part and 10% for the second and the sauce came out plenty rich! Also if you're a garlic fan double what the recipe recommends. I used about 1/3 of a cup of Asiago as someone had recommended but found it a bit too salty. I will use a little less next time or omit the bacon. Great dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2824110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-22T01:46:10.593Z",
                "reviewBody": "G-O-U-R-M-E-T!!! This was delicious! I could have drank the asiago cream sauce by the glass for starters. I made a few changes & it was perfect. I'll be making this for company soon. I added basil freshly ground pepper & extra cheese to the sauce. I used much less than 1 cup of sun-dried tomatoes. I wasn't sure if I liked them or not so didn't want a bunch. I probably used 1/3 cup & it was perfect. I also omitted the red onion since I don't like cooked red onions and used 8 ozs of fresh mushrooms sliced instead. YUM! The last cup of heavy cream I switched to 1 cup 1% milk. I never need to eat out again. This is better than anything at Olive Garden--seriously! Everyone at my house loved this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARKANDDEEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1390556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-24T18:28:51.55Z",
                "reviewBody": "This is my absolute favorite meal EVER!!! I would give it 10 stars if I could. I did make a few changes though. First, you must add more cheese, I use about a cup. Second, I use chicken tenders and marinate them in Italian dressing (at least) overnight. Finally, I skip the green onion. I love green onion, but found them to be quite overpowering in this dish. I have made this numerous times and have even taken it to a pot luck dinner. I left with an empty dish and everyone left with the recipe! Thanks for posting!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAWN316",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/786117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T22:28:59.17Z",
                "reviewBody": "This recipe was great just like something you'd get at a resturaunt! I took the advice of increasing the cheese (I used about 3/4 cup) and I decreased the onion (boyfriend is not too fond of them I used 1/2 cup each of green and red and still was a bit much). I would half the recipe if not making it for a group of people next time. Since there is only two of us we had lots of leftovers which wouldn't usually be a problem since we try to take leftovers for lunch the next day. When reheating the sauce breaks and becomes very greasy! Otherwise it was great and will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BERDISA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/895310/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-01T04:35:26.03Z",
                "reviewBody": "DELICIOUS! I didn't want this to be too dense so I used half and half in place of the heavy cream and increased the Asiago to 3/4 c. I followed another reviewers suggestion to add the sundried tomotoes from the start to allow them to soften up, so glad I did. Other than that, I didn't have a red onion on hand so I used shallots and sauted that in 2 tblsp of olive oil rather than butter. I also threw in about 1/2 c. of pine nuts w/ the garlic and shallots, omitted green onions and used 1/4 c. chopped fresh basil. I used Penne pasta and toppped w/ parsley and feta cheese. My new favorite dish! Thank you so much Michelle, for sharing such a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEVANS211",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1113827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-13T18:36:01.043Z",
                "reviewBody": "This recipe didn't tell you when to add the sun-dried tomatoes and I though it was a little to much onion. Not one of my families favorites especially considering all the work that went into making it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554046/"
                }
            }
        ]
    }
]