[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45514/blue-cheese-potatoes-delmonico/",
        "name": "Blue Cheese Potatoes Delmonico",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F787445.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:27:38.000Z",
        "description": "Here's a recipe that I recently made for a dinner party.  Everyone loved it served with rib-eye steak. Goes really well.  The blue cheese makes all the difference.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "8 medium potatoes, peeled and cubed",
            "½ cup butter",
            "½ cup all-purpose flour",
            "1 cup milk",
            "1 cup cream",
            "½ cup crumbled blue cheese",
            "⅓ cup bread crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Place the potatoes in a large saucepan with water to cover. Bring to a boil over medium-high heat, and cook until tender, about 8 to 10 minutes. Drain, and transfer to a casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a medium saucepan over medium-high heat. Whisk in the flour, and cook for 5 minutes, stirring constantly. Gradually whisk in the milk and cream so there are no lumps.  Reduce heat and simmer for 20 minutes. Remove from heat and whisk in the blue cheese until smooth. Pour over the potatoes in the dish. Sprinkle breadcrumbs over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes in the preheated oven, or until top is nicely browned.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SMITHJLS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.629032258064516,
            "ratingCount": 62,
            "itemReviewed": "Blue Cheese Potatoes Delmonico",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "612.8 calories",
            "carbohydrateContent": "65.2 g",
            "cholesterolContent": "106.7 mg",
            "fatContent": "34.7 g",
            "fiberContent": "6.8 g",
            "proteinContent": "12.3 g",
            "saturatedFatContent": "21.6 g",
            "servingSize": null,
            "sodiumContent": "358.8 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-03T09:44:59.657Z",
                "reviewBody": "The general idea of the flavors (potatoes/BlueCheese) sounded great but the recipe is ALL WRONG. Should probably be around 3T. Butter and 3T. Flour and NOT 1/2 cup of each. That would make a very thick sauce or if cooked for 20 minutes I would think a brick. I started the recipe not realizing the measurements and ended up making around a triple batch. The recipe has you cooking the flour for 5 minutes and then after adding the flour cooking an additional 20 minutes. I think the person making the recipe just meant it to be 2 cups of a white sauce and then add blue cheese. If I make this again I would do as above (probaby use 2C milk instead of 1/2 cream) and also add onion to the butter or maybe onion powder. If you add too many seasonings I could see them taking away the mild flavor of the blue cheese (which will be mild once mixed with potatoes). Altogether I like the idea of adding blue cheese for something totally different than what we would normally cook but the recipe is totally wrong. I felt I wasted a lot of Blue Cheese on my first try which is considered a luxury food in our household. I am leaving a 2 star review just for the unique idea of this dish. What a clever idea of adding Blue Cheese to potatoes. Made my mouth water just thinking about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef 'Chelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefchelle/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T19:24:44.053Z",
                "reviewBody": "Deserves 5 stars because this is the BEST recipe to build upon!! Choose a high quality Blue cheese. I sauted 2 garlic cloves and 3 shallots in the butter before adding the flour(reduced by 2 tbs.) and cooked for only one minute before adding a pint of half and half. I thinnnnly sliced RAW potatoes and lightly salt and peppered them before pouring over my sauce and crumbs. I baked at 350 for about an hour in a covered ungreased pan. Great recipe Judy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PENELOPE4321",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/777935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T18:51:44.03Z",
                "reviewBody": "I give the recipe 2 stars but my results were definitely 5 star. I had to make way too many changes to it. Just looking at the recipe you can tell something's not right. For one thing 1/2 cup each of butter and flour is WAY too much roux for just 2 cups of liquid. My bechamel would have been a brick! Additionally this recipe needed flair. It has practically no flavoring except the blue cheese. So I sauteed some garlic and Herbs de Provence with the butter to infuse it with a little seasoning (I'm sure any other herbs you like would be fine) before I added the flour and liquids. I doubled the amount of blue cheese added Kosher salt to taste a hit of white pepper and just a pinch of nutmeg to give it that little something that makes you go \"Hmm.\" Remember to always TASTE your sauce and correct the seasonings as necessary. It's too late once your food comes out of the oven! I had a pouch of Simply Potatoes hash browns on hand so I stirred those into the sauce instead of having to cook the potatoes first and it made things MUCH easier on me. Topped off the casserole with panko bread crumbs and the results were mouthwatering. So 2 stars for a decent starting point but I definitely had to change it to make it interesting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "FeedingDarragh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/965018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T00:13:13.1Z",
                "reviewBody": "I have made this recipe a few times altering it to get the correct ratios. Apparently the third time is a charm because this time when I made it it was delish! I used 1/4c butter and 1/4 flour half & half instead of whipping cream and 1 cup of gorgonzola cheese (I like it a little better than blue cheese). I also added salt and pepper to the flour/butter mix. It was not greasy or pasty and we could really taste the cheese. My husband and I both loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stephj626",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2305593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T17:05:53.467Z",
                "reviewBody": "Oh my...I am from the midwest and I still found these to be the most bland things I'd ever tasted. For starters the two main ingredients in the topping are butter and flour. In restaurants oil and flour are heated together to add to sauces as a thinckening agent that has no flavor to ruin the sauce's taste. Right there should be your (and should have been mine) cue that this recipe needs HELP. Not to mention that blue cheese as a salad dressing flavor is very flavorful but actual cheese is not very potent at all...However all that aside this recipe has potential. Reduce the amount of potatoes for sure. Use way less flour or add about 3 times more cream. Add some seasoning besides salt and pepper...garlic thyme oregano SOMETHING. And forget the blue cheese despite the catchy name. Go for a soft crumbly cheese with robust flavor maybe an herb spiced feta. Do all this and although you have a pretty much different recipe you may be able to pull this off. Even with filet mignon as is you will be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SPACEYCRAZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/175010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T16:17:42.06Z",
                "reviewBody": "WOW! I made these with ribeyes scaled the recipe to 2 servings (my 2 older children are at my sisters for the night) and my husband cringes at the mention of cheese in a recipe (he hates it). I cut the flour down to about 1/2 of what was callde for and added some white pepper and some salt (this really needs salt). I also baked it in my toaster oven since it was a small dish and the bread crumbs turned nice & brown I LOVED THESE! I can't wait to share with the kids I may even throw some ham in there to make it an easy meal. Thanks Judie!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T17:05:53.59Z",
                "reviewBody": "This is a great recipe. Although I had to doctor it the second time around. The first time I followed it according to the recipe. WAY too much flour caused it to be pasty. The second time I lessened the flour and added a bit more blue cheese and some garlic powder and fresh onions. DELICIOUS!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBSARARC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T01:14:31.81Z",
                "reviewBody": "This was absolutely incredible! At first I thought the bleu cheese might be too overpowering but it wasn't. I did change the recipe up a bit based on other reviews. I changed the amount of flour to 4 tablespoons. I also added quite a bit of seasoning to it. Being that I'm from New Orleans I like to kick it up a notch...\"BAM!\" I sauteed garlic in the butter and I added about 2 tablespoons of Old Bay seasoning to the cheese/cream mixture. Everyone that ate it can't stop talking about it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Niki Mouton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-17T01:23:05.77Z",
                "reviewBody": "After reading all of the reviews I decided to sautee the butter with two cloves of garlic added garlic salt and pepper too!I didn't add the flour instead used one cup of fat free half and half to cut back on the excessive calories!It was full of flavor and crispy on top and not so creamy but it's definately a recipe you can \"doctor\" up!I will make this again for sure I also sliced the potatoes thin and didn't boil the potato baked for one hour in 350 degrees and it turned out very very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ARCELI6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/415835/"
                }
            }
        ]
    }
]