[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45587/five-layer-ice-cream-bars/",
        "name": "Five Layer Ice Cream Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1153663.jpg",
            "width": 1536,
            "height": 2048
        },
        "datePublished": "2018-03-21T16:27:40.000Z",
        "description": "Do you love having a Buster Bar&reg; at Dairy Queen? This is it, but better!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "1 ½ cups evaporated milk",
            "⅔ cup chocolate chips",
            "½ cup butter",
            "2 cups confectioners' sugar",
            "1 teaspoon vanilla extract",
            "1 pound chocolate sandwich cookies, crushed",
            "½ cup melted butter",
            "½ gallon vanilla ice cream, softened",
            "1 ½ cups roasted Spanish peanuts",
            "1 (12 ounce) container frozen whipped topping, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, combine evaporated milk, 1/2 cup butter, chocolate chips, and confectioners' sugar. Bring to a boil, and cook 8 minutes, stirring constantly. Remove from heat, and stir in vanilla extract. Allow to cool thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together crushed chocolate sandwich cookies and 1/2 cup melted butter. Press onto the bottom of a 9x13 inch pan; freeze until firm. Spread softened ice cream over crust, then freeze until firm. Spread top with cooled fudge sauce, and sprinkle with peanuts; freeze until firm. Spread with whipped topping, and freeze until firm, or overnight.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ROCHELE_99"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.840909090909091,
            "ratingCount": 88,
            "itemReviewed": "Five Layer Ice Cream Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "426.8 calories",
            "carbohydrateContent": "43.7 g",
            "cholesterolContent": "44.3 mg",
            "fatContent": "26.8 g",
            "fiberContent": "1.9 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "13.8 g",
            "servingSize": null,
            "sodiumContent": "241.7 mg",
            "sugarContent": "34.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-01T22:29:13.813Z",
                "reviewBody": "HUGE hit.  Huge. Unequivocally the star of the show.  This dessert brought grown men to their knees.   Never mind dinner,  I could have served this and this alone and I think everyone would have been happy. Hubs had requested I make an ice cream dessert for our Memorial Day cook-out and I was less than enthusiastic. None of the recipes really tripped my trigger, but I finally settled on this one, I guess because it called for something homemade and not processed - the fudge.  Sure, you could take the easy way out and use a jarred fudge sauce but this was so easy to make it's not really worth it to take the shortcut.  I wasn't expecting much from this dessert. After all, it's basically just a hot fudge sundae, right?  WRONG.  This stuff is good - awesome good. Just a few cookie crumbs, some ice cream, fudge, peanuts and some whipped topping, but man, put them all together and you've got a dessert that everyone loved and that truly made a dinner get-together finale memorable.  None of us knew what a Buster Bar was, but all agreed this was \"D good.\"  This was the first, but not nearly the last, time I'll be making this.  I followed the recipe exactly, but thought the dessert would look a little naked with just the Cool Whip topping (curious, too, that the Cool Whip didn't even offend me in this dessert!) so I sprinkled it with more Oreo cookie crumbs.  (One other bonus - the crust actually comes out of the pan intact!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-18T14:27:28.033Z",
                "reviewBody": "This is very tasty. My guests loved it! One tip, buy 1/2 gallon box of ice cream, open the package completely and simply slice the ice cream into 1 inch thick pieces and lay them over your crust.  No softening of the ice cream required! Which means you can spread your fudge sauce immediately! Makes the entire assembly process much faster. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11267185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T03:59:49.93Z",
                "reviewBody": "Wow! This is absolutely amazing! I will tell you what I did with this recipe...I made the fudge sauce as directed and it was out of this world amazing! I made my own homemade vanilla ice cream instead of using store-bought. I then cut the rest of the recipe down to fit in a springform pan. The fudge sauce in the recipe alone is a keeper. Don't forget the spanish roasted peanuts! I found Planter's Roasted Spanish Peanuts w/Sea Salt at my local grocery store. I was also able to spread out each layer on top of another without having the freeze into between.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:54:13.09Z",
                "reviewBody": "This was an excellent frozen dessert. Guests at my dessert buffet gobbled it down quickly. For their more complex palates I used Starbucks Cappucino Ice cream rather than vanilla. I also had a dab of coconut and some toasted pecans that I placed in the food processor with the butter and chocolate cookie wafers. This addition added a nice texture to the crust. Thanks Michelle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-21T19:16:59.09Z",
                "reviewBody": "Review of item as written: Needed a make-ahead option for hosting a dinner in a location with limited facilities. This dessert is very durable for transport & of course, being frozen, keeps well. Made it twice now with good results both times. \n\nDivergences, suggestions: Make sauce first, allow to cool. Soften ice cream, layer on crust, press chopped nut layer in while soft. Put in freezer until hard-set, then spread fudge sauce over top & sprinkle with any additional nuts as desired. (This prevents layers blending/rising/etc.) Subbing sweetened condensed milk for the evap + sugar works & eliminates the boiling process. A brownie or cookie base is a nice alternative to the crumb crust. Additional chopped peanuts on top of the fudge layer are pretty. Other flavor combos to consider are caramel/cashew, butterscotch/pecan, chocolate/pretzel, marshmallow/walnut instead of fudge/peanut. Alternative ice cream flavors can also introduce variety. Good recipe as presented, tremendous capacity for variation as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MelloYello256",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5937297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:54:13.857Z",
                "reviewBody": "This is like a pumped up version of a peanut buster parfait from DQ! I made this for my son's 3rd birthday and I am still getting requests for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-17T17:38:44.737Z",
                "reviewBody": "Just like Dairy Queen peanut buster parfait. Now that I know how to make the chocolate icing will be switching it up to butterscotch and peanut butter flavour. And freezes very well and can last along time in the freezer - no need to rush through this dessert - can save some for next week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6586908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-07T16:17:32.147Z",
                "reviewBody": "While I haven't eaten this as a whole I tasted each of the components and it's going to be amazing! (I made it for a dessert menu special at work and couldn't cut into it quite yet.) The fudge sauce is KILLER!! Paired with a tasty oreo crust and delicious vanilla bean ice cream how could this not be an awesome treat?! I used dry roasted nuts since I didn't have Spanish nuts on hand and I think it will work though I know Spanish peanuts is more traditional for this Dairy Queen dessert replica. A great treat for a hot summer day! This fudge sauce is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FNChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fnchef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-20T00:39:00.88Z",
                "reviewBody": "I made this for a group of friends and everybody loved it. One of them said it tasted better than Dairy Queen! I followed the recipe exactly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline Lafrance",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/823323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-30T05:27:51.42Z",
                "reviewBody": "I thought this recipe was just OK. I'm not a huge nut fan to begin with so I would cut the peanuts by a 1/3 or 1/2 on top. The hot fudge topping is delicious. I think if I were to do it over again I would make 1 1/2 times the hot fudge of what the recipe calls for. However I think there's better desserts out there. I'll try something else next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/367938/"
                }
            }
        ]
    }
]