[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
                    "name": "Filipino",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/47015/quick-and-easy-pancit/",
        "name": "Quick and Easy Pancit",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5886739.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2018-03-21T16:28:09.000Z",
        "description": "Quick, Easy and delicious! Will remind you of Island Fiestas!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "1 (12 ounce) package dried rice noodles",
            "1 teaspoon vegetable oil",
            "1 onion, finely diced",
            "3 cloves garlic, minced",
            "2 cups diced cooked chicken breast meat",
            "1 small head cabbage, thinly sliced",
            "4 carrot, thinly sliced",
            "¼ cup soy sauce",
            "2 lemons - cut into wedges, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Filipino"
        ],
        "recipeCuisine": [
            "Asian",
            "Filipino"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Heather Maurer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.373949579831932,
            "ratingCount": 476,
            "itemReviewed": "Quick and Easy Pancit",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "369 calories",
            "carbohydrateContent": "65.1 g",
            "cholesterolContent": "35 mg",
            "fatContent": "4.9 g",
            "fiberContent": "7.3 g",
            "proteinContent": "18.1 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "788.6 mg",
            "sugarContent": "7.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-08T19:51:11.36Z",
                "reviewBody": "Wonderful! Tasted just like my mom's pancit!\n\nI used rice noodles and soaking them for about ten minutes did the trick, but make sure to break the noodles before soaking them or you'll have some really long noodles. The noodles, when cooked, will come out with an al dente texture to them.. Even Mom's leftovers still had that a day or two later.  It's just the nature of the beast.\n\nJust a couple of things: I switched in green onions for the diced onions for color, used leftover chicken (this is a great dish for any leftover meat, including beef and pork) and used garlic powder to control the garlicky flavor better.  Perhaps most importantly, I used Kikkoman soy sauce to cook with.  Growing up, Kikkoman was for cooking with, due to it's lighter flavor, and La Choy was for seasoning at the table.  I still follow that rule, and it works very well for pancit.\n\nI would highly recommend adding as many veggies and meats as you would like, just increase the amount of sauce you need. \n\nThe only warning I'll leave anyone with is that I found the meat too salty after having been sauteed with the veggies in the soy sauce and oil.  Next time I prepare this, I will saute the veggies by their lonesome until just about done, then throw in the meat to warm, followed almost immediately by the noodles.\n\nPlay with it, make it your own, and enjoy!  This is an awesome, easily prepared party dish.  You'll be amazed by how much is made with one package of noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne Cupertino",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/882423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-15T03:04:06.63Z",
                "reviewBody": "When you shop for the rice noodles, look for the package labeled \"pancit bihon\", or \"bihon\". Keep in mind that not all rice noodles are the same. Some rice noodles are for Vietnamese pho, while some are for pad thai. I am Filipina, and I like to garnish my pancit with thinly sliced green onions. They add color and additional flavor. Another traditional topping is sliced hard boiled eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "always_hungry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1778537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T00:50:35.467Z",
                "reviewBody": "This is great recipe for pancit - for those who didn't rate it at 5 - either you didn't follow the recipe, or you don't know what pancit bihon is all about.  The flavor is just right and if it isn't what you've had before then it's just an adjustment of ingredients.  As a first generation Flip, let me tell you that this is the recipe to try if your craving pancit!!!!  I personally prefer shrimp and shitaki mushrooms mixed in - simply because that's how my family made it - so without those two ingredients it seems like something is missing.  Soak the rice noodles until they are soft and pliable/wiggley.  I added maybe a cup more of broth - some like it on dry side, I like it moist but not soupy - some like it that way too!  Try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYBUGONTHEGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1036672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-13T20:47:48.017Z",
                "reviewBody": "My hubby is Filipino and when some of his family visited and had been in the states eating our food for so long, I thought I'd be brave and prepare one of their favorite dishes; pancit. I followed this recipe with only a couple exceptions. I added small shrimp along with the chicken and used \"Silver Swan\" soy sauce from the Philippines which we are fortunate enough to get at a local Oriental market. I have to tell you, I have never received so many compliments on a dish as I did this one. Our Philippine relatives were stunned that an American could make their national dish just like they do back home.  My husband's aunt even asked for MY recipe.  Oh my gosh,  talk about anchored. Have since made this dish combining chicken and pork cut into bite size pieces and included the shrimp as well. Hubby took it to an office pot luck and while there called to ask me to fax the recipe to his office so he could copy it and give it to 13 people who had asked for it.  I don't do this often but often enough to get rave reviews every time it graces our table!  And yes, it makes a lot but we enjoy it even more re-heated and it is the perfect dish to share at a potluck. I can't thank you enough for sharing this tremendously popular recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gail Cobile",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-21T21:45:51.553Z",
                "reviewBody": "Very authentic!! I did change a little though, yet it still gets a 5 because the recipe is still pretty much the same. I used strips of pork because thats how I grew up eating it. I sauteed the garlic (4 cloves) and some green onion. After removing garlic/onions from wok, I put fresh ground pepper on raw pork and cooked it, splashing some soy sauce on halfway through. I then removed the pork and cooked the veggies, adding the garlic and onions back to the pan and putting additional soy sauce on them. Then once cooked most of the way, I added the pork and noodles until heated all the way through. I have to say, a bit more flavorful than my dads....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay from B'more",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2777859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T15:40:33.653Z",
                "reviewBody": "This is delicious. I made it as a vegetable dish though without the chicken. I used pancit noodles which I think is something different then the dried rice noodles stated in the recipe. I didn't place them in a bowl with water to soften them but broke them apart a little then mixed them in with the vegetables and they became softer once they were in the steam for a bit. Also I put 1 oxo cube in a 1/2 cup water and put that in the pan after cooking the onion and garlic and before putting in the other vegetables. It gave the dish a very nice flavor. I served this with chicken adobo lumpia and Jasmine rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER72_00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-30T17:02:01.14Z",
                "reviewBody": "First time making pancit and this was easy!The noodles soften in warm water while I chopped the onions and garlic. I used sesame oil , added 2 tbsps of Fish sauce and an extra tbsp of soy sauce to give the noodles a little more flavor. Added some pepper flakes and slices of fried egg for presentation(per my Phillipina friend's suggestion!)and voila! I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marissa's Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1757165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T19:12:48.543Z",
                "reviewBody": "My husband just got out of the Marine Corps and I have been craving pancit that my phillipino co-workers used to make. This is a wonderful recipe I would not change a thing. My family which is German has never had pancit and they loved it! Thank you for such a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheoah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/929371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T23:43:18.48Z",
                "reviewBody": "Didn't really enjoy this. The texture of the noodles were... not very good. The flavor seemed pretty bland. Serrano hot sauce had to save it to be edible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MTCHYG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1111625/"
                }
            }
        ]
    }
]