[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50603/garlic-and-artichoke-pizza/",
        "name": "Garlic and Artichoke Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F391246.jpg",
            "width": 1800,
            "height": 1200
        },
        "datePublished": "2018-03-21T16:29:22.000Z",
        "description": "Deliciously quick and easy - a gourmet pizza in half the time you would think! You could use any pizza crust, but Quick and Easy Pizza Crust submitted to this site by Amanda Rider fits the definition of quick, easy, and delicious!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 unbaked pizza crust",
            "¾ cup spaghetti sauce",
            "1 (6 ounce) jar marinated artichoke hearts, drained, liquid reserved",
            "1 medium tomato, cut in half and sliced",
            "2 cloves garlic, minced",
            "1 pound shredded Colby-Monterey Jack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 450 degrees F (230 degrees C). Prepare pizza crust according to recipe or package instructions. Place on a pizza pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the liquid from the artichokes into a small skillet, and bring to a boil over medium heat. Cook for 1 minute, or until the liquid is almost gone. Add garlic, and cook, stirring, for less than a minute. Add artichoke hearts, stir to coat with garlic flavor, then remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread spaghetti sauce over the prepared pizza crust. Sprinkle with cheese, then place the artichoke hearts and garlic over the cheese. Arrange tomato slices evenly over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, until crust is puffed and golden, and cheese is melted.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brandosgirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.134328358208955,
            "ratingCount": 67,
            "itemReviewed": "Garlic and Artichoke Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "356.5 calories",
            "carbohydrateContent": "25 g",
            "cholesterolContent": "55.4 mg",
            "fatContent": "21.3 g",
            "fiberContent": "2 g",
            "proteinContent": "17.3 g",
            "saturatedFatContent": "13 g",
            "servingSize": null,
            "sodiumContent": "852.6 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-11T17:55:57.68Z",
                "reviewBody": "O.k. as is but to me it's way better when using a white sauce (olive oil w/ minced garlic warmed in microwave to infuse the oil) or a pesto sauce. We also like it with a stronger cheese like romano mixed w/ mozzerella. Fresh basil is really good on this too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-30T03:53:58.81Z",
                "reviewBody": "This was delicious! I used a whole-wheat Boboli thin pizza crust and instead of spaghetti sauce I just used plain tomato sauce sprinkled with Italian seasoning and parmesan cheece. The artichoke hearts were sooo good cooked with the garlic. I had some Gouda cheese that I had to use so I used that instead of Colby. This was the best pizza I've ever made! I think next time I will double the garlic. Oh and I definitely didn't use that much cheese! Maybe 1.5 cups of shredded cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-08T14:57:29.633Z",
                "reviewBody": "This pizza tasted really good for the first time that I made it with a good cheesy texture and delicious artichokes that make it worthwhile eating for one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheerios",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cheerios/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-12T19:35:10.123Z",
                "reviewBody": "Would be 5 star I think if used different cheese. Perhaps mozzerella and some feta? Great if you are a fan of veggie pizza. Made some modifications: added about half of red bell pepper to the garlic/artichoke saute and this really helped on issue of excess liquid that many reviews commented on. Also added fresh basil during about the last 3 minutes of cooking -- really adds to flavor. Used Boboli pizza crust and sauce -- good choice. Boboli crust instructions said to only cook for 10 minutes whereas the recipe said 20. Took out after 10 but flavors weren't quite there yet. Put back in for about another 10 and it was much better and crust held up fine to the extra 10 minutes of cooking. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pdizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2633298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-11T16:34:59.2Z",
                "reviewBody": "Pizza is pizza. I've even put clams and oysters on pizza. I made this one years ago. Just thought I would share some tips. There is a conversion chart somewhere that shows how to mix tomatoe paste and make it into sauce juice and catsup. So I never spend my money on premade sauces. Whenever I use a sauce for pizza I always mix in some oregano and some dried red pepper flakes. It gives the taste of NYC to your pizza. I also like to add salt but only to veggie only pizzas and have even put olive oil on others under the cheese not too much to give it that nutty flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Unkie Stew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1585650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-12T14:01:57.09Z",
                "reviewBody": "We thought this was good but seemed to be lacking something. Maybe adding chicken as one reviewer suggested would help. We use our own pizza crust recipe so we altered it a little according to how we always cook pizza. I put the sauce tomatoes and artichokes first. We cook it for about 15 minutes then add the cheese and cook for about 10 more minutes. This keeps the cheese from burning. Next time I wouldn't bother with cooking the artichoke liquid with the garlic. I used pre-chopped garlic and would just add both of them to the pizza. I didn't see much value in cooking the garlic in the artichoke liquid.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Fegler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-05T13:54:33.56Z",
                "reviewBody": "This was fabulous! I used a blend of Italian cheese instead of the Colby Jack Roma tomatos and sprinkled it with parmesan cheese before baking. I made a 12\" pizza and 1 - 8 oz. package of cheese was more than enough. Next time I'm going to add Feta cheese. Excellent! Thank you so much this recipe is definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina Rupnow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T18:59:41.943Z",
                "reviewBody": "This is delicious! I put way more garlic on it than this calls for. I get the garlic pre-roasted from my grocery store's olive bar that way there is no fuss no muss. If I don't have those handy I roast a whole garlic - cut the tops off and put a bit of olive oil over it and roast for about 40 minutes. Perfect for a lot of different dishes. On this recipe I use the Boboli ready-made crust and it's perfect. The whole thing from start to finish takes about 15-20 minutes. I also add some fresh (dried would work as well) basil. Thank you for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1911691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T19:27:25.9Z",
                "reviewBody": "This is a tasty pizza and went very well with some left-over Bodacious Broccoli Salad from this site that I served it with. But I'm one of those who don't see the point of the simmering liquid part. It makes it more time consuming dirties a pot and is actually quite strange taste-wise. It gave the pizza a wierd oily preservetive-y taste that I really disliked. Luckily I didn't have the patience to wait until the liquid thickened and poured most of it down the drain before adding. I think that rescued the meal. Next time I'll save the time and effort and put everything straight on the pizza. Otherwise good stuff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Babzil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1855628/"
                }
            }
        ]
    }
]