[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56826/liquor-infused-chocolate-strawberries/",
        "name": "Liquor-Infused Chocolate Strawberries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F535971.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:31:52.000Z",
        "description": "Absolutely delectable and rich! Strawberries are injected with orange brandy, and dipped in rich dark chocolate. You don't have to put the white stripes on, but it gives a very professional look. Once you make these they won't last long! Takes a little time but its worth it!",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "16 strawberries",
        "recipeIngredient": [
            "16 large fresh strawberries with leaves",
            "½ cup brandy-based orange liqueur (such as Grand Marnier®)",
            "1 pound bittersweet chocolate, chopped",
            "2 tablespoons shortening",
            "2 tablespoons heavy cream",
            "¼ cup brandy-based orange liqueur (such as Grand Marnier®)",
            "1 (1 ounce) square chopped white chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse strawberries and dry thoroughly. Use a syringe or clean marinade injector to inject about 2 teaspoons of brandy into each berry. Place them on a baking sheet, and refrigerate for about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a metal bowl over a pan of simmering water, combine bittersweet chocolate and shortening. Stir occasionally until melted and smooth. Stir in heavy cream and 1/4 cup of brandy. Place white chocolate in a separate bowl, and when the dark chocolate has melted, place the bowl of white chocolate over the pan of simmering water, stirring occasionally until smooth. Be sure to remove from heat as soon as it is mostly melted, white chocolate can be sensitive.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip strawberries into chocolate, and let the excess drip off into the bowl before placing on waxed paper to set. When the strawberries have all been dipped in chocolate, dip a fork into the white chocolate, and drizzle back and forth over berries to stripe.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KELSTOUCH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.7837837837837838,
            "ratingCount": 37,
            "itemReviewed": "Liquor-Infused Chocolate Strawberries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "231.5 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "4.1 mg",
            "fatContent": "12.5 g",
            "fiberContent": "2.6 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "4.6 mg",
            "sugarContent": "19 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-13T21:33:34.663Z",
                "reviewBody": "Changed the injected liquor to suit the tastes of my guests.  Instead of brandy, I injected rum into the strawberries, let them sit for about an hour to marinate, then dipped them into chocolate.  Did not try to add liquor or cream to the chocolate mixture, just dipped them into chocolate that was melted over a simmering water. This recipe is very versatile as you can insert what ever liquor you prefer into the strawberries.  Excellent idea!  These are always requested at girls night.  But as another reviewer mentioned, there are occasions of escaping streams of liquor while trying to inject strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kareykinns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/320713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T21:33:43.46Z",
                "reviewBody": "I've made these twice and learned a few things. Very Fresh Firm strawberries are best (pay extra for the quality). 1 pound of choc is too much-use 1/2 to 3/4 pound and adjust the added Grand Marnier. The more GM in the choc the more is looses it's smooth texture. Don't even try to get 2 tsp of GM into a strawberry unless it's extra huge settle for 1/2 tsp and move on. With those adjustments...WOW! This was a fabulous treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DHILEMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:51:43.53Z",
                "reviewBody": "My friend and I made these strawberries for Valentine's Day as gifts. I felt the strawberries were too strong and would probably change them by not adding the grand marnier to the chocolate. Also by not adding the grand marnier the chocolate would have had a more smoother look to it. Or it may just be that orange brandy isn't my type of liquor. My friend on the other hand loved them. And people we gave them to as gifts thought they were fabulous. I also made a batch of plain strawberries just in case people didn't like the bradied ones. So they were still enjoyable regardless. I would definitely make them again to give out as gifts. Something to keep in mind... while infusing the strawberries watch for shooting streams of alcohol:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JABO1230",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-06T12:29:30.81Z",
                "reviewBody": "These strawberries last about 2 seconds once you bring them out! You can only inject about 1/2 tsp in a regular sized berry. You'd need \"frankenfruit\" to be able to put 2 tsp in a strawberry. I used a thin shishkabob stick to make a hole at the middle of the strawberry leaf down into the middle to make more room for the liquor. Be careful not to poke the hole through the strawberry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFMARGARITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1176889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-01T16:06:37.06Z",
                "reviewBody": "I gave this 2 stars because of all the pain this recipe put me through. I had to make 3 trips to the store and paid over 35 for chocolate and spent half the day making them. Great idea for strawberries but do yourself a favor just melt the chocolate and DO NOT add anything to it. Even tempered the cream and grand marnier will harden the chocolate instantly. With all said and done they came out beautiful and they tasted wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Corinna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/526474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-15T04:46:19.473Z",
                "reviewBody": "These were very good. I just used dipping chocolate without the other liquids because I didn't want to mess with trying to keep the chocolate from seizing. I didn't have a syringe in the house so I took another reviewer's advice and used a skewer. I poked 3 tunnels in the small end of each strawberry and they stayed upright on the leaf end. I used a pastry tip as a funnel to pour the liquor in. After a half hour in the fridge the liquor either soaked into the strawberries or solidified enough that it did not leak out when I turned the strawberries upside down to dip. I made some with rum some with rum cream and some with Bailey's. I thought the ones with Bailey's were best but they were all delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1492907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-12T23:08:47.597Z",
                "reviewBody": "I used 1 pound of milk chocolate with 2 tablespoons shortening. I also infused the strawberries with Godiva Cappuccino Liqueur. Let me tell you these were fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hunter StClaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-11T18:31:55.107Z",
                "reviewBody": "Roommates barely let the chocolate set before they gobbled them up! I used three different liquors: Grand Marnier Kahlua and Bailey's Irish Cream (which we ended up liking the most). Before I injected the strawberries I used a toothpick to dig a small \"well\" in the center of each strawberry as previous reviewers have suggested. After I injected the strawberries I placed them in separate compartments of an empty ice cube tray which helped keep things neat and tidy. I also didn't add any GM to the chocolate and opted instead to drizzle the chocolate over the strawberries. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mooncaked",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1900152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T05:51:44.043Z",
                "reviewBody": "I was looking so forward to making these and although they tasted alright they were a pain to make (Sorry! I planned on about 30 min since it was my first time to make them but I spent the entire day) I followed the recipe exactly and as soon as I added the Gran Marnier and heavy cream (which both were room temp) my chocolate/shortening mixture thickened up like my chocolate crackle cookie mixture. I tried to thin it out with heating but ended up throwing it out and making another trip to the store. This time I used 1/2 the amt. of chocolate (because I purchased the last of the chocolate that the store had) and once again it thickened. I thinned it out somewhat by adding more Gran Marnier and cream but had to keep heating and stirring in order to keep it at a consistency that I could dip my strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMOMRPH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/775739/"
                }
            }
        ]
    }
]