[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/65924/ambers-sesame-chicken/",
        "name": "Amber's Sesame Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F255442.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:34:38.000Z",
        "description": "I've been looking for a good sesame chicken recipe. I adapted a few, and this tastes something like what I think it should. I used Fish and Things Teriyaki Marinade (on this site).  It tastes a lot like Mr. Yoshida's teriyaki. If you prefer, you can substitute pancake syrup for honey, and fresh ginger for five-spice powder.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "½ cup toasted sesame seeds, divided",
            "1 teaspoon black pepper",
            "1 teaspoon Chinese five-spice powder",
            "1 teaspoon crushed red pepper flakes",
            "5 (6 ounce) skinless, boneless chicken breast halves - cut into chunks",
            "5 tablespoons vegetable oil",
            "½ yellow onion, cut into wedges",
            "½ cup green bell pepper, seeded and thinly sliced",
            "2 tablespoons teriyaki sauce",
            "2 tablespoons honey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large resealable plastic bag, combine flour, 1/4 cup sesame seeds, black pepper, five-spice powder, and red pepper flakes. Place a few pieces of chicken at a time into the bag, and shake to coat. Remove to a platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet or wok over medium-high heat. Place chicken into skillet, and brown on both sides, about 5 minutes. Remove chicken, and set aside. Stir onion wedges and bell pepper slices into skillet; cook until slightly browned, about 2 minutes. Remove, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return chicken to skillet, and reduce heat to low. Mix in teriyaki marinade, 1/4 cup sesame seeds, and honey; stir until sauce thickens. Return onion and bell pepper to the skillet. Warm through, and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "AJ Ross"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.375706214689266,
            "ratingCount": 708,
            "itemReviewed": "Amber's Sesame Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "437.8 calories",
            "carbohydrateContent": "27.7 g",
            "cholesterolContent": "82.4 mg",
            "fatContent": "19.5 g",
            "fiberContent": "2.6 g",
            "proteinContent": "37.8 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "325.3 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-20T08:05:24.157Z",
                "reviewBody": "As others have suggested you ll probably end up tripling the sauce amount; the fried chicken chunks generally absorb the relatively small amount of sauce mixture that is called-for very quickly. Use sesame oil (refined for high heat) for frying. I d also recommend that you pre-mix together the teriyaki sauce and honey separately in a small dish (or measuring cup) as opposed to adding each of those separately to the chicken pieces after you put them back in the skillet. This prevents one or the other tastes from becoming overly dominant. And I would definitely not omit the five-spice powder as this is the unique exotic ingredient that has a chance to give this dish a distinctively Asian taste. The end result of this recipe is relatively unsweet; if you do like more sweetness (most restaurant-style sesame chicken is actually sweeter than this recipe) I d add brown sugar to taste when you're at the final mix and maybe a little soy sauce and ginger powder. Not the best I've had but all in all a very well-done easy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "taverner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T01:04:28.623Z",
                "reviewBody": "This can be very tasty if you make a few changes. I halved the amount of flour and I substituted the five-spice powder in favor of a packet of Honey Sesame seasoning mix that I found in the oriental food section of the supermarket. I used thin sliced chicken breast which browns quicker it only took about 2-3 minutes per side. Also I used broccoli and carrots rather than the onion and peppers. Like many others had suggested I made more sauce than called for. I tripled up on the teriyaki sauce but be cautious to not use too much honey. Don't bother to add the toasted sesame seeds until the end. I recommend keeping the red pepper flakes as they add just a slight amount of heat. Very simple and quick to make as well as delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cook_NH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2190939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-16T23:03:58.343Z",
                "reviewBody": "I used one full red pepper in place of the green pepper and based on the previous reviews I quadrupled the \"sauce\". To make quick work of the sauce and to cut down on overmixing (and by overmixing I mean losing some of the \"crust\" on the chicken) I mixed the teryaki sauce and honey together before pouring it over the chicken. I do not have a wok I made this in my cast iron skillet--I was pretty proud of that. Wok or not this still turned out darn tasty. My husband and kids inhaled this. I made a Japanese-Style cabbage salad to go with it my husband made a comment that those two combined would make a great lettuce wrap.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-27T21:02:03.247Z",
                "reviewBody": "This was excellent! I took others' advise and tripled the sauce it cookes down quickly so I'm glad I did this. I paired this with the Chicken Lo Mein submitted by Michelle on this site and substituted some of the chicken in that with shrimp. These dishes went great together. It was Asian night at our house. Amber's Sesame Chicken was easy to prepare and the flavor was excellent and just as good as leftovers. I served it with the lo mean and some white rice. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Martell Bishop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1371349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-14T15:44:55.287Z",
                "reviewBody": "5/13/10 Ok I've made this before but couldn't find the recipe so I printed it off the site again. I made it and was really disappointed. It is going from a 5 star to a 2 star - something has changed in the listing of the recipe! The first time it must have said to make the Fish and Things Teriyaki Marinade this recipe now states add 2 T teriyaki sauce. Well I thought teriyaki sauce was just out of the bottle and it was really bad. Not sweet no flavor and definitely not enough. Like a had to add 3/4 of a bottle and a ton of honey and it still wasn't sweet. SO- remembering the first time when it was a \"5\" I used the Fish and Things and it was to die for. Somebody please fix this recipe back the way it was. It had been great before!!!! MY MY MY! Very addicting! This is awesome!! We also made enough sauce to make it drowned in it! The Teriyaki recipe makes plenty so why not use it. We served it over basmati rice and the whole family loves this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1607923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T16:03:56.783Z",
                "reviewBody": "Per the advice of others I tripled the sauce. It seemed necessary. I also didn't use as many sesame seeds as it called for (I didn't want them to overpower the flavor). I would also recommend MORE ONIONS AND PEPPERS! At least double if not triple. I will probably cook the chicken longer next time just to make sure it's done thoroughly just a personal preference. My husband LOVED this recipe and wants me to make it again ASAP. (He's a picky chinese food eater and said this tasted authentic--probably the chinese 5 spice). He did wish there were more onions and peppers though. Served over a bed of white rice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Burchfield",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1403044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-15T03:11:28.39Z",
                "reviewBody": "YUM!!! Very good and thankfully not as sticky or sweet as my favorite Chinese restaurant. I skipped the five-spice (I HATE black licorice and that's what the flavor primarily is -- comes from the anise) in favor of some powdered ginger. The flour didn't stick well to the chicken so the pieces didn't have a \"crunch\" but that's okay with me. Also I sauteed thinly sliced onion and a clove of elephant garlic in a combination of sesame oil and wok oil (basically garlic oil) first then removed them before adding the chicken. Then I added 1/2 C each of honey and teriyaki which made plenty of sauce (enough for the jasmine rice to soak into) before returning the garlic and onion to the skillet. My picky picky 4-year-old cleaned his plate! Can't wait for lunch leftovers!! Thanks SO much! Had leftovers today and wasn't pleased -- way too sweet. Will try replacing some of the teryiaki with soy sauce next time to cut down on the sweetness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Stewart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T04:43:04.45Z",
                "reviewBody": "This came out so good! I had to improvise a little because I didn't have any teriyaki sauce. After finding out that teriyaki sauce is made of sweet soy sauce and wine I made my own version of it by mixing half soy sauce and half white wine which is why mine came out much darker than the other photos of this recipe on this site. I didn't bother to add any extra sweetness. I doubled the sauce as suggested by some of the other reviewers. This dish got rave reviews from everyone. It tasted just like what we order at the Chinese takeout. I will surely be making this again. Thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gilda George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebony3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-30T10:23:48.42Z",
                "reviewBody": "Really enjoyed this recipe.. used fresh grated ginger instead of 5-spice powder. Added a bit of sesame oil to the pan before frying chicken. Used Fish & Things Terryaki Marinade from this site as recommended and scaled it down to 12 servings.. will use even less next time and cut down on the soy as it was overpowering! This recipe tasted even better warmed up the next day",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Vanthuyne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1884095/"
                }
            }
        ]
    }
]