[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1116/fruits-and-vegetables/",
                    "name": "Fruits and Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1059/fruits-and-vegetables/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1084/fruits-and-vegetables/vegetables/eggplant/",
                    "name": "Eggplant",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70447/cheesy-baked-eggplant/",
        "name": "Cheesy Baked Eggplant",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F999135.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2018-03-21T16:36:02.000Z",
        "description": "This is a very cheesy and easy to make baked eggplant dish with an Italian flair. An excellent alternative to a pasta dish.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 eggplant, sliced into 1/2 inch rounds",
            "2 tablespoons olive oil, or as needed",
            "1 tablespoon garlic powder, or to taste",
            "2 tablespoons olive oil",
            "1 small onion, chopped",
            "3 cloves garlic, chopped",
            "2 small tomatoes, chopped",
            "1 (10 ounce) package fresh spinach leaves",
            "½ cup ricotta cheese",
            "¾ cup shredded mozzarella cheese, divided",
            "¾ cup grated Parmesan cheese, divided",
            "¾ cup tomato pasta sauce",
            "2 teaspoons Italian seasoning"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Brush eggplant slices with olive oil on both sides, and place them on a baking sheet. Sprinkle garlic powder over the top. Bake for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons of olive oil in a large skillet over medium heat. Add the onion, garlic, tomatoes and spinach. Cook and stir for a few minutes until fragrant, and the tomatoes have released their juices. In a medium bowl, mix together 1/2 cup of ricotta cheese, 1/2 cup of mozzarella cheese, and 1/2 cup of Parmesan cheese. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the eggplant slices in a greased 9x13 inch baking dish. Top with the spinach mixture. Spoon the cheese mixture over the spinach, and spread into a thin layer. Pour the spaghetti sauce over the cheese layer. Sprinkle the remaining mozzarella and Parmesan cheese over the top. Sprinkle with Italian seasoning.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, or until heated through and the eggplant is easily pierced with a fork.\n"
            }
        ],
        "recipeCategory": [
            "Fruits and Vegetables",
            "Vegetables",
            "Eggplant"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julie3333"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.385714285714286,
            "ratingCount": 210,
            "itemReviewed": "Cheesy Baked Eggplant",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "244.1 calories",
            "carbohydrateContent": "15.4 g",
            "cholesterolContent": "20.7 mg",
            "fatContent": "16.1 g",
            "fiberContent": "5.4 g",
            "proteinContent": "11.7 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "447.9 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-09T21:51:56.59Z",
                "reviewBody": "Very good with a few revisions. I would recommend sweating the eggplant first for 20 minutes and then seasoning with salt and pepper as well as garlic powder. I also put half the pasta sauce on top of the eggplant and then added the 3-cheese mixture before I layered on the spinach. Then I added the rest of the sauce and the remaining cheese on top. I think it works better this way because the flavors are spread more evenly. Without seasoning the eggplant generously you end up with bland and boring at the bottom and all the flavor and pizzazz on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NikkiC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/694778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T14:50:20.787Z",
                "reviewBody": "The measurements regarding the eggplant, onion and tomato are a bit open to interpretation. To make this dish, I used an eggplant that was about 8 inches tall and about 12 inches around.   I left the skin on my eggplant slices for extra fiber, and also let them sweat for about 20 min before using. For anyone who's unfamiliar with sweating, you salt the slices and let them sit out for about 20-30 mins. The salt will draw out some of the bitterness inherent in eggplant.  Not sure if the pre-baking of the slices in this recipe is also sweating, but I did both to be safe. You can rinse the slices after to remove almost all the salt.   I had more than enough eggplant to fill the bottom of a 9x13 dish; I even had to overlap a few slices.  I didn't have the spinach - somehow I overlooked that when writing the ingredients for my shopping list. I will definitely not forget for next time though. I love spinach in ricotta!  I used a whole can of diced tomatoes with garlic and onions, drained. I just prefer the flavor. Did you know that canned tomatoes have more lycopene in them than fresh? Cooking brings out the lycopene in tomatoes. Anyway...  I used a small red onion, chopped, which equaled probably about 1/4 cup worth, give or take.   I found that the amount of cheese was just right, though  I couldn't seem to spread it very well, so it was sort of crumbled on top and patted down.    I did use a tad extra tomato sauce and cheese for the topping than listed in the ingredients.    My f",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1489968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T20:54:15.65Z",
                "reviewBody": "This was delicious; and based on several other reviews it seems to turn out great even with multiple ingredient substitutions. I made several adjustments due to lack of ingredients: 1) sprinkled eggplant with onion powder instead of garlic powder 2) used feta cheese instead of ricotta 4) sprinkled more mozzarella on the top as I ran out of parmasean 5) used a whole 15 oz can of Zesty Italian spaghetti sauce instead of a plain pasta sauce & omitted the Italian seasonings. Actually the amount of sauce required didn't seem like enough and I was glad I decided to use the whole can. Of course I decided to serve this dish over rotini pasta so I needed the extra sauce or it would have been too dry. Next time the only change I will make is to add another eggplant and possibly more spinach. These flavors were such a great combination but I barely had enough eggplant to cover the bottom of the dish. My whole family is already asking for this one again so it's definitely going into the recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MariyaC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1352964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T01:26:29.26Z",
                "reviewBody": "There is nothing I would really change about this recipe. A lot of other reviewers left the spinach out, but I think it really added to the dish. I did need to use more than one eggplant (I used one and a half) to fill up the bottom of the 9 by 13 in. pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2158953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-28T01:24:10.78Z",
                "reviewBody": "This was awesome! My husband wanted more protein so I added several boneless chicken breast tender pieces (tenders cook much faster than full breasts) on top of the cheese layer. The sauce and cheese topping went on top of them. Everything was perfectly cooked after 30 min. We both got what we wanted and the flavors were soo good! Will make again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZELDA3333",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/zelda3333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-09T04:19:27.527Z",
                "reviewBody": "I find that if you layer everything like lasagna it comes out better. also letting the eggplant soak in water with some salt for a few minutes helps take out the bitterness but it was absolutely yummy I'll make this one of my favorites. thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mama Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2970522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-15T22:59:53.373Z",
                "reviewBody": "We have had a lot of eggplant parmesan this summer (due to lots of EP in the garden!) and this one was BY FAR THE BEST recipe and the easiest because you don't have to bread the eggplant (you don't miss it at all). This will the standard in our household.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-09T00:49:39.2Z",
                "reviewBody": "After reading previous reviews I sliced the eggplant and let it sit for a few minutes before proceeding. Then I brushed it with a combination of olive oil and italian dressing before baking. I layered the ingredients using each twice. The dish is tasty and the presentation was nice. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACEYTW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-07T13:01:16.403Z",
                "reviewBody": "This came out really good! I didn't use the spinach and I piled the ingredients separately on each eggplant slice to make little eggplant pizzas. I also added more mozzarella on at the end probably more like 1/2 cup instead of 1/4 cup. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONET789",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1073712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-31T04:54:57.737Z",
                "reviewBody": "The flavor of the recipe was fine although I always spice up my dishes with some extra spices (which I added to the eggplant and the onion-tomato-spinach mixture). But for some reason my eggplant was not cooked after one hour even though I salted the eggplant and cooked it for 10 minutes as specified by the recipe. To be on the safe side I would almost completely cook the eggplant before assembling the whole thing and baking it. I should have known this though because I have made eggplant so many times! Be sure to use plenty of olive oil on the eggplant. Its esssentially a sponge and won't cook well unless you give it enough oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "baraan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5879105/"
                }
            }
        ]
    }
]