[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70491/sombrero-chicken/",
        "name": "Sombrero Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F854147.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:36:04.000Z",
        "description": "Seasoned strips of chicken breast are cooked with bell peppers, onions, cilantro, and bacon and topped with tomatoes and cheese. Serve on warm flour or corn tortillas with guacamole and Spanish rice.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "8 bacon strips",
            "1 green bell pepper, cut into 1/2 inch wide strips",
            "1 onion, cut into strips",
            "1 bunch fresh cilantro, chopped",
            "3 pounds skinless, boneless chicken breast halves - cut into 1 inch strips",
            "2 tablespoons garlic powder",
            "2 tablespoons dry fajita seasoning",
            "1 large ripe tomato, chopped",
            "10 ounces shredded Monterey Jack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fry bacon strips in a large skillet over medium heat until crisp. Keeping the bacon and drippings in the pan, add the bell pepper, onion, and half the cilantro. Stir and cook for 1 minute. Season the chicken with garlic powder and fajita seasoning and stir into the pan. Cook mixture until chicken is no longer pink in the middle, about 20 minutes. Remove skillet from heat and sprinkle the remaining cilantro, tomato, and Monterey Jack cheese over the top of the chicken mixture. Cover and let sit until cheese melts, about 3 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "RHONDA35"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5476190476190474,
            "ratingCount": 42,
            "itemReviewed": "Sombrero Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "561.3 calories",
            "carbohydrateContent": "8.8 g",
            "cholesterolContent": "194.3 mg",
            "fatContent": "26.9 g",
            "fiberContent": "1.6 g",
            "proteinContent": "68.4 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "809.9 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-16T01:32:49.187Z",
                "reviewBody": "Other than the cilantro which Hubs had no problems with me omitting, I stuck to the ingredients list exactly using a mix of red and green bell peppers.  It was the technique I modified.   I cut the bacon into chunky dice.  I couldn't see trying to cook the vegetables and then the chicken efficiently together with already crisp-cooked strips of bacon.  So I cooked the bacon separately.  Removed some of the grease.  Added in the vegetables and cooked then till crisp/tender.  I had earlier mixed up the chicken strips with the fajita seasoning (to taste), a little water, fresh lime juice and a little vegetable oil.  Once the vegetables were cooked I removed them from the pan and set them aside; then cooked the chicken and mixed everything together at the end. This was simply delicious and also made for a colorful and attractive presentation.  We really enjoyed this so much.  It was nicely spiced but not hot, so it was a real treat for Hubs to actually have something with a little spice that his sensitive innards could tolerate.  I had full intentions of serving this with the tomato but I forgot - but this has so much flavor going on it wasn't even missed.  Trying to watch carbs where I can, I didn't serve this in tortillas, choosing AR member SB's personal recipe \"Cheesy Poblano Rice\" instead.  The Monterey Jack, a squeeze of fresh lime and a plop of sour cream was a nice finish. This will certainly make a comeback.  It's a delicious and nutritious meal that's quick to prepare.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-28T16:35:44.06Z",
                "reviewBody": "My husband is without a doubt the most picky eater I have ever met. He has never even attempted to eat leftovers. He not only LOVED this dish, but ASKED for it the next night! since then, I have made several things from this site, and he has enjoyed them all...although this is his favorite. I wish I could give it a higher rating!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "reba",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2677464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-05T02:36:11.497Z",
                "reviewBody": "I changed this up so much that I'm actually going to write a custom recipe for it but I think this recipes deserves five stars for the flavor alone. I didn't add the bacon but we don't like it and I'm sure using it would have lowered the rating for us. Thanks for a recipe I found perfect for customization.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TwoSweetPickles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lynna/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-31T21:46:42.8Z",
                "reviewBody": "Very good recipes. I will make again but I will drain off most of the bacon grease.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSIE2.13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/921637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-20T11:46:26.92Z",
                "reviewBody": "When I made this for dinner last night I expected this to be good but nothing over the top. Boy was I wrong! This little recipe was absolutely delicious. I did a few things different to prepare this recipe but did not change any ingredients and it could not have altered the outcome at all. I chose to grill my chicken because I just couldn't believe the chicken would cook along with the bacon and veggies. I diced my bacon cooked it and then took it out of the pan adding it when dinner was ready to be served. Those were the only differences (besides cutting back on the cilantro quite a bit which is a personal preference). I served it in tortillas with a smear of sour cream and topped with the monterey jack and tomatoes. What a simple and absolutely delicious meal. These turned out to be the perfect fajitas. Thank you Rhonda for sharing your recipe...it will be a definite keeper in our house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kori Lavertue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/korilynne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-22T17:06:40.233Z",
                "reviewBody": "Comforting tasty and fairly quick to pull together. I used turkey bacon and canned (drained) fire-roasted tomatoes in lieu of fresh tomatoes. The family loved it; I'll definitely make this dish again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3742047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-03T03:25:21.627Z",
                "reviewBody": "This was great! I will make this again and again. REVISION: I had to wing it tonight I did not have fajita seasoning so I used onion powder cumin paprika a bit of cayenne oregano and sugar...they smell great. I will have to wait and see how they come out. At the end I added some lime zest and the juice of one lime. Oh yeah I also cooked it in my electric skillet. I turned it all the way up so that I could get a good browning on the chicken. I served this with Terry's Texas Pinto Beans also from this site and some Spanish rice. YUM-O",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea Parker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ajparker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-22T02:09:49.42Z",
                "reviewBody": "Cilantro alert! But I love cilantro so this was no problem! This is well seasoned and the cooking times are accurate however I started with the bacon removed it from the skillet along with most of the drippings. Next I cooked the chicken after letting it sit in the seasonings while I prepared the veggies. Then I added back a little of the drippings and sauteed the onion and bell pepper allowing them to get tender crisp. Next I added the tomatoes stirred together with the cilantro. After about a minute I added back the chicken and the bacon (which I crumbled). I stirred everything to combine then I put 4 oz. of Monterrey Jack over all and allowed it to melt as the original directions state. I served it with whole wheat tortillas and I wish I had made guacamole for it would have been a great addition to this dish. As TexCook stated in her review chicken \"fajitas without the grilling.\" Thanks for the idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bibi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bibi/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-04T11:54:55.433Z",
                "reviewBody": "Flavor-wise this was very good. Next time I would remove the pepper/onion mixture before adding the chicken because they got waaaaay too done. Also I would only use the bacon grease & leave the bacon for another use. I love bacon & the flavor of the bacon in this but just didn't care for that extra texture. Didn't seem to \"go\" with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T18:23:58.743Z",
                "reviewBody": "This dish was too fatty. Too much grease made my tortilla very soggy. Next time I would defintely drain the fat and add some different seasonings for more flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Reynoso3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4956040/"
                }
            }
        ]
    }
]