[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72551/miguelinas-poblanos-and-cheese/",
        "name": "Miguelina's Poblanos and Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5673336.jpg",
            "width": 2660,
            "height": 2875
        },
        "datePublished": "2018-03-21T16:37:06.000Z",
        "description": "These are a delicious side dish (but a rich one), if you don't mind a mildly chiloso (hot) pepper - less than jalapenos.  The mellow cheese is the perfect accompaniment!  Double or triple the recipe, as you please. These are not volcanic, but not for people who can't eat nachos with at least some jalapenos on them. Use Mexican cheeses if they are available in your area.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 fresh poblano chile peppers",
            "2 cups oil for frying, or as needed",
            "8 ounces queso asadero",
            "½ cup all-purpose flour for coating"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the poblano peppers, and remove the stem and core. Remove any remaining seeds. Heat a heavy skillet over high heat. Place peppers in the skillet, and cook until blistered and blackened. Turn frequently to blacken all of the skin. You want to make sure that no part of the pepper remains crispy. Place the peppers into a paper bag, fold the top closed, and let the peppers steam for a few minutes to loosen the skin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat about 1/2 inch of oil in a large heavy skillet over medium-high heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse the peppers under cold running water to remove as much of the black skin as possible. Don't get prissy about it; you can eat the skins, even if they're black - most people like some of the black skin.  Next, WASH your hands well with soap and water, or you'll be sorry later when you touch your eyes or mouth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Insert a nice thick piece of cheese into each pepper, and secure the opening with a toothpick. Coat the peppers in flour. Gently place the peppers into the hot oil, and reduce the heat to medium. Fry for 3 to 5 minutes per side. Don't try to turn them over until the bottom has a firm crust on it. Try to avoid letting the cheese run out. When both sides are slightly browned and the coating is firm, remove from the pan, and drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Holly B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 26,
            "itemReviewed": "Miguelina's Poblanos and Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "368.4 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "59.5 mg",
            "fatContent": "27.4 g",
            "fiberContent": "2 g",
            "proteinContent": "15.2 g",
            "saturatedFatContent": "11.6 g",
            "servingSize": null,
            "sodiumContent": "377.7 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-02-15T14:50:14.093Z",
                "reviewBody": "Both ways of preparing are delicious.  When peppers are on sale I buy a large quantity.  I wash them, dry slightly, and oil them on the outside.  Place them in a cookie sheet and broil them on high.  Do not walk away, open door, check and turn as needed to brown all sides.  When skins are almost black remove from oven, place in plastic bag to loosen the skin, then peel the peppers. Now you can freeze them, single layer on a cookie sheet, after that place in freezer bag.  Then when you feel like having one they are ready.  They will keep for months in the freezer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONAMARU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1293508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-23T16:01:25.67Z",
                "reviewBody": "This is a great recipe!  Very authentic, I lived in Mexico for 8 years and this is right on the money!  Here's another tip for those of you who do not like battered things.  Follow the same instruction here (toasting and removing the skin( but instead of coating the chiles, cut them into strips and fry them with strips of onion.  Once they are cooked, add the cheese and some cream.  This makes a nice gooey mess that you can eat in tacos.  \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NANCHE30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1061069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-02T03:10:49.873Z",
                "reviewBody": "This tasted great but what a mess. I learned afterward that you can just broil the pepers in the oven in order to blacken them. Much less messy and probably better for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Milktoast",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1758431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-11T20:32:41.987Z",
                "reviewBody": "Just a little tip on charring peppers: Heat up the old deep fryer and deep fry peppers a few at a time drain on paper towels let cool and skin. Oh so easy! and so much faster than the other ways. The oil does NOT soak into the peppers. Learned this from a pro cook in South Texas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRKNMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-17T00:33:41.697Z",
                "reviewBody": "I blackened my peppers under the broiler instead of in a frying pan. I tried removing the stems and seeds after blackening and steaming but the pepper tore up pretty easily so I would do it beforehand next time. I dipped each peeled pepper in an egg wash rolled them in Panko bread crumbs and baked at 350 for 10 minutes rather than frying. Delicious! It didn't taste too different from restaurant chile rellenos but was much healthier without all the oil. That said this was quite time consuming but they were fun to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kfcooke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2892162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-13T19:40:55.27Z",
                "reviewBody": "I also broil the peppers using a small toaster oven. Try Pepper Jack cheese makes for a nice flavor! I also choose to bake rather than fry. Also try sauteing some onions fresh tomatoes (chile serranos if you like HOT) with a little water and chicken caldo (broth). Pour this ontop of the poblanos while they are baking in the oven or add the poblanos to the mixture in the pan cover and allow the cheese to begin to melt! Add freshly chopped cilantro right before serving! YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AcaCandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3693712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-29T15:15:36.513Z",
                "reviewBody": "I'd definitely like to keep experimenting with this recipe. I read other variations that said broil the peppers for 5-10 minutes until the skin is black then remove it under running water instead of frying it twice. I decided to broil it (didn't see the point of frying it stuffing it then frying it again?)and place it in a tightly sealed bowl for 30 minutes to steam the skin off and this way worked really well for us. I used flour and egg for the batter to make it more substantial also. I think this frying method is perfect but next time I will try harder to find the cheese recommended in this recipe. All I could find was queso fresco and it didn't melt well or taste very much like the restaurant versions of chile relleno that we are used too. Thanks for posting this recipe DH and I order these every time we go out for mexican!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrieh82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2147772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T20:20:35.54Z",
                "reviewBody": "This was awesome! i also added shredded chicken with the cheese. Next time i have a taste for stuffed peppers i'll make this instead!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cook-aholic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5327793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-29T17:13:10.233Z",
                "reviewBody": "great",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jack",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3015396/"
                }
            }
        ]
    }
]