[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
                    "name": "Dips and Spreads Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1281/appetizers-and-snacks/dips-and-spreads/hummus/",
                    "name": "Hummus Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72926/raw-hummus/",
        "name": "Raw Hummus",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F24684.jpg",
            "width": 1632,
            "height": 1232
        },
        "datePublished": "2018-03-21T16:37:22.000Z",
        "description": "Raw organic hummus. A treat from traditionally cooked hummus and causes very little gas because all the enzymes are still there. When I serve this I make a depression in the middle and fill it with olive oil. Serve with pita bread, carrot or celery sticks, or small romaine leaves.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H2M",
        "totalTime": "P3DT0H17M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "1 ½ cups dry garbanzo beans",
            "2 tablespoons tahini",
            "1 teaspoon sea salt",
            "2 lemons, juiced",
            "4 cloves garlic, crushed or to taste",
            "1 cup filtered or spring water",
            "1 pinch paprika"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the beans for 24 hours. Drain, and let sit for 2 to 3 days, until the bean's sprouts are about 1/2 inch long. Rinse the beans once or twice a day.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil. Remove from heat, and let stand for 1 minute. Place the sprouted beans in the hot water, and let sit for 1 minute. Drain. If you do not do this step, the hummus will be awful.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the sprouted beans into the container of a large food processor. Add the tahini, sea salt, lemon juice, and garlic. Process until smooth, adding water if necessary. It will take 3 to 5 minutes to blend. Let sit in the food processor for 5 minutes to allow the beans to absorb as much of the water as possible. If too thick, add more water, and blend again. Taste and adjust seasonings if needed. Spoon into a serving dish, and garnish with paprika.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Dips and Spreads Recipes",
            "Hummus Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "EMILKALIL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.118421052631579,
            "ratingCount": 76,
            "itemReviewed": "Raw Hummus",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "66.7 calories",
            "carbohydrateContent": "10.8 g",
            "cholesterolContent": null,
            "fatContent": "1.8 g",
            "fiberContent": "3.3 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "93.9 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-09T16:00:51.387Z",
                "reviewBody": "This is actually the recipe that led me to this site a couple of years ago. I didn't love this as is but I'll keep working with it now that I have more experience making hummus. For those concerned with the safety of eating this: It's absolutely safe and it's better for you than \"cooked\" hummus because it's easier to digest. The problem with the funky smell could have come from your sprouting method. Beans need to be sprouted in a large jar with a mesh or cheesecloth lid lying on its side (so the beans are spread out) in a dark but well-ventilated area. If yours were moldy it could have been because there was not enough air getting to them. As for the question of whether this is raw: It's raw because the beans are not cooked; \"regular\" hummus uses cooked beans and is therefore not raw.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kym Cox Surridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-02T20:10:20.06Z",
                "reviewBody": "My 4 yo picky non-vegetarian son who likes regular hummus LOVES this recipe. I am so grateful for this recipe. My son and I've recently developed hayfever and we are trying to fortify our bodies with more enzymes from fresh raw food. Other than the basic salad and fresh cut vegetables I had yet to venture into real raw food prep. This is a great introduction. I did make an error though I soaked the beans for almost 2 days (changing water twice) and forgot to let the beans sprout nevertheless it was just as good and I'm sure the enzymes were activated. I also held back a bit on the garlic (i used one big clove) because I wasn't sure if my son would like it too strong since the restaurant versions we usually consume taste rather bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JRMINT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-30T14:12:33.86Z",
                "reviewBody": "For the reviewer who stated \"all hummus is raw\"...you are incorrect.Hummus is made from COOKED beans (all canned beans have been cooked prior to canning) in most cases (if not all) which leads to a \"Cooked\" final product.The natural enzymes in the beans have been modified and altered by the cooking...any temp over 114 degrees F. constitutes \"cooked\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Likly-Welch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3071692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-22T19:26:55.763Z",
                "reviewBody": "I never want regular hummus again. I'm serious. This is beyond hummus.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SarahRosenkrantz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-09T22:06:26.22Z",
                "reviewBody": "I loved this whole idea. Sprouting was a blast. I let my sprouts grow to about 3/4 inch then placed in refrigerator. They grew in the fridge too. I made two batches one without placing in hot water and one with. The truly raw hummus did indeed have a very green taste once the sprouts were ground in. The other hummus (beans placed in the boiled water) was not as strong at all. Some of us ate the raw version (poor baby didn't have a choice:)) and the others much preferred the one according to recipe. Great idea will do again if just to sprout beans for snacking! P.S. Flavor-wise the raw sprouted beans taste like fresh green beans and the heated-sprouted ones tasted just like corn on the cob to us! Really! 12/4/10",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joy-of-jesus-smileymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-31T00:06:47.513Z",
                "reviewBody": "I cannot tell you how many hummus recipies I have tried. They've all been terrible. I was actually getting ready to give up and go back to buying it when I found this recipe! This hummus is fantastic. It's easy a no-brainer to make and very healthy in that it's raw. My husband and even my TWO YEAR old love this hummus!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1062307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-30T05:35:14.373Z",
                "reviewBody": "Really good hummus tastes like normal cooked hummus. As a matter of fact after letting the beans steep in hot water for 60 seconds they went from tasting like fresh peas to normal garbanzo beans. It makes me wonder just how \"raw\" they are in the final product. I'm sure they're a little better for you than canned garbanzo beans but probably not by much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallow1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/471170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T21:10:49Z",
                "reviewBody": "I've been eating the wrong thing all this time and not liking what I tasted! Now after having made this recipe for Christmas to include my Iranian son-in-law (who gave it two thumbs up!) I've changed my mind...it is really really excellent hummus. It's very easy too. I will be making this again particularly since I had absolutely no problem getting it to look like and act like hummus. Thank you so very much for sharing. You've done me a great favor and others too I'm sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HUTCHEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/398725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-07T22:50:11.65Z",
                "reviewBody": "Love this recipe. I have made recipe several times. I have never had any problems with anything smelling moldy or bad. Perhaps those reviewers had bad/old garbanzo beans to begin with. I have to admit that I usually make hummus from canned garbanzo beans as it is faster and easier but this recipe is by far my favorite when I have the time. I add different things to flavor it differently. Roasted red pepper is a favorite additive. Artichoke hearts and lots of garlic is another favorite of mine. I mix all the ingredients except for the water and add it last only as needed. If the texture still isn't right I will add a little extra virgin olive oil. I also usually add some ground cumin for more flavor. As a garlic lover I seldom only add 4 cloves of garlic - usually I add a lot more (about double that).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "elp1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6285178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-03T18:36:40.693Z",
                "reviewBody": "This recipe works. While it may be healthier the texture isn't as good as when I cook dried garbanzos and make hummus the old-fashioned way. I also use more tahini and a little olive oil in mine. Good recipe though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Gargantujuan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6948585/"
                }
            }
        ]
    }
]