[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17650/trusted-brands-recipes-and-tips/diamond-crystal-salt/",
                    "name": "Diamond Crystal&reg; Salt",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/239410/jans-simple-and-tasty-egg-rolls/",
        "name": "Jan's Simple and Tasty Egg Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4467795.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2014-09-15T19:15:44.000Z",
        "description": "Super quick and delicious egg rolls! Great as an appetizer, side dish, or after school snack. Be creative with the filling by adding other things such as crabmeat in place of the shrimp. Who needs take out when you can make egg rolls yourself?",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "12 egg rolls",
        "recipeIngredient": [
            "2 (16 ounce) bags coleslaw mix",
            "2 (4 ounce) cans small shrimp, drained",
            "2 tablespoons chopped garlic",
            "2 teaspoons ground black pepper",
            "2 teaspoons Diamond Crystal® Fine Sea Salt",
            "1 tablespoon soy sauce",
            "1 tablespoon onion powder",
            "1 (16 ounce) package large egg roll wrappers (such as Nasoya®)",
            "1 quart vegetable oil for frying",
            "1 teaspoon Soy sauce",
            "1 teaspoon Chinese hot prepared mustard"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place coleslaw mix in a large, microwave-safe bowl. Microwave on High until mix is wilted, 5 minutes. Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the shrimp, garlic, pepper, Diamond Crystal&reg; Fine Sea Salt, soy sauce, and onion powder into the coleslaw. Mix until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place one wrapper on a flat surface with a corner pointing toward you. Lightly brush the four corners with a little water. Place second wrapper, about one inch off center to the right, on top of the first wrapper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place about 1/3 cup vegetable mixture in the center of the stacked wrappers. Bring up bottom corners to cover just over the mix but not all the way to the top corners. Dab wrapper with a little water. Pack filling inside well and fold in the 2 sides till just about touching.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wet the remaining top corners with a little water and roll the filled wrapper portion tightly toward it and press to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large pot to about 375 degrees F (190 degrees C) or medium high heat.  Fry egg rolls, turning occasionally, until golden brown 5 to 7 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain on paper towels and cool slightly before eating. Serve with soy sauce and hot mustard for dipping, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Diamond Crystal&reg; Salt"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Diamond Crystal Salt"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.645161290322581,
            "ratingCount": 31,
            "itemReviewed": "Jan's Simple and Tasty Egg Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "261 calories",
            "carbohydrateContent": "32.5 g",
            "cholesterolContent": "41.7 mg",
            "fatContent": "10.3 g",
            "fiberContent": "2 g",
            "proteinContent": "9.3 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "662.1 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-09T05:48:48.31Z",
                "reviewBody": "I made these simple and tasty egg rolls for the first time in August, 2013 and I cannot count the times I have made them since that date. Microwaving the coleslaw mix prior to combining with the other ingredients creates a more compact filling and a full egg roll. Sometimes, I use about 1/2 cup of cooked sausage or ham instead of the shrimp. I always make a mixture of about 1 Tablespoon of flour mixed with 1 Tablespoon of water to seal the top corner of the Nasoya wrappers. I place four or five of the egg rolls in my deep fryer at 375 degrees for about 3 minutes. They fry to a nice golden color - so crispy and delicious! Thank you, WFDM for sharing your 5 star recipe and I am glad it has received Allrecipes kitchen approval.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JimmyandNancy Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shearone/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-20T21:39:29.373Z",
                "reviewBody": "I've made these egg rolls a few times now, didn't realize the recipe had been published. I've made them with just veggies, chicken and shrimp. I don't have a deep fryer, so fried them in a pan and usually bake them. I bake them on my stone pan at 375° for 25-30 minutes, until the start to turn golden brown. I do brush them with vegetable oil first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-19T16:15:50.717Z",
                "reviewBody": "ABSOLUTELY LOVED IT!  I made this for the recipe group and was so happy it got chosen.  This was so easy to make and took little time.  I fried all the egg rolls and intend to freeze what is left over from lunch.  This way, I can pop them in the microwave for an evening snack without messing with oil.  Thank you WFDM for sharing your recipe!   You have a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-18T01:06:08.44Z",
                "reviewBody": "Recipe Group: Simple and Tasty is right! I had some cabbage to use up so I chopped it fine and subbed for the coleslaw mix. I added an onion and a green pepper to the cabbage before nuking. Once out of the microwave I added a small handful of finely chopped mushrooms and some minced ginger and left out the shrimp. I used only half the black pepper called for and still found it to be too much for my taste (and DS could not finish his). I convect baked at 425 for 10 minutes flipped and went another 10 minutes and they were perfectly done (not as good as deep frying to be sure but I wasn't in the mood to haul out the fryer). Thanks WFDM for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ONIOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-08T18:01:27.647Z",
                "reviewBody": "These egg rolls are so simple to make and SOOOOO DELICIOUS! I have to admit that I have made these a few times (or more) before and they are a HUGE hit with the family. I've even made and froze these w/ great results. These are a family favorite YUM! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-25T12:38:49.08Z",
                "reviewBody": "These are great egg rolls. I haven't eaten egg rolls in over 6 years due to allergies. I made these with rice wrappers instead of wheat flour wrappers to keep it gluten free. I also had to make them without shrimp so I used some left over chicken breast that I had shredded. I actually made them a couple of times because the first batch I left out the salt. I figured that the soy had enough sodium (actually I used tamari-gluten free soy sauce). I was wrong don't forget the salt!! The cabbage and carrot became sweet during the cooking process and the lack of salt made them too sweet. The second time I made them I added salt and this seemed to balance it out properly. Definitely these will become our go to egg rolls being easy and quick to make and scrumptious. They work in a 220 C oven instead of frying so there's a plus. Thanks What's For Dinner Mom for this recipe. It has helped me get my Chinese food back!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Buckwheat Queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/melaniegiovenzana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-23T16:18:19.953Z",
                "reviewBody": "Very good. Needed to use some napa cabbage so shredded that (7 ounces). Added shredded carrots for extra nutrition and finely diced cooked chicken as I ate these as a main dish and I need to watch my protein levels. Made eight egg rolls. Baked according to directions on the wrappers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Thisni Caza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1060346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-07T11:08:45.963Z",
                "reviewBody": "These were great! I made them exactly as written, except using TVP instead of shrimp because one of us is a vegetarian. Better than some we've gotten from restaurants, and a lot less expensive. Next time I will make them with only a single wrapper each, though, because they were so huge with two.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Padi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9385893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-23T00:54:11.6Z",
                "reviewBody": "Recipe Group Selection: 14 February 2015 Another wonderful recipe from Jan! I used chicken rather than shrimp and made them mini egg rolls rather than full size using one wrapper per egg roll with 1/4 cup filling. The mixture made 24 minis. We fried six for dinner and I flash froze 18 of them uncooked. This was so easy to make and microwaving the slaw mixture is pretty cleaver. We dipped them in a Sweet & Spicy Thai Sauce to give them the heat we like. Paired them with 'Quick Pork Fried Rice' from AR and we enjoyed a delicious dinner! Thanks Jan for sharing another great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-28T10:14:20.883Z",
                "reviewBody": "Entirely too much black pepper for this recipe. That’s all we could taste while eating it. I suggest reducing to 1/2 or 1 tsp, instead of two.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle_Laster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24451407/"
                }
            }
        ]
    }
]