[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/73715/paneer/",
        "name": "Paneer",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5811968.jpg",
            "width": 1772,
            "height": 1772
        },
        "datePublished": "2018-03-21T16:37:52.000Z",
        "description": "Easy paneer recipe.  Add to your favorite curry or dish.  Great for vegetarians.  Home made paneer is softer and lighter than the tofu consistency paneer you find in many Indian restaurants.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "1 gallon milk",
            "1 quart buttermilk",
            "1 cup canola oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the gallon of milk into a large pot. Bring to a boil over medium heat. Watch carefully, as it will boil over almost as soon as it starts to boil. As the milk begins to boil, pour the buttermilk into the pot in a steady stream while stirring constantly. The milk will separate into curd and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a cheesecloth into a colander, and pour the milk mixture through it. Reserve some of the liquid for later. Let the milk mixture sit in the colander for a couple of hours, or until it stops dripping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the curds are strained and settled, transfer them to a food processor. Process until smooth. It should be able to form a ball if it is the right consistency. If it is too dry, add a little of the reserved liquid and process again. The consistency should be like a firm ricotta cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the cheese out onto a clean surface, and knead until smooth. Form into a ball, and wrap in plastic. Refrigerate until needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To cook the paneer, heat the oil in a large heavy skillet over medium-high heat. Cut the paneer into bite size pieces. Fry for about 1 minute, or until a very pale golden brown. Drain on paper towels. Add to your favorite curry or dish.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "AMIBOULD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.468354430379747,
            "ratingCount": 79,
            "itemReviewed": "Paneer",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "421 calories",
            "carbohydrateContent": "38.1 g",
            "cholesterolContent": "58.3 mg",
            "fatContent": "17.8 g",
            "fiberContent": null,
            "proteinContent": "26.7 g",
            "saturatedFatContent": "9.5 g",
            "servingSize": null,
            "sodiumContent": "436.6 mg",
            "sugarContent": "38.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-08T16:49:59.827Z",
                "reviewBody": "Hello, its me.  I submitted the recipe and I would like to clear a few things up.  When I submitted the recipe, Allrecipes changed a few of the steps which confused the process.  First, this recipe makes two full dinners, or 8 servings of paneer for hefty eaters.  The paneer must be processed in a food processor for the right consistency.  You do not need to turn out the cheese unless you do not have a food processor (mistake made by website).  The paneer should be chilled overnight and I cannot stress this step enogh.  The last and most major mistake, the paneer should be deep fired, not fried in a shallow pan with a cup of oil.  Because of the delicate nature of paneer, flipping it over in a pan will make it crumble.  The paneer should only be fried until very pale golden brown.  It will appear like it is not completely cooked.  It only needs about 30 seconds to firm up.  It adds almost no fat to the recipe if the oil is hot enough and it is fried quickly.  The fried pieces can be frozen for up to 30 days in a ziploc bag after chilling.  I hope this clears up a little of the confusion about the recipe.  The website changes a great deal once submitted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMIBOULD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/905915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-12T18:50:17.977Z",
                "reviewBody": "I have been making paneer for years, and I have always used lemon juice to curdle the milk.  I will never do that again!!!!  Using the buttermilk adds such a softness and light texture.  I can't hardly believe that I made this myself.  It is the most authentic I have tasted.  Also, I emailed Ami (the owner) and she mentioned a few mistakes in how the website converted the recipe.  First, you do not need to knead the paneer on a cutting board unless you do not have a food processor.  Second, the paneer tastes better if you let it sit overnight, and frt the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RONA7145",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1209521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T16:51:15.343Z",
                "reviewBody": "AWESOME!  This recipe is so simple and ultimately delicious!  You will not be disappointed.\n\nI've previously made paneer using yogurt - but it didn't turn out nearly as good, or produce as much as this recipe!  \n\n\nI've since made this recipe a couple times... my suggestions?  Don't bother with food processing OR the kneeding.  However, if you do decide to food process, you do NOT need to kneed the cheese as well.  However, I found that I prefer the texture and firmness of the paneer without either step...  the cheese was less crumbly too!\n\nI use several layers of cheesecloth.  Then I just squeeze as much of the liquid as I possibly can by hand through the cheesecloth.  (Note: use a towel or a large wooden spoon to avoid burning your fingers on the hot liquid).  Then I hang the cheesecloth from the kitchen sink and allow it to drain the remaining liquid and cool.  \n\nAfter about an hour it's ready!  I take the ball shape and cut slices and then cut the paneer into cubes.  \n\nSince the recipe does make a lot of cheese, I refrigerated the unused portion.  After 5 days I still had some left over... it was tastier than the first day I made it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-16T05:39:11.09Z",
                "reviewBody": "The recipe for Paneer is great but as an Indian myself and a great user of paneer I really don't see much point in frying the paneer. A better and a low fat option is to simply chop it and use it without frying. It is just as yum and soft. If the paneer is good quality the longer u cook it the softer it will become.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PASSIONTOEAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1348657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-28T00:00:03.403Z",
                "reviewBody": "This is pretty much how I have always made paneer. I never really measured the ingredients though and have always just done it by eye/feel (so to speak). I don't do the food processing part of it though but maybe I will try it sometime...it just seems like too much work. What I do is strain the cheese into a cheese cloth drain as much water as I can wrap it tightly into the cloth set it on a towel put a towel on top a pan on top of that and two or three five pound weights dics on top of that. I leave it that way for a few hours. By then it is well pressed cuts easily and it more like the firmer kind you get in the shops. Although if you want a softer variety for stuffing veggies etc... then perhaps following the recipe instructions might be better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Sabo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/274253/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-11T20:59:18.357Z",
                "reviewBody": "This was a fantastic recipe!!! I put it to the test a little. Because another reviewer suggested that the frying was not needed I separated the batch into 2 portions (recipe made a lot of cheese). I have to admit that the fried paneer tasted much better than the unfried. I like the lightly browned crispy edges that help up under curry. The unfried paneer was also good but didn't hold as well and lacked the flavor of the fried. If you are looking to cut back on fat I guess it would be OK though you probably shouldn't be eating paneer anyway. My mother in-law is Indian and she had never use this method though her mother often spoke of using buttermilk instead of lemon juice to curdle milk. She tried it and switched to this method also. This will be my standard recipe from now on. Thanks Ami for submitting your old family recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSIE4PRES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1397049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-16T20:07:30.28Z",
                "reviewBody": "Made paneer before but this recipe is much better than any that i have ever tried. The buttermilk is different from the lemon juice I usually use but makes a big difference.. Let me give it to you straight you won't know if you are doing it right while making it. When I first started boiling the milk I thought I was heading down the wrong road. I kept going kept stirring and added the buttermilk. It was like magic. I strained it for a few hours used the food proicessor and then stored it in plastic wrap until the next day. I deep fried it instead (have a fry daddy) and it came out great. This is better than the paneer in the local Indian Restaurant that my family goes to so much softer. This recipe is going to save us a ton of money when we are craving good authentic Indian curry with paneer. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSIEQ23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1288880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-07T23:46:03.513Z",
                "reviewBody": "This recipe works out very well. You can also freeze the left over paneer for later use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLADD01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T23:12:26.403Z",
                "reviewBody": "I agree with other reviewers -- this is a great recipe. I think you definitely need to smooth the paneer in a food processor first. I also found it key for the paneer to be very cold before the frying process as it is much easier to handle. I left mine in the fridge overnight and did the frying in batches keeping other portions in the freezer just before handling. I didn't cut the paneer as the recipe suggests but rather grabbed a small amount rolled between my hands into a smooth ball and flattened slightly before placing in pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CCMCLAREN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1313832/"
                }
            }
        ]
    }
]