[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/408/salad/seafood-salad/",
                    "name": "Seafood Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/74960/dennies-fresh-lobster-salad/",
        "name": "Dennie's Fresh Lobster Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F689366.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:38:35.000Z",
        "description": "A delicious treat anytime! A simple lobster salad with butter and just a hint of mayonnaise so that you can still taste the sweet lobster meat. Serve on toasted rolls or croissants. You won't be disappointed!",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound cooked lobster meat, cut into bite-sized pieces",
            "¼ cup butter, melted",
            "¼ cup mayonnaise",
            "⅛ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the lobster chunks into a medium bowl, and pour the melted butter over. Toss to coat, then stir in mayonnaise and season with black pepper. Cover and chill for 20 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Seafood Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DeniseM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 78,
            "itemReviewed": "Dennie's Fresh Lobster Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "302.8 calories",
            "carbohydrateContent": "1.1 g",
            "cholesterolContent": "143.6 mg",
            "fatContent": "23.4 g",
            "fiberContent": null,
            "proteinContent": "21.6 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "495.8 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-14T19:49:20.327Z",
                "reviewBody": "This is probably the first recipe I've tried strictly because of the glowing reviews, because I have to admit that the idea of mixing up this salad with melted butter just seemed wrong to me. I had visions of the butter solidifying and giving the salad a greasy mouthfeel.  NOT.  This was just delicious--rich and creamy, and what I liked the best is that the mayonnaise doesn't overpower the salad as it can have a tendency to do in mayo-based salads.  Other than adding some chopped celery for crunch, I didn't change a thing and it did not disappoint. I served this as a wrap, using large flour tortillas and shredded Romaine lettuce.  My only complaint is when I tallied up just how much two lobster wraps set us back!  This was definitely a decadent, luxurious and delicious treat! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-17T21:29:32.927Z",
                "reviewBody": "Lobster Snobs Take Note!!!  This is UN-BE-LIEV-ABLE!!  I love my lobster straight (steamed maybe with melted butter) and rarely have \"leftovers\" -- but when I did my husband asked for a lobster roll.  I decided to humor him and made this recipe.  It is wonderful, I would not change 1 single thing about it.  The butter gives it a very rich flavor and the mayo does not make it oily or spoil the taste in any way.  I encourage you to try this recipe, and if you don't have a pound of lobster meat, adjust the recipe for what you do have -- you will thank Dennie!\nThank you Dennie!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J. Nightingale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1478639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-13T04:21:22.107Z",
                "reviewBody": "YUM! Simple and very good. Try adding a spritz of lemon juice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JBALESTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-03T00:39:45.187Z",
                "reviewBody": "Wonderful! I'm picky about celery and onions in salads so this was a refreshing change- I'll definitely stick with it! I used imitation lobster meat (I know I know)- it's all I had and chopped it up in the food processor- made stuffing a sandwich a little easier. Kudos!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAdams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1524272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T01:26:32.787Z",
                "reviewBody": "Treated us to fresh frozen warm water lobster tails for the cooked lobster meat. Rich with butter but not greasy! Creamy and delicious. Probably would have preferred this as a lobster roll intstead of the romaine with lemon vinaigrette we served it on (healthier option) but this was such a treat we didn't feel deprived. Other than adding some sliced celery for a contrast in texture I followed the recipe just as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Spunky Buddy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6878166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-26T04:23:23.873Z",
                "reviewBody": "Yummy Lobster Salad! I agreed with a couple other reviewers and used white pepper a spritz of lemon juice and a bit of celery seed. So as not to take away from the fabulous lobster flavor I served a tablespoon and a half in puff pastry tartlet shells that I had prebaked for 5 minutes at 350degrees. The tartlets are served at room temp however the lobster salad is chilled overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T16:36:05.99Z",
                "reviewBody": "I live in Massachusettes and served this on Christmas Eve and everyone said it was the best Lobser Salad they ever tasted! I think that says it all since all my guests were from New Enland. I followed the recipe except I added A small amount of fresh lemon juice. I trippled the recipe so it cost almost 100 to make but was worth every penny. I served it on mini croissants and they were a huge hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "B. Foster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2114631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-23T03:41:00.32Z",
                "reviewBody": "Lobster and butter are a classic match-up think salt and pepper and peanut butter and jelly. Visit us in New England and you will find that your lobster roll will consist of lobster with a little mayo and perhaps a little celery served on an exquisitely buttered grilled bun. Knowing that I have no idea why I was so reluctant to try this take on lobster salad. I was looking for an elegant but easy appetizer for an Academy Awards party and this salad tucked into wonton cups fit the bill. I made the salad as directed except that I couldn t resist adding some finely chopped celery. For the wonton cups I tucked wonton wrappers into mini muffin cups brushed them with olive oil and sprinkled them with a little Himalayan sea salt. I baked them at 350 degrees until browned and crisp eight to ten minutes. I made the cups and the salad in advance and filled them right before the party garnishing with some finely chopped seeded plum tomato. I have made a lot of lobster salad but I will never make it any other way from here on out. Worth the splurge!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-22T03:57:18.623Z",
                "reviewBody": "Yessssss!! The perfect lobster salad like the ones at my favorite childhood haunts in Maine. Only difference I'd make is to use white pepper instead of black or omit entirely. And for the perfect lobster roll serve in a toasted hotdog roll with a lettuce leaf!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Verna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/134098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-05T17:10:27.497Z",
                "reviewBody": "I'm a lobsteraholic whenever the tails go on sale I stock up. I had four tails and instead of serving them alongside steaks I decided to try them this way. Very blah they just tasted like cold lobster with butter and mayo great if you really like mayo I guess. I really had to spice these up I added a little chopped celery some green onion a dash of lemon juice and worcestershire salt paprika thyme cayenne and fresh tarragon. A tiny spritze of lousiana hot sauce mix and let sit for a few more minutes I served them with slices of avocado on a toasty bun delectable but not the same recipe at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Samitestar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2368136/"
                }
            }
        ]
    }
]