[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17567/ingredients/",
                    "name": "Ingredients",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17597/ingredients/dairy/",
                    "name": "Dairy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16106/ingredients/dairy/cheese/",
                    "name": "Cheese Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76755/mascarpone/",
        "name": "Mascarpone",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1898962.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2018-03-21T16:39:32.000Z",
        "description": "Mascarpone cheese is great, but can be hard to find. Here's a simple recipe that you can use at home to make mascarpone. It isn't 100 percent authentic (authentic recipes use a bacterial culture), but it doesn't require any hard to find ingredients, either!",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT4H15M",
        "recipeYield": "1 cup",
        "recipeIngredient": [
            "1 pint heavy cream",
            "1 ½ teaspoons cream of tartar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour cream into a metal bowl, and place over a pan of simmering water. Heat until warm. Stir in the cream of tartar, and continue to heat and stir until the temperature reaches 180 degrees F. Remove from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a colander or strainer with cheesecloth, and place over a bowl. Paper towels also seem to work well. Pour the mixture into the strainer, and let it drain for several hours, or overnight in the refrigerator. Spoon the resulting cheese into a clean container and use within one week. Store in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Ingredients",
            "Dairy Recipes",
            "Cheese Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mike Swieton"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 9,
            "itemReviewed": "Mascarpone",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "206.7 calories",
            "carbohydrateContent": "2 g",
            "cholesterolContent": "81.5 mg",
            "fatContent": "22 g",
            "fiberContent": null,
            "proteinContent": "1.2 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "22.9 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-04T21:09:11.373Z",
                "reviewBody": "i think this was a great and easy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "t_kaiser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6837472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-02T14:44:47.163Z",
                "reviewBody": "I used a pint of organic whipping cream and one tablespoon of lemon juice. I simmered the milk carefully in a pan, stirring often so it wouldn't stick until nearly boiling when bubbles formed on the edges and there was a lot of steam rising from it. That took about 10 minutes. Then I lowered the heat to low and added the lemon juice and continued stirring for another 10 minutes. Next, I cooled it down in the pantry for 15 minutes. I used four layers of cheesecloth over a colander and followed the original poster's instructions about draining it overnight in the fridge. This was the first time I made marscapone cheese and was amazed at how simple it is since it is expensive to buy from a store and not even organic. I will be using it in my special tiramisu recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara Molin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15310532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-09T12:21:13.873Z",
                "reviewBody": "Good recipe, and it is as authentic as any other.  I followed the recipe with the exception of using 1/4 tsp of  Cream of Tartar per quart of cream. And, I poured the hot, thickened cheese into a colander lined with a wet, sterile, linen handkerchief (boiled in water) instead of cheesecloth to allow the whey drain out in the refrigerator overnight. I have made mascarpone cheese this way many times. It always turns out good, and there is no need to substitute with lesser ingredients. It is better mascarpone than what is available in my area, and is much less expensive to make it fresh in my kitchen. Now, just to confirm what others have written, David B. Fankhauser, Ph.D. Professor of Biology and Chemistry - University of Cincinnati Clermont College and long-time mascarpone cheese maker says, \"Tartaric acid (Cream of Tartar is refined tartaric acid) is found in the sediment of fermented wine along with settled yeast. It was also possibly harvested off the sides of wine kegs, formed as an encrustation. The word tartar may come from the Arabic word durd meaning dregs. \"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snickerdoodle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3580892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-03T19:34:36.41Z",
                "reviewBody": "I have not tried this particular recipe, but having read the reviews I suspect the cream of tartar may be the cause of some cooks' grief.  Try substituting tartaric acid, available in small packets at low cost from wine making shops.  (It is added to blah wine to \"brighten\" the taste of wine that is not acidic enough, and is in food-grade form.) Cream of tartar has other ingredients, so the tartaric acid amount in it may vary by manufacturer.  Start with 1/8 tsp of tartaric acid mixed into non-chlorinated (bottled) water, and if the cream mixture is not thickening enough add more as needed. Please post your results if you try this to help other cooks out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JAVAGAL1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3157837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-28T03:33:03.36Z",
                "reviewBody": "I tried this recipe and also had problems. I have some experience with both cheese making and beer making. The problem is with the additives in some cream. It is almost certainly the carrageenan (Irish moss). The problems that some people are having with this recipe have nothing to do with the use Cream of Tartar, or the ratio of the ingredients. Cream of tartar and tartaric acid are one and the same. To acid set a cheese the globular proteins in the milk need to be denatured this is done by acidification of the milk with an organic acid and then heating the milk. This breaks the weak hydrogen bonds in the globular proteins and renders them unable to, for lack of a better word glob onto things, like butter fat. Irish moss is used during the wort boil in beer making, it attaches to proteins and removes them from the beer. This is good for beer but not so good for cheese. If the globular proteins are bound to carrageenan they can't be efficiently denatured and they won't easily let go of the fats to which they are already bound. The curd did eventually set after sitting covered at room temperature over night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mike Duffy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21364203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-25T23:46:31.06Z",
                "reviewBody": "Very easy to make. So much cheaper than buying at the store. 1 pint makes about a heaping cup of mascarpone cheese. I'll try the lemin juice next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josephine Roeper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/josephineroeper/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-21T01:06:26.293Z",
                "reviewBody": "I so wanted this recipe to work out... so much so I tried to make it 3 times. Every time it didn't thicken enough to strain. Going to try Tbsp lemon juice next time as most other recipes call for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura McEwen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12162425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-11-03T14:04:44.61Z",
                "reviewBody": "Works great! Other reviews are correct everything depends on the QUALITY of cream you buy! Try not to buy UHT Ultra high temp pasteurized. And organic doesn't mean squat if its UHT! Unfortunately most of the organic milks in my area ARE UHT!! I've found that non homogenized ie: cream top lightly pasteurized both milk and cream work best for ALL cheese recipes! If thats all you can find (UHT) sometimes adding calcium chloride helps but not always! If you used a UHT Cream and it turned out good remember that brand and always use it!! Its hit or miss!! Once you get into cheese making you learn ALOT about dairy products! And all MILK/CREAM are not alike!! They may look the same, taste the same but I PROMISE they are not the same! One more tip I can almost always find low heat, cream top milk and cream that are A2 milk! A2 is not lactaid or lactose free its made using well bred cows and is actually the milk our grandparents drank before they started cross breeding cows for more/faster milk production!! Worth a read! We only drink it in my house now and thats the only kind we CAN taste a difference with! Good luck!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sharpenscissors",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30991575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-12T21:55:48.883Z",
                "reviewBody": "Making this recipe exactly as written didn't work for me at all. I don't understand the use of cream of tartar because although my cream thickened it never got thick enough to strain. It was only after following reviewer Barbara's suggestions that it did. The texture was perfect but having to add lemon juice meant a lemony flavor that I didn't want. It's still good but I'm limited in what I can use it for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DEE C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1987747/"
                }
            }
        ]
    }
]