[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16222/meat-and-poultry/chicken/chicken-breasts/broiled/",
                    "name": "Broiled",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/82770/dans-favorite-chicken-sandwich/",
        "name": "Dan's Favorite Chicken Sandwich",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1345117.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2018-03-21T16:42:50.000Z",
        "description": "BBQ sauce and bacon are the secrets to the wonderful flavor of the chicken in this sandwich.  Add avocado and cheese, and how can you go wrong? Makes a hearty lunch by itself or serve with salad or french fries for a delicious dinner.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "2 skinless, boneless chicken breast halves",
            "2 tablespoons barbeque sauce",
            "4 slices bacon",
            "2 hoagie rolls, split lengthwise",
            "2 tablespoons Ranch dressing",
            "4 slices Swiss cheese",
            "1 small avocado - peeled, pitted and diced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Coat a baking dish with cooking spray. Brush both sides of each chicken breast with barbeque sauce and place in the baking dish. Top each breast with 2 slices bacon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake chicken 25 minutes in the preheated oven, until juices run clear. Drain bacon strips on paper towels, and slice breasts in half lengthwise.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oven broiler. Spread both halves of each hoagie roll with Ranch dressing. Place 2 breast halves on one half of each roll. Place 2 strips of bacon on each remaining roll half. Top each half with 1 slice Swiss cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange sandwich halves on the baking sheet, and broil 2 to 5 minutes, until the cheese is melted and bubbly. Layer chicken halves of sandwiches with avocado slices, and top with bacon halves to serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Broiled"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ANGELSHARK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.654867256637168,
            "ratingCount": 113,
            "itemReviewed": "Dan's Favorite Chicken Sandwich",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1062.7 calories",
            "carbohydrateContent": "84.8 g",
            "cholesterolContent": "143.2 mg",
            "fatContent": "53.3 g",
            "fiberContent": "9.5 g",
            "proteinContent": "59.8 g",
            "saturatedFatContent": "18 g",
            "servingSize": null,
            "sodiumContent": "1663.5 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-02T12:56:19.193Z",
                "reviewBody": "I had friends over for an impromptu game night and decided to try out this recipe. My problem was I didn't want to spend the time to assemble 10 sandwiches. So this became an \"assemble your own\" party.\nI made everything separately.  I grilled the chicken breasts and basted them with a garlic infused EVOO rather than BBQ sauce.  (I put the BBQ sauce on the table as part of the assemble your own.)  I cut up green and red peppers and a vidalia onion and grilled them while cooking the chicken. The other addition was that I offered flour tortillas as well as sub rolls. When it was time to eat I had a huge platter set out with all the ingredients and let everyone make their own.  It was a big hit.  \n\nSome observations. No one used the avocado. Almost everyone agreed that they would forgo the BBQ sauce. People were happiest with just the ranch dressing or in several cases, mayo.  The grilled onions and peppers went great with this sandwich. And lastly, most people preferred the tortillas over the rolls. It gave the sandwich a much lighter taste.  I will definitely make this again. If you do it this way, beware it is a LOT of prep work but once it was done I could enjoy my party along with everyone else instead of being stuck in the kitchen.  Thanks Dan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mominpa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/899090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-28T20:30:02.74Z",
                "reviewBody": "I must agree with “by Reviewer” who asked why do some people come on here and write remarks like \"way too much fat\" blah, blah, blah without actually trying the recipe. Or why some people come on here and change the recipe so much that they've actually posted a new recipe? I made this sandwich for my slim and trim family one Saturday for lunch and we LOVED it! Then we went out and shopped for the week ‘til we dropped - in other words, we efficiently used up the calories. Still, I get so annoyed when I read reviews that complain about the ingredients being to fatty or high in calories. I want to read constructive reviews. I also get annoyed when these same people recreate the entire recipe. Why give a low rating if you don’t even know what the recipe tastes like? AND, if you made the recipe wrong why give it a low rating based on your mistakes? Can’t people just enjoy reading the recipes for what they are? And, if they make the recipe, then judge it on how it tastes. We ALL know how to lighten up foods and what we should and shouldn’t eat. Come on people, let’s be fair and judge a recipe for what it’s worth, and don’t redesign the entire thing - otherwise, post your own version of the recipe and see how YOU get criticized.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sherry_vinigrette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6316561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-21T22:16:19.543Z",
                "reviewBody": "Awesome.  I've made these several times.  I had better luck when I mashed the avocado instead of using slices because the slices are so slippery.  I made these for a party and everyone loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DION18812",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1113928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-28T16:57:05.687Z",
                "reviewBody": "I was not sure about the BBQ sauce/ranch dressing combo, but it works!  I also mashed the avocado because I can then spread it on the bread for avocado in every bite, but that is not really a problem with this recipe... it's a very minor change!  The combo of all the flavors is really good!  The only change I made was to use a nice, crusty sourdough roll instead of the soft hoagie... and that really made it stellar!  DH and I often eat only one meal on weekend days... so this sandwich is perfect because it fills us up and I don't worry about fixing a big dinner!  Thanks, Angelshark...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sourdough girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-27T16:44:01.59Z",
                "reviewBody": "Delicious - I can see why this is \"Dan's Favorite Sandwich\"! My husband loves anything with bacon so this was a winning combination for us! I chose to grill the chicken instead of baking and basted it with a bit of KC Masterpiece BBQ sauce which made it moist and juicy. I cooked the bacon separate toasted some kaiser rolls and added some fresh crisp lettuce and sliced tomato. The warmth from the grilled chicken melted the cheese and we didn't bother putting anything in the oven. These were perfect with some kettle cooked chips! Easy and very filling!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-28T16:57:05.89Z",
                "reviewBody": "I found this dish to be easy and fabulous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "leveeleak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4411174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-12T00:37:36.853Z",
                "reviewBody": "Yum yum yum! I cut recipe to make one sandwich. I made this as a melt on dark rye bread. I used my George Foreman grill to cook the chicken and cleaned it off to grill the sandwich. Was really good and filling too. Tasted like a sandwich you'd buy for 8 in a sit-down restaurant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THEBOYCANPLAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/526602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-07T20:06:02.553Z",
                "reviewBody": "My hubby loved this. I liked it we'll make it again. I think when I do it again I'll slice the chicken breasts and layer the slices on the bread - it will make it easier to eat. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1856239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-18T23:30:30Z",
                "reviewBody": "Made this tonight for myself it was fantastic. Made a few variations for personal preference; I used potato bread instead of hoagie rolls I just like the way it toasts up and absorbs all the oils; I cut one large chicken breast in half lengthwise I thought it was the perfect amount; I'm not really an avocado person so I used tomato istead it was a nice substitute I think; and I added a little hot sauce to the BBQ when glazing the chicken to give it a little kick. Take what you want leave what you don't. The original recipe is great I just thought I'd change a few things for fun.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Greg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402949/"
                }
            }
        ]
    }
]