[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13378/side-dish/sauces-and-condiments/relishes/",
                    "name": "Relish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/82835/melenzana-ali-olio/",
        "name": "Melenzana Ali Olio",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3317121.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2018-03-21T16:42:51.000Z",
        "description": "A marinated eggplant in olive oil and seasonings that is a delicious antipasto dish. Traditionally we make this in September, to be served at Christmas time. Sometimes Nonna slipped a couple of finely sliced sun-dried tomatoes (with dried basil) into the mix for a variation.",
        "prepTime": "P1DT12H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P1DT12H15M",
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "4 medium eggplants",
            "½ cup coarse salt",
            "2 tablespoons white vinegar",
            "2 cups extra-virgin olive oil",
            "1 bulb garlic cloves, peeled and chopped",
            "1 teaspoon red pepper flakes",
            "2 tablespoons chopped fresh oregano",
            "½ teaspoon sea salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "On the evening before you intend to make the dish, prepare the eggplant. Cut the ends off the eggplants, and peel. Cut the peeled eggplant into long strips about as big around as shoestring french fries. Place the strips into a large bowl, and stir in 1/2 cup of coarse salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a sturdy dinner plate upside down in a clean sink, making sure that the drain is not blocked. Place a generous handful of the eggplant strips onto the center of the plate, and cover with another upside down dinner plate to create an eggplant sandwich. Layer more eggplant and plates until all of the eggplant is sandwiched. Cap it off with one additional plate, and press down firmly. Set a sturdy stock pot on top, and fill with enough water to create some pressure on the eggplant layers. Not so much pressure that you break your dishes though. Let this pressing process stand overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next day, fill a large bowl with ice water. Begin dismantling your stack of plates. One layer (handful) at a time, briefly swish the eggplant around in the ice water, then squeeze dry and place into a clean bowl. If your hand starts to hurt, you are swishing too long. Once all of the eggplant is rinsed and squeezed and in the bowl, mix in the vinegar. Let rest for about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a splash of the olive oil in a skillet over medium heat. Once the oil is hot, add the garlic, red pepper flakes, oregano and sea salt. Cook and stir just until fragrant. You do not want to cook the garlic. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Your eggplants should be well rested now. Give them one last sqeeze. Make it a good one, or your melenzana is going to taste like pickles. ''Don't worry, this is the last time, I promise...'' (This is to be said to the poor little melenzana - they've been through so much!)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the squeezed eggplants into a large bowl, and stir in the contents of the skillet and remaining olive oil until well blended. Transfer to sterile 1 pint or 1/2 pint jars. Make sure to fill the jars to the top, and top off with any olive oil that may be left in the bowl. Wipe the rims with a clean dry cloth, and seal tightly with new lids. Refrigerate for at least a month before opening.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Relish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DXRICCI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.875,
            "ratingCount": 8,
            "itemReviewed": "Melenzana Ali Olio",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "291.2 calories",
            "carbohydrateContent": "9.1 g",
            "cholesterolContent": null,
            "fatContent": "28.3 g",
            "fiberContent": "4.7 g",
            "proteinContent": "1.6 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "2698.4 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-09T23:30:16.103Z",
                "reviewBody": "I was looking for a recipe almost exactly like this one that my Italian grandmother used to make. She called it something different but I don't know how to spell it. It was pronounced like moo-lin-yahm. My grandmother made this in a crock (with the layered plate method)and it took a couple of days, but other than that, this is pretty much the same recipe. Thank you very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debra Hudson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/75383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-07T11:42:43.56Z",
                "reviewBody": "it was quite good. I had a similar recipe that had one shortcut in it...that one you slated the eggplant and let it drain in a colander over the sink...so I did that for step one since it was simpler. I just used plastic wrap with pie weights in it on top on the colander/veggies. I did use the sundried tomatoes and basil that were \"optional\" since I like both. I originally gave this a 4 but bumped it up to a 5 because both my husband and daughter who do not like eggplant actaully took seconds. We all had the same comment though: It tastes like olives! Probably due to the brine treatent. But that did giveme the idea that when I make it again next time I am actually going to PUT black olives in the marinade with it. Eggplant and olives are a good combo and it will look pretty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "camohn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3699538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-25T16:59:38.05Z",
                "reviewBody": "I have been looking for a recipe for this salad for years!  We once were able to buy it at our favorite Italian market in Philly.  Sadly, they stopped making it.  They might have had a few more ingredients in theirs such as parsley and chopped red peppers and I will try those additions next time.  The amount of salt in this is also way to much.  A few tablespoons is more than enough and will still draw out the water and subdue the bitterness. The recipe is more complicated than necessary.  Simply set the eggplant in a bowl with the salt and place a plate over top that fits snugly into the bowl.  Add another flat bottom pot on top and fill with water. Let sit about 4 hours, stir a time or two and continue with the recipe.  I did not do all the heavy squeezing but did press out most liquids.  The salad need not sit for one month either.  It is ready as early as 24 hours.  Delicious salad - I will be making this often, with my adjustments and additions! **UPDATE** made again but used MUCH less salt, about 1/4 cup.   I placed everything in a ziplock bag and squeezed out the air and refrigerate overnight.  Rinsed in the bag, squeezed in the bag and continued with the recipe.  So much easier than the recipe method!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-08-02T23:02:13.367Z",
                "reviewBody": "This is the best method that I have found for pickled eggplant. I only had two in the garden ready to pick so followed for two. Thanks for posting",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Uncle Pat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20372108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-23T21:10:37.473Z",
                "reviewBody": "I tried it and loved it!!! I have made it several times and the only things I have changed are the amount of salt and crushed red pepper which I decreased the first and added more of the latter. Nonetheless it is an awesome recipe. I live in Europe and I know that this is one recipe cooked in all Italian homes in Autumn. Kudos DX!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Umberto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15675010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-02T03:01:13.31Z",
                "reviewBody": "I ve made this as is. It is awesome. Sometimes I can t leave well enough alone. I added red bell peppers and fresh mushrooms this time. Beautiful in the jar and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Victor Nease",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4389434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-08T20:03:51.13Z",
                "reviewBody": "My Italian Mother-in-Law made this every year! I still remember the first time I tasted this outstanding delicacy! So good!\n\nInstead of vinegar I use fresh squeezed lemon juice for added flavor. I often include Sweet Red Bell Pepper sliced as it pairs extremely well with the Melenzana! 5-Stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jack Charles Baer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28165566/"
                }
            }
        ]
    }
]