[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/88228/stuffed-tomato-basil-chicken/",
        "name": "Stuffed Tomato Basil Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3564737.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2018-03-21T16:46:50.000Z",
        "description": "This recipe is a great twist to everyday chicken. I was bored one afternoon and came up with this idea for dinner!  This recipe can be reduced in fat by omitting the cheese and bacon.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 (6 ounce) boneless, skinless chicken breasts",
            "½ (12 ounce) bottle garlic and herb marinade",
            "16 fresh basil leaves",
            "1 large tomato, thinly sliced",
            "4 slices provolone cheese",
            "12 slices bacon",
            "¼ cup freshly grated Parmesan"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts on a cutting board. With a sharp knife, slice chicken breasts horizontally, without slicing them completely in half. Open the chicken breasts like a book. Place chicken and marinade into a large resealable plastic bag. Refrigerate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 500 degrees F (260 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place opened chicken breasts on a broiler pan. Place 4 basil leaves on the bottom half of each chicken breast. Top each with 2 or 3 tomato slices and 1 slice of cheese, and fold over top half of chicken (if necessary, fasten with toothpicks). Wrap 3 slices bacon around each chicken breast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook in preheated oven for 15 minutes. Turn chicken, and cook 15 minutes more. Remove from oven, and sprinkle chicken with Parmesan. Return to oven, and cook until cheese is melted, about 2 to 3 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jodi Hanlon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.59915611814346,
            "ratingCount": 237,
            "itemReviewed": "Stuffed Tomato Basil Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "720.6 calories",
            "carbohydrateContent": "7 g",
            "cholesterolContent": "179.9 mg",
            "fatContent": "49 g",
            "fiberContent": "0.6 g",
            "proteinContent": "58.7 g",
            "saturatedFatContent": "18.9 g",
            "servingSize": null,
            "sodiumContent": "1850.1 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-07-16T17:03:09.417Z",
                "reviewBody": "This is a wonderful dish! Instead of using a marinade, I make my own with olive oil, white vinegar, garlic, and Italian seasoning.  I use two pieces of thin cut chicken breast instead of slicing a regluar breast in half, I double the amount of provolone, keep the same ammount of basil, leave out the tomato, double the amount of bacon, and leave off the parmesan.  I cook it on a rack set over a baking sheet so that the bacon will crisp (instead of cook in the juices).This tastes especially good with \"Pasta with Scallops, Zucchini, and Tomatoes\", found here on this site. EDIT: I've made more changes to this dish since I first made it.  I now marinade thin cut chicken breast in Italian dressing overnight, drain it, spread basil pesto on the insides of the chicken, lay double the amount of provolone (smoked provolone is best, yum) on one slice of chicken, top it with another slice of chicken, and wrap it in double the amount of bacon (first lengthwise, then widthwise, then lengthwise again to remove the need for toothpicks).  The basil pesto makes a huge difference and really enhances the taste of the dish, and the more fat the bacon has in it, the better.  It seems to soak into the chicken and leave it extra tender.  Everyone LOVES this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shawnna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/398749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-21T01:10:02.27Z",
                "reviewBody": "This was absolutely wonderful! The flavors in this dish are amazing! I dont have a broiler pan so I had to cook these on just a plain cookie sheet which worked out well minus slightly burning the bacon and setting off the smoke alarms lol. I cooked the bacon for a few minutes in the microwave to make sure it got fully cooked in the oven. also didn't have grated parmesean so I just used mozerella and it was still amazing. My 3 yr old loved it and so did I. I butterflied my chicken and pounded thin before marinading...which I did for about 4 hours before cooking. highly recommend this dish! I also used roma tomatoes...just as a personal preference and would recommend those for this dish",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1120366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-17T17:33:35.593Z",
                "reviewBody": "Wow! This chicken was awesome! My boyfriend is extremely picky, and he even liked it! The only suggestion I have is to cook the bacon for a couple of minutes in the microwave first, because parts of the bacon were not fully cooked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEASHELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1680070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-24T19:23:08.623Z",
                "reviewBody": "Ok, so I made a few changes--but this chicken was SO good!  I've never written a review before but this one certainly deserves the time.  I didn't wrap it in bacon and I used shredded mozzarella instead. Try it!  You'll love it if you love basil. I can't wait to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "texasabc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1828173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-29T00:34:33.997Z",
                "reviewBody": "Super! Love the flavors together. I did change things up a bit:I used pesto instead of basil leaves and I marinated the chicken in Kraft Italian dressing. I made one with bacon one without (for me too fattening with bacon). Tried both and both were fantastic. So if you're watching what you eat feel free to omit the bacon and you'll still have a great dish. Served this with whole wheat speghetti in a white wine olive oil sauce. So the cheese won't spill out while baking try securing the chicken with toothpicks. Soak the toothpicks in water first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kayzee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2134387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-04T15:13:49.06Z",
                "reviewBody": "This recipe came out wonderfully despite my inexperience as a cook. I changed the marinade slightly due to what ingredients I had available and instead used lemon juice olive oil fresh garlic salt and pepper. I used parmesan cheese inside the chicken and grilled them on a George Foreman. I didn't wrap the chicken in bacon this time around but I may just try it next time! I also chose to serve the chicken over tagliatelle and tomato sauce with more parmesan and a basil garnish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Whitney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1946770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-09T00:44:24.873Z",
                "reviewBody": "We really love this chicken recipe because it is so adaptable. Any kind of cheese is great and I always add mushrooms to everything. Try adding garlic capers black olives anything you like just remember to keep the portions small or the breasts won't close properly. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bender31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2110164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-26T18:58:37.02Z",
                "reviewBody": "I love the idea of the fresh tomato and basil with the provolone but in the execution it didn't work for us. The chicken breast was dry and way overdone. Though edible no one wanted seconds. Thank you for sharing. I'd like to tweak this a bit and work with it to make it work for us. I will probably pound the chicken marinate it put in the \"stuffing\" and roll it and try it at a much lower temp for a shorter duration.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JSAVIDGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-05T04:15:28.797Z",
                "reviewBody": "This has got to be one of my favorite chicken recipes! The basil really tasted delicious with the other flavors and paired well with the chicken. I used sun-dried tomatoes instead of fresh ones but the flavor of the tomatoes was completely overshadowed by the basil. I couldn't really taste the provolone either. I think the keys to this dish were the marinade basil bacon and parmesan on top. I made my own marinade with fresh crushed garlic Italian seasoning lemon juice olive oil white wine and salt & pepper. If I make it again I might just omit the other ingredients that I couldn't taste and see if it makes a difference. All in all a fabulous recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER313",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/506690/"
                }
            }
        ]
    }
]