[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/96787/brown-rice-breakfast-porridge/",
        "name": "Brown Rice Breakfast Porridge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1109773.jpg",
            "width": 2848,
            "height": 2848
        },
        "datePublished": "2018-03-21T16:50:54.000Z",
        "description": "Use up that leftover brown rice and try something new for breakfast. Experiment with it to make it your own, you can try using any mixture of dried fruit instead of the blueberries.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 cup cooked brown rice",
            "1 cup 2% low-fat milk",
            "2 tablespoons dried blueberries",
            "1 dash cinnamon",
            "1 tablespoon honey",
            "1 egg",
            "¼ teaspoon vanilla extract",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the cooked brown rice, milk, blueberries, cinnamon, and honey in a small saucepan.  Bring to a boil, then reduce heat to low and simmer for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg in a small bowl.  Temper the egg by whisking in some of the hot rice, a tablespoon at a time until you have incorporated about 6 tablespoons.  Stir the egg into the rice along with the vanilla and butter, and continue cooking over low heat for 1 to 2 minutes to thicken.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHERRY007"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.407407407407407,
            "ratingCount": 108,
            "itemReviewed": "Brown Rice Breakfast Porridge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.3 calories",
            "carbohydrateContent": "44.7 g",
            "cholesterolContent": "118 mg",
            "fatContent": "11.6 g",
            "fiberContent": "2.7 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "130.3 mg",
            "sugarContent": "20.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-29T16:23:37.197Z",
                "reviewBody": "This recipe is wonderful hearty healthy and satisfying.I've adapted it to make my own version of \"instant porridge\". I cook up a large batch of brown rice in the microwave (30 minutes on high). I divide the cooked rice into individual servings (2/3 cup rice in each plastic bag). I add 2 Tablespoons brown sugar 1/2 tsp. cinnamon and a handful of raisins to each and then freeze. At breakfast remove from bag put in a bowl and microwave for 1 minute. Stir in 1/2 cup milk 2 Tablespoons of egg substitute (like egg beaters) and 1/2 tsp. vanilla. Microwave for one and a half minutes. Stir and serve. Instant healthy and yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2213759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T05:15:06.85Z",
                "reviewBody": "I like breakfast comfort foods and was pretty happy with this recipe. Skipped the egg and thought it came out fine. Tried subbing chopped apple and raisins the first time and used fresh blueberries and almonds the second time I made it. Liked the tartness of the blueberries better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KikiD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2176606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-03T13:54:20.817Z",
                "reviewBody": "Fabulous! This kind of reminded me of a cross between oatmeal and rice pudding. It's quick easy healthy and if you have the brown rice you'll most likely have the other main ingredients on hand. I did not have blueberries so instead I chopped up some walnuts & threw them in. I put in maybe 3 dashes of cinnamon and doubled the honey. Depending on what you add in you may want to adjust the sweetness. My family really loved this. Some of us added in fresh strawberries too. I added in the egg but it was creamy enough even before I added the egg. I think it would be great both w/ or w/o the egg. I've posted a photo of this...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBES1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1217546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-15T18:59:47.09Z",
                "reviewBody": "I really wanted to skip the egg. I love eggs but it seemed weird. I did it with the egg and it was fantastic. Don't skip the egg you will be missing out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SuziandBear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-10T19:29:58.523Z",
                "reviewBody": "This tremendously SIMPLE recipe was a real and true \"find\" for me. I don't like Oatmeal but I do enjoy some of the other hot breakfast cereals (e.g. farina cream of rice cream of wheat etc.). At the same time it just never occurred to me (after 35 years of cooking for a family of 5!!!!) to use my own rice (or last night's leftovers even) in order to \"present\" a nourishing breakfast. This recipe is GREAT!!! You start with the rice and then add whatever else you (and/or your family members) enjoy (for instance banana strawberries perhaps even grapes or raisins instead of blueberries; dried apricots peaches or prunes are also considerations also). IMHO the VANILLA and CINNAMON are \"MUSTS\". As is the BUTTER. But after that just \"fly\" (molasses white or brown sugar maple -- or any other flavor -- syrup rather than honey; homogenized milk heavy or light cream half-and-half etc. rather than 2% etc. etc. etc.). My family members are Ruby Red Grapefruit Juice drinkers so that's what I've been using as our \"side\". But orange apple grape prune juice etc. or any one of the available \"blends\" would be appropriate too; as would be a glass of milk. Thank you thank you thank you cherry007 for your contribution. My family is eating BREAKFAST again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoAnn Cambareri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2414866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-21T01:54:32.147Z",
                "reviewBody": "Defenitely Five Stars!! Was looking for a wheat alternative during a detox and came across this! Although no allergies to wheat this has become an absolute staple for breakfast. Will be making this for guests. The only change I made was using almond rice milk. I even skipped the honey and it was fabulous although I'm sure it's even better with it! Absolutly delicious so glad I found this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2909000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-20T13:05:16.72Z",
                "reviewBody": "This is yummy healthy easy to make and open to variations/substitutions. I made this with some brown rice I had leftover from the chinese restaurant. The first time I used low sugar pancake syrup (it's what I had) frozen mixed berries instead of dried fruit and omitted the spices and vanilla because I had none. The second time I used regular sugar lots of cinnamon a little nutmeg and 1/4 c dried pineapple. I skipped the egg and added salt both times. I love this recipe and will be making it for breakfast every day until I run out of rice and every time thereafter that I have brown rice. A quick note: There is a big difference in taste between using sweet fruits and tart fruits so you may have to adjust the amount of sugar you put in depending on what fruit you use. The pineapple might have actually been okay without any sugar but I had to add a lot of syrup to the porridge with the 1 cup of frozen berries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vo0do0",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2033287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T22:23:27.38Z",
                "reviewBody": "I doubled this recipe. To make this a little creamier I used half fat free evaporated milk. I threw in more than what was called for of dried blueberries I want to say I at least doubled it. I also upped the vanilla to a full teaspoon. This was really awesome. Not only is it really cheap to make but it uses low-calorie/on hand ingredients to make a hearty warm breakfast. This would be good with almost any kind of dried fruit you have or even chopped apples (which I plan on trying tomorrow morning). I really appreciated this breakfast this morning and all of us thought it was quite tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-23T15:13:03.397Z",
                "reviewBody": "This is a great way to use leftover brown rice. After reading previous reviews I substituted dried cherries and toasted almonds for the blueberries but otherwise followed the recipe as is. Very creamy almost like rice pudding. Will use much less butter if any next time. It was a bit overpowering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lotusofblue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2823935/"
                }
            }
        ]
    }
]