[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1005/main-dish/casseroles/noodles/",
                    "name": "Noodles",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/112519/eggplant-pasta-bake/",
        "name": "Eggplant Pasta Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F67441.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2018-03-21T16:54:59.000Z",
        "description": "Layers of eggplant, pasta, and a puree of vegetables called a sofrito create a dense, creamy casserole that is filling and nutritious.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 casserole",
        "recipeIngredient": [
            "1 large eggplant, peeled and thinly sliced",
            "½ pound dry penne pasta",
            "1 large onion, chopped",
            "1 red bell pepper, chopped",
            "2 cloves garlic",
            "1 ancho chile pepper, chopped",
            "2 tablespoons olive oil",
            "6 tablespoons butter",
            "6 tablespoons all-purpose flour",
            "2 cups milk",
            "1 (12 ounce) package vegetarian burger crumbles",
            "1 ½ cups shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).  Lightly oil a large, deep casserole dish. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the sliced eggplant on a greased cookie sheet and bake in the preheated oven for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a food processor, puree the onion, bell pepper, garlic and optional ancho chile pepper. If the mixture is too thick add a tablespoon of water. In a large skillet, heat the oil over medium heat.  Pour the onion mixture into the pan and cook, stirring occasionally, for 10 minutes or until the liquid has evaporated and the mixture has thickened.  Remove from the heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, melt butter over low heat.  Stir in flour until smooth.  Add milk, stirring until smooth.  Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange half of the baked eggplant in the greased casserole dish.  Spoon in half of the white sauce, covering the eggplant.  Spread the veggie crumbles over the white sauce, followed by the pasta, and a layer of the bell pepper puree.  Cover the the onion and pepper mixture with remaining eggplant and spoon the remaining white sauce over the eggplant.  Sprinkle the mozzarella cheese over the casserole.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered in the preheated oven for 35 minutes.  Let stand 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes",
            "Noodles"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Stine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.933333333333333,
            "ratingCount": 15,
            "itemReviewed": "Eggplant Pasta Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "420.2 calories",
            "carbohydrateContent": "40.9 g",
            "cholesterolContent": "41.3 mg",
            "fatContent": "19.5 g",
            "fiberContent": "6.7 g",
            "proteinContent": "21 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "382.7 mg",
            "sugarContent": "7.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-04T00:22:53.79Z",
                "reviewBody": "I made this recipe last night. And of course like many people I made a few changes but only because I didn't have an ingredient. I used a green bell pepper instead of a red one since I didn't have it. I also had a little left over ricotta and put that in the layer inbetween the cream sauce and the pasta. Despite my changes it came out very good. When I make this again (yes it was that good) I will use the red bell pepper because I think it would add a little sweetness to the recipe and also add a little less onion. I used the amt as stated and it was just a little too overpowering. Also some of us are used to thickening our white sauce. Don't do it. Follow the recipe it thickens while it bakes. And I don't think the ricotta made a whole lotta difference but if I had extra I would still add it again. If I didn't it wouldn't be missed. Enjoy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CUTNCOLOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-29T23:39:42.733Z",
                "reviewBody": "WOW! This was so yummy. It's hard to believe that it is a vegetarian dish. I made a few changes..I used Smart Balance fat free milk and whole grain pasta..which made it even more figure friendly. Also the serving size is HUGE! I would take a big piece of this over a tiny piece of lasagna ANY day of the week! This is worth the time and effort:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BunnyzBebaH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4445821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-01T21:43:34.4Z",
                "reviewBody": "So I had to change a few things because I live in a place where things like vegetarian burger crumbles don't exist and because my oven cooks at a steady 600 degrees... 1) Since I don't have vegetarian burger crumbles I just left them out all together. Maybe it tastes better with them but it was still quite good without them. 2) I can't afford olive oil in this country but sunflower oil did just fine. 3) Ancho chili peppers don't exist here so I used a central-asian spicy pepper. I don't think I'll do this again because I didn't feel like the spice really added anything to the dish but I will add a second red pepper for a bit more of that flavor. 3) I didn't have mozzarella cheese but another melt-able white cheese was substituted and tasted great. Overall the recipe was good but it did come out bland as another reviewer mentioned. When I make it again this is what I will do differently: 1) I will cut the eggplant to be about 1/8 inch thick and probably use a second eggplant. 2) When baking the eggplant I will put pieces of garlic inside the eggplant slices and put butter with a sprinkle of salt on top. 3) I will salt and season the white sauce to taste and make a little extra to mix with the pasta. 4) I will mix some white sauce and cheese with the pasta before putting it in the dish to bake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hayley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4148538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-19T18:53:51.12Z",
                "reviewBody": "I followed the recipe and it came out a bit bland. I will definitely add some spices to the red pepper/onion mixture next time. And as another review said don't let the white sauce thicken cook until creamy and it will thicken as it bakes. My husband said he liked it so I'll try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kristen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2969067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-19T15:07:45.933Z",
                "reviewBody": "This was very good we did not have the chili pepper though. We added 1 can diced tomatoes and 1/2 tsp each of basil and oregano. Will make again and maybe add spinach for more color:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Rizzo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/468967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-28T20:05:43.21Z",
                "reviewBody": "This was a solid recipe. I didn't find it to be bland as some reviewers stated. I did use a generous amount of fresh garlic in the sofrito as well as some dried basil. Added some goat cheese to the white sauce and skipped the mozzarella as I felt that the goat cheese would make it more flavorful. I realized last minute that I didn't have enough penne pasta and had to sub out spaghetti but that worked. Topped it with a bit of fresh grated pecorino romano. This dish had interesting flavors and was an enjoyable and different vegetarian dish. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shayna Stancil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2832577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-23T18:52:12.097Z",
                "reviewBody": "Made this last night it was good but bland. I used leftover turkey burgers from the night before istead of veggie burgers. I was looking for another way to use eggplant besides parmesan so I will do this recipe again only next time use some garlic and fresh herbs to give it a little more flavor. I really liked the white sauce and my kids liked it I don't think they knew they were eating eggplant...sshh.. don't tell:-",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OlivetheThyme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4029367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T19:48:59.59Z",
                "reviewBody": "Hubby says 3.5 stars. I followed the recipe mostly with 1 small change. I added fresh basil and parsley to the red pepper mixture. Still somewhat bland and almost boring. It takes a lot of time to make for an ordinary no raves dinner. Probably will not make again. Thanks anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CRUISEM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1064866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-08T17:13:23.213Z",
                "reviewBody": "Made this last night for my vegetarian wife. We both enjoyed it and will make it again. I made the recipe exactly as written but like some other reviewers I think I will add more eggplant and some herbs and spices to taste. Thanks for a yummy dish!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pundragon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2016633/"
                }
            }
        ]
    }
]