[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/181/soups-stews-and-chili/soup/noodle-soup/",
                    "name": "Noodle Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/112818/chicken-long-rice-soup/",
        "name": "Chicken Long Rice Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F700610.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2018-03-21T16:55:00.000Z",
        "description": "This Hawaiian-style chicken soup has been a family favorite for many generations. The leftovers are great, and it freezes well. Even my Texas man loves it!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 pounds chicken leg quarters",
            "3 (32 ounce) cartons low-sodium chicken broth",
            "1 tablespoon Hawaiian sea salt",
            "1 (1/2 inch) piece fresh ginger root, sliced",
            "1 large Maui sweet onion, cubed",
            "1 (8 ounce) package uncooked bean threads (cellophane noodles)",
            "1 bunch green onions, thinly sliced",
            "1 small head bok choy, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken, chicken broth, salt, and ginger into a large pot. Bring to a boil over high heat, then reduce heat to medium-low and simmer until the chicken is tender and no longer pink, about 35 minutes. Remove chicken, and strain broth into a new pot. Discard the solids.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a bowl with hot tap water. Add the long rice noodles, and let sit for 30 minutes to soften.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir onion into the broth, and bring to a boil, then reduce heat to medium-low. Meanwhile, remove the skin and bones from the chicken and discard. Roughly chop the meat and set aside.  Add the noodles, chicken meat, green onion and bok choy; simmer until noodles are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the noodles have sat for 30 minutes, stir in the chicken meat, green onion, and bok choy. Reheat and serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mama Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.535211267605634,
            "ratingCount": 71,
            "itemReviewed": "Chicken Long Rice Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "395.5 calories",
            "carbohydrateContent": "29.1 g",
            "cholesterolContent": "101.5 mg",
            "fatContent": "15.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "33 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "1118.4 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-11T22:21:52.787Z",
                "reviewBody": "Growing up as a child chicken long rice was and still is a favorite of mine. Now I make it often as it is simple and so delicious. This is a good chicken long rice recipe. Nowadays, I just pick up a rotisserie chicken (i.e costco) and shred the meat (thigh, drumstick, some breast) and keep the juices from the rotisserie. I usually add a pinch of hawaiian rock salt to the chicken meat (shredded) with all of its juice and 4 cans of chicken broth in a large pot. I turn the heat up on high to boil. I add some fresh ground black pepper. I use (thumb size) fresh grated ginger, 2 or 3 garlic cloves, no maui onions, and a sprinkle of green onions for garnish. I omitted the baby bok choy. One package of saifun noodles (bean thread) noodles is a must. There are about 4 bundles inside each package, enough for a large pot. Don't buy the vermicelli noodles, it is too thin. Once the broth is boiling, I add the noodles to the pot, I cover the pot and  I let it get soft and expand, about 25 to 30 minutes give or take. Once the noodles are tender I use a kitchen scissors to cut up the noodles. I turn off the stove and let the noodles sit. Since the noodles will usually soak up a lot of the chicken broth I add a another can of low sodium chicken broth to the soup. I then taste and adjust seasonings (salt and black pepper). I normally eat this alone or with POI and/or rice. A very comforting and flavorful chicken soup - especially when you are feeling under the weather on those cold days!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-14T02:17:37.827Z",
                "reviewBody": "Thanks for this idea! We recently went vegetarian and I was looking for something to make with bok choy and rice vermicelli.  I ended up simmering the bok choy in some water with fresh ginger and garlic in it.  I added three diced green onions, some chopped cilantro, and then mixed in a peanut sauce (peanut butter, soy sauce, chili garlic sauce, and hoisin).  I threw in some textured vegetable protein (TVP) to thicken it up and served it over warmed (cooked) rice vermicelli.  It was a hit.  I know this is nothing like your recipe really, but thought I'd add the comment so someone else might get creative too! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dabergmans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2475706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-12T22:47:42.11Z",
                "reviewBody": "Growing up in Hawaii, chicken long rice was a childhood favorite.  This recipe is simple to make and delicious - the ginger perfectly flavors the chicken broth, and the bok choy offers some nice and slightly chewy contrast to the dish.  The only modification I made was cutting back on the chicken stock by 1/3 - I eat it more as a side dish served on a plate than as a soup.  This is the perfect accompaniment to a Hawaiian dinner of kalua pig and macaroni-potato salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wildmorel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T21:14:56.59Z",
                "reviewBody": "ONO!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Icook4dave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2930173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T19:08:05.85Z",
                "reviewBody": "Thank you so much for this recipe! We just moved to the islands from the Mainland and have had to change our menu a bit. This is a perfect addition to our meal menu. I doubled the recipe and used chicken bouillon powder instead of stock. To make things easier I added frozen diced onions boiled it a bit then added the long rice noodles. At the very end just before serving I added about two cups of frozen spinach and two cups of diced rotisserie chicken that I bought at Costco. Believe it or not we get cold here in Hawaii and it was perfect for this chilly night. I will definitely be making this many more times! Mahalo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ViciousV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3829045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-15T00:42:31.123Z",
                "reviewBody": "I've looked through numerous Chicken Long Rice recipes and this has to be one of the easiest and most flavorful recipes I've found.  I use chicken breasts because my husband dislikes \"brown meat\" but it is just as good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MauiGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2241550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T19:20:01.177Z",
                "reviewBody": "I live on the Big Island of Hawaii and have tasted lots of chicken long rice.  This recipe is superb and ranks among the best I have tasted. The beauty of Hawaiian food is that it is not exotic - no peanut sauce, lemon grass, or other \"Thai\" like spices or flavorings -- Hawaiian food is simply and deliciously seasoned with Hawaiian sea salt, some ginger, but very few other types of spices. Plain and simple but ono.  Here we eat chicken long rice more like a side dish, and therefore I lessened the amount of broth. I used pink Hawaiian sea salt. We also \"snip\" the long rice into more bite size pieces by taking kitchen sheers and snipping a handful of the soaked long rice at a time, until the entire batch is snipped into shorter, more manageable and bite size pieces.  I used chicken thighs, canned broth, and a bit of powdered chicken broth and water because I didn't have enough of the canned broth on hand.   I would also use this broth to freeze for Chinese recipes. I liked the addition of the mild Maui onions. It was pleasant but not overpowering like regular onions would be.  This will be my new long rice recipe from now on. Today I am using this recipe to feed about 50 local kids in a youth gathering.  I am also serving Kalua pork.  Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3567064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-19T22:28:08.253Z",
                "reviewBody": "This soup is \"souper\"! Made it several times for my family and they love it! Freezes well and is a great comfort food on cold winter days. For convenience I use boneless skinless thighs. Made a large portion and took to work kept hot in the crockpot and all our operators and workers coming out of the cold could smell the soup right away and followed their nose to the kitchen. They all loved it and I had several marriage proposals (LOL)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "silke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3425586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T18:55:54.343Z",
                "reviewBody": "I never thought of Chicken Long Rice as comfort food, but I guess if you grow up on the stuff that's what it becomes.  We do make it with some different stuff though, I've never had chicken long rice with bok choy, so I left it out; I'm not a huge fan of ginger, so I decreased the amount and added garlic.  All my life we've used \"long rice\" for the noodles, it's mung bean thread (the package I bought said \"saifun\" don't know if that's what it's labeled as), found in the asian section of the grocery store, never heard of using rice noodles or rice vermicelli, but I'm sure it'd work.  Very simple recipe, if you can find the right noodles it'll be perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Soifua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/soifua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-25T14:56:02.997Z",
                "reviewBody": "This was not as flavorful as I had hoped. Not sure if I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JAG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2870162/"
                }
            }
        ]
    }
]