[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/263484/chef-johns-chocolate-croissants/",
        "name": "Chef John's Chocolate Croissants",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5282068.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "2018-03-27T01:27:06.000Z",
        "description": "Making your own chocolate croissants takes a while, but for these crispy-on-the-outside, tender-on-the-inside pastries, it's time well spent. This recipe was adapted from one by Bruno Albouze, from The Real Deal (which he is). This is actually the quick version in that we're not leaving the dough to rest overnight before laminating with the butter.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT5H55M",
        "recipeYield": "6 croissants",
        "recipeIngredient": [
            "½ cup warm water (100 degrees F or 38 degrees C)",
            "½ (.25 ounce) package active dry yeast",
            "2 tablespoons granulated white sugar",
            "1 ¾ cups unbleached bread flour",
            "1 ½ teaspoons kosher salt",
            "3 tablespoons butter, room temperature, cut into pieces",
            "1 stick unsalted European-style butter",
            "1 cup chopped bittersweet chocolate",
            "1 egg",
            "1 tablespoon water",
            "1 pinch coarse sea salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place warm water in the bowl of a stand mixer. Sprinkle with yeast. Let yeast dissolve for 10 minutes. Add sugar and bread flour. Sprinkle with salt; add 3 tablespoons butter. Attach the bowl to the stand mixer. Mix dough with the dough hook just until butter is completely kneaded in and the dough forms a ball and pulls away cleanly from the sides of the bowl, 3 or 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough to a work surface and form into a semi-smooth ball. Place dough back in the mixer bowl; cover. Let rise in a warm spot until doubled, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough to a lightly floured work surface. Push and press dough to deflate it, and form it into a rectangle. Fold into thirds by lifting one end over the middle third, and folding the other side onto the middle. Wrap in plastic wrap. Place on a rimmed baking sheet lined with a silicone mat. Refrigerate until chilled through, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut 1 stick of butter in 1/2 lengthwise and place halves slightly apart from each other on a length of parchment paper long enough to fold over the butter. Fold the parchment paper over the butter. Press butter down. Roll out with a rolling pin to a square about 8x8 inches. Refrigerate until a little chilled and just barely flexible, 10 or 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough out into a rectangle slightly wider than the butter slab and just over twice as long. Place butter on one half of the dough leaving about 1 inch margin from the edge of the dough. Fold the other half of the dough over the butter. Dust work surface and dough with flour as needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press rolling pin down on dough to create ridges. Then roll out the ridges. Repeat this process. Keep pressing and rolling until dough is about the same size rectangle as you had before you folded it in half, dusting with just a bit of flour as necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Starting from the short side, fold one-third of dough over middle third. Then fold the other end over to form a small rectangle. Flatten out just slightly with rolling pin. Transfer to the silicone-lined baking sheet; cover with plastic wrap. Refrigerate until chilled, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough back to work surface and repeat pressing and rolling technique until dough is the size of the previous larger rectangle. Fold into thirds again, starting from the short side. Press and roll slightly. Transfer back to lined baking sheet. Cover and refrigerate about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll back out to a large rectangle. This time, fold dough in half. Then press and roll out into a 1/2-inch thick rectangle, using as little flour as needed to keep dough from sticking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dust dough with flour and roll out to a rectangle about 1/8-inch thick. Cut dough lengthwise into 6 pieces using a pastry wheel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pull and stretch out 1 of the dough pieces until ends are slightly tapered. Line 1 to 2 tablespoon of chocolate 1 inch parallel to the bottom edge and an equal amount of chocolate 1 more inch ahead. Roll dough up over the chocolate toward the top short edge to form a croissant with the seam at the bottom. Repeat with the remaining 5 dough pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place shaped croissants on baking sheets lined with silicone mats. Whisk together egg and 1 tablespoon water to make the egg wash. Brush croissants with a large portion of the egg wash. Place in a warm area to allow them to rise, 60 to 90 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Brush croissants gently but thoroughly again with egg wash. Sprinkle sea salt on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until beautifully browned, about 25 minutes. Transfer to a cooling rack. Cool to room temperature, about 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.85,
            "ratingCount": 20,
            "itemReviewed": "Chef John's Chocolate Croissants",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "566.1 calories",
            "carbohydrateContent": "52.7 g",
            "cholesterolContent": "88.6 mg",
            "fatContent": "36 g",
            "fiberContent": "4.1 g",
            "proteinContent": "8.4 g",
            "saturatedFatContent": "22 g",
            "servingSize": null,
            "sodiumContent": "591.7 mg",
            "sugarContent": "22.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-07-10T11:24:33.82Z",
                "reviewBody": "This was so easy. I made it exactly how the chef said and it came out fabulous. I also made it using whole wheat flour and it was amazing. I have made it multiple times and will continue to do so. Thanks a million",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hysin Alarcon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18270414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-24T06:14:43.86Z",
                "reviewBody": "I love you chef john. they were so good",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie led",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26032975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-13T09:51:50.907Z",
                "reviewBody": "I made three different croissant recipes to test them, and this one was not only the easiest, but it turned out the best by a landslide. 100% reccomend this recipe for anyone who wants croissants. Fantastic!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Dawson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23578693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-04-15T05:02:16.397Z",
                "reviewBody": "My husband and I loved these!  I wanted to make 12 chocolate croissants instead of 6 so I followed Chef John's recipe for regular croissants (which is pretty much the same as this one except double) and then switched over to follow the instructions for adding the chocolate.  I didn't roll the dough out quite long enough so my croissants were a bit short and stubby, but the flavor and texture were there so I don't care as much about the looks.  I'll do better on that next time!  It helped me to watch and pause each section of the video as I went along.  Chef John has made me feel more confident about making pastries!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gtown85",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/29155490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-10-05T11:45:40.57Z",
                "reviewBody": "Thank you! Family enjoyed these. To be honest for my part they mostly served to fill an empty space in a relatively satisfactory way. I suspect the problem (apart from my inexperience) was the 8 by 8 inch butter slab (and corresponding dough rectangle) in this recipe. Really seemed to roll out pretty slim compared to other laminates I've experimented with. Butter was almost a smear! After baking these I read your croissant recipe and noticed the measurements of butter and dough rectangles are identical to those in this recipe but with twice the amounts of each to work with. Was this intentional? I think I'll try your croissant recipe tomorrow and I suspect with a slab of butter twice the thickness to start with the result will be improved. Appreciate the humor in your videos. My wife and I chuckle over just about any of them we watch:) Redshoes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "redshoes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24334015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-10-24T21:27:31.553Z",
                "reviewBody": "Yuri y k.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karina Martínez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24238063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-26T08:39:26.047Z",
                "reviewBody": "These are so grand! I had to watch the video for the laminating (so very easy just not easy to initially comprehend from instructions- that s on me not the instructions). They are so very very very flaky. And I know you said we had to wait for them to cool. We just haven t been able to wait yet. They smell soooo good coming out of the oven. Thanks for making this so easy and so incredibly good. Made exactly as written the first time. The second I had to adjust for 7000 ft altitude (added 1 T water reduced sugar by 1/2 T) because first batch was slightly dry dough though they baked oh so well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Oros",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18002021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-08-21T04:50:10.127Z",
                "reviewBody": "I have made these twice so far. First time I was making the regular croissants (also very good) and saved half the dough in the freezer. I did not think I would like Chocolate Croissants as much. I was wrong. The ratio in this recipe is perfect! The first time I rolled the dough with the butter slab I panicked with the butter started to squirt out the sides and a few croissants kept trying to unroll themselves as they continued to rise on the sheet. The end product was still delicious and (I think) reasonably attractive. I took them to a winery for a picnic. Thanks Chef John! I wanted to try to make croissants for a while but was scared off until I saw your video.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23830411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-10-18T04:25:46.68Z",
                "reviewBody": "Great job of explaining and simplifying a complicated dough made this an incredibly tasty breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brandonthornton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30854243/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Chocolate Croissants",
            "uploadDate": "2018-01-29T18:25:26.302Z",
            "duration": "PT6M22.716S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F776490eb-32f4-49b6-84a2-c9abdf5c30ae%2F55ae1a97-712b-461a-ad45-c44ee94d6fe9%2F90x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5721789306001"
        }
    }
]