[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14047/barbecue-tofu-sandwiches/",
        "name": "Barbecue Tofu Sandwiches",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F19805.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-08-28T02:27:50.000Z",
        "description": "Finally a veggie sandwich with true barbeque flavor!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (12 ounce) package extra firm tofu",
            "3 tablespoons vegetable oil",
            "1 onion, thinly sliced",
            "1 ½ cups barbecue sauce",
            "6 hamburger buns"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Drain the tofu between paper towels until most of the water has been squeezed out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice tofu into 1/4 inch thick slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large skillet, fry tofu strips until golden brown on both sides. Add onion and cook for a few minutes, until onion is at your desired consistency.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in barbeque sauce (use more or less, according to your taste). Cook the mixture for ten minutes on low and serve on buns.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FOODCAT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.230769230769231,
            "ratingCount": 195,
            "itemReviewed": "Barbecue Tofu Sandwiches",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "335.8 calories",
            "carbohydrateContent": "47.1 g",
            "cholesterolContent": null,
            "fatContent": "12.5 g",
            "fiberContent": "2.1 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "945.4 mg",
            "sugarContent": "17.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-07T14:29:50.593Z",
                "reviewBody": "I give this a five, but with my changes.  Those not familiar with tofu will need to know the following:  Remove the tofu from the box with water.  Drain water and place tofu on a tray or plate lined with two paper towels.  Place two more paper towels on top of the tofu.  Put another plate on top and finish it with something heavy to lightly weight it all down without making it crumble on the sides.  (I use a four cup measuring glass set on top of the final plate for weight)  Let the tofu set for 20-30 minutes on countertop.  This will drain all of the water out and prep the tofu for cooking.  The paper towels will be SOAKED when you take it out.  Discard them and cut the tofu into 1/4\" stips longwise.  Cut those strips in half diagonally to make triangles.  Put these on a plate and freeze them for 1 hour.  They should be frozen on the edges, but not too stiff to move.  Do not thaw before cooking.  This will make the tofu chewy and \"meaty\" rather than the undesirable soft and gooey-centered tofu.  Heat 1-2 tbsp of olive in a non-stick pan on medium-high heat.  Cook the flash-frozen tofu 3-4 minutes on each flat side, being sure to shake the pan often so as not to allow the tofu to stick.  When the tofu is brown and crispy, turn the heat down to low-medium.  Pour bbq sauce to taste directly in the pan and shake around until tofu is completely coated.  Cook 2 minutes until sauce is crispy set to tofu.  Serve on toasted wheat buns topped with light cole slaw.  (Cole slaw pre-slic",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BetteDavisLies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2617981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-02T03:33:06.043Z",
                "reviewBody": "I changed the recipe to make it a bit healthier (that's the reason for eating tofu right?) by reducing the oil to only 1 tsp using about 1/4 cup of barbecue sauce and serving it with tomato slices on a whole wheat bun. It was pretty good I'll probably make it again. I prepared the tofu by slicing it and browning it in the toaster oven first - the texture is much \"meatier\" and less watery that way. Nice recipe thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1228989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-12T21:54:10.497Z",
                "reviewBody": "This was sooo good! I seasoned the tofu with a drop of Worcestershire Sauce on each side and garlic powder Grill Mates Montreal Chicken Seasoning and a little salt. I then browned it with extra light flavored olive oil and removed the browned tofu from the pan. After I wiped the pan I sauteed one half of a sliced onion in about a tsp. of olive oil. Once the onion was translucent I added ketsup a small amount of Kraft Honey BBQ sauce a little garlic powder and water. I let it simmer a little to reduce a bit before I added a pinch of thyme and returned the browned tofu to the pan. Each piece of tofu was flipped to coat all sides with the sauce and heated through. It was served on toasted burger buns with a dollop of Miracle Whip Light sliced tomato and lots of Romaine lettuce. It was a meal that was enjoyed by all. I will definitely make this again. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gilda George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebony3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T17:11:16.663Z",
                "reviewBody": "WOW! An absolutely amazing meal! This was my first time cooking tofu and it came out beautifully...thanks to the advice given by the other comments. A few things to reemphasize: 1. Do follow the previous suggestion of letting the tofu drain VERY well 2. Make sure you don t cut the tofu too thin or you might have a hard time keeping it from crumbling 3. If you use too much oil the tofu might end up tasting a little like the oil 4. If you're in a hurry this probably isn't the meal (unless you already drained the tofu). It also took me a little longer than expected to get the tofu a yummy golden color. I cooked mine with a little too much oil I m afraid. After the tofu was golden I drained the oil and sautéed it with lots o onions for about 10 minutes this and the fact that the BBQ sauce I used was delicious (Kraft s Honey BBQ sauce) really helped cover some of the oil taste. It turned out great (the tofu and the onions) and there is no doubt that it will be made again...soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaryKlaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/983215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T02:25:49.043Z",
                "reviewBody": "This was incredibly delicious and broke fresh ground in my cooking repertoire.It is so easy and left a lot of room for seasoning to your own tastes.This time I coated tofu in flour before browning in a frypan in order to make its surface more crispy and that made it!Grilled mushrooms also go with it. The key for this dish is to drain tofu well.Before frying I usually wrap it with paper towels put a plate on it and set it aside for a while.If your tofu crumbles try to drain it this way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HISOKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/840571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-26T19:07:30.873Z",
                "reviewBody": "Usually I make my burger with seasonings but I needed a change. I read the reviews and liked what I read so I tried it. I cut it exactly how it said to not too thick or thin. I drained the tofu between paper towels after I sliced it to get it crisper. I left out the onion and cut down on the BBQ sauce but I loved it. I also tried one adding swiss flavored veggie slices lettuce tomato and veggie bacon. Now you've got a Vegan Bacon Swiss Cheese Burger. I'll be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "B2kmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1471703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T17:10:29.473Z",
                "reviewBody": "We have made this repeatedly & its very good! One thing I've found helps alot with regard to texture - we cut the tofu into small squares and bake them first! Baking them will keep them from crumbling without having to add fat by frying. If you don't want to cut it into pieces you can just slice it and bake (we just prefer the smaller pieces).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LEHIGH98",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/620496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:59:07.593Z",
                "reviewBody": "I found the tofu to be less than pleasing but the recipe itself wasn't bad. I guess tofu isn't for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebslo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-19T19:28:13.547Z",
                "reviewBody": "I have never had a BBQ sandwich before and this was wonderful! Make sure you use a LARGE pan it took quite a while in my medium sized one. Also I would start with 1 cup of BBQ sauce and add extra as needed. I only got 4 sandwiches out of this and most people would eat two as a meal so I think the 6 sevings is way off. I loved the way this turned out also it was easily reheated in the microwave just keep the tofu pieces in the fridge and heat them up for 30 seconds pile them on your bun and you are ready to eat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michigan Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818228/"
                }
            }
        ]
    }
]