[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/373/desserts/specialty-desserts/dessert-salads/",
                    "name": "Dessert Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14148/orange-cream-fruit-salad/",
        "name": "Orange Cream Fruit Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F15833.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1999-07-25T13:28:23.000Z",
        "description": "This is a winner every time I make it. The orange flavor in the dressing is so refreshing.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT2H10M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (3.5 ounce) package instant vanilla pudding mix",
            "1 ½ cups milk",
            "⅓ cup frozen orange juice concentrate, thawed",
            "¾ cup sour cream",
            "1 (20 ounce) can pineapple tidbits, drained",
            "1 (15 ounce) can sliced peaches, drained",
            "1 (11 ounce) can mandarin orange segments",
            "2 bananas, sliced",
            "1 apple - peeled, cored and sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium mixing bowl, combine pudding mix, milk, and orange juice concentrate. Beat with an electric mixer on medium speed for 2 minutes. Mix in sour cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large salad bowl, combine fruits. Gently mix in orange dressing. Cover, and refrigerate for 2 hours.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Dessert Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LEAGLE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.494553376906318,
            "ratingCount": 459,
            "itemReviewed": "Orange Cream Fruit Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "214 calories",
            "carbohydrateContent": "42.7 g",
            "cholesterolContent": "10.5 mg",
            "fatContent": "4.6 g",
            "fiberContent": "2 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "175.1 mg",
            "sugarContent": "34.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-03T03:33:57.64Z",
                "reviewBody": "My family loved this salad - it was very easy to make. However, I did add a pint of strawberries, cut the milk to 1 cup, and cut the sour cream to 1/2 cup. I made the dressing and put it in a container and put the fruit in another container. An hour before serving time, I drained the juices from the fruit and added the dressing (I ended up not using all of the dressing because I didn't want it to be too runny). You could almost double the fruit and most likely have enough dressing.\r\n\r\nAlso, I did not peel the apple. I used a red apple and the skin added color. The strawberries were also a nice addition. I soaked the apples in the pineapple juice with a little Fresh Fruit in order to keep the apples from turning brown. \r\n\r\nAnd, I added the bananas right before serving. If this rating system had 10 stars - I'd give it a 10.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1YARIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/868751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-10T03:59:36.39Z",
                "reviewBody": "YUM! The only reason I didn't give this recipe 5 stars, is that the amount of milk called for is too much. I omitted about 1/2 cup of the milk, and the consistency was just about right. I made this for my husband's college graduation party, and everyone loved it. I made the salad the night before the party, adding the apples and bananas right before serving. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIN LADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/797983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T03:36:58.123Z",
                "reviewBody": "I modified the recipe a bit so it would have less sugar & calories. I substituted a 1 oz. package of sugarfree instant vanilla pudding used skim milk & light sour cream & cut up pineapple rings (as my market didn't have tidbits). I didn't bother to peel the granny smith apple I used. I'd saved the drained pineapple juice; I dipped the apple in the pineapple juice & then drained it. Dipping it in the juice kept the apple from turning brown. I also added about a cup of red seedless grapes cut in half for color. I think fresh strawberries &/or blueberries would add to the presentation. After reading the other reviews I decided to make the dish the night before which I would recommend. I drained the fruit well & put the fruit (without the bananas) in a separate container & the orange juice dressing in another container in the frig overnight. I brought the 2 containers & 2 bananas to work today to a baby shower. I drained the fruit again in the morning just before I left for work as people had commented on the dish being too liquidy. Just before serving I cut up the 2 bananas into the fruit & then mixed the container of \"orange cream\" into the fruit. At least 8 people asked me for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FBA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/763329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-02T16:24:10.357Z",
                "reviewBody": "I also made this over Memorial weekend with the following changes based on others recommendations: 1. Let fruit drain overnight and make dressing the night before 2. Used 1 cup of half-n-half and 1/2 cup of sour cream 3. Added 2 tsp of vanilla extract 4. Diced peaches 5. Deleted apples and bananas 6. Added 1 pound fresh strawberries 1 small container of blueberries and about 2 cups of red grapes Turned out perfect with many wonderful comments! Great receipe Lori!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACI911",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1432497/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-03T00:57:30.85Z",
                "reviewBody": "This was delicious and a huge hit. Considering prior reviews indicating that it was a bit runny I took others' advice and cut the milk to 1 cup and the sour cream to 1/2 c. I mixed the fruit and cream separately and let them sit overnight (except for the apples which I added at the last minute to avoid browning). Just before serving I mixed the fruit and cream together and added cool whip to give it more volume and to avoid any runniness. It worked out great. It was not runny at all. The cool whip was light and did not detract from the orangy flavor. It held up for several hours during our cookout without having to be refrigerated. My 11 year old godson asked me the next day if I was going to make some more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CDB122",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-12T14:16:06.803Z",
                "reviewBody": "I didn't have any problem with this being too runny. Reduced the milk to 1 cup and added a dibble of vanilla, and a drop or two of orange extract to the dressing.  I soaked the apples and bananas for 10 minutes each in the pineapple juice (a trick I learned on this site) to keep them from turning brown.  I also added a 16 oz bag of frozen, pitted cherries, thawed, for color.  I can't imagine why anyone would think this had cheese in it, the color is a very mild, pretty orange.  Very good fruit salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T03:49:30.653Z",
                "reviewBody": "This recipe is awesome and really easy! I omitted the apple and banana and substituted in a can of pears (drained and cubed). I also used only 1 cup of milk and 1/2 cup of fat free sour cream. If you are in a hurry and don't have time to drain the fruit overnight in your refrigerator just put it into a salad spinner; it worked great for me! Even the mandarin oranges were fine just don't get too crazy with the spinner:o). Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1RDCANTCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1329626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-05T21:59:21.59Z",
                "reviewBody": "This fruit salad is the BEST ever!  A lot of the reviews said it was runny or didn't turn out.  I took suggestions from other reviewers and found  exactly what you need to do for a great fruit salad.  Reduce the milk to 1 cup.  Make the orange dressing the night before and refrigerate it.  This allows it to set up well.  Drain the peaches, pineapples, and oranges overnight...but save the pineapple and orange juice.  Slice the bananas and soak them in the pineapple juice overnight.  Slice the apples and soak them in the orange juice overnight.  Drain the bananas and apples, mix with other fruit and orange dressing.  I like to refrigerate it for a few hours so all the fruit is cold and the salad is mixed well, then serve.  Turns out perfect every time!  I've received nothing but great compliments for this fruit salad and will continue to make it for brunches and potlucks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vdz_snow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:55:28.02Z",
                "reviewBody": "This is great with a couple modifications. I cut the milk to 3/4 cup added 1/2 cup more sour cream 1t orange extract and cut up a fresh orange to add to the salad. Just a dash of lemon juice and Voila! A great citrus flavored salad. If the dressing makes the salad soupy just add some coconut. It will soak of the \"soup\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-06T12:59:45.623Z",
                "reviewBody": "This was pretty good.  I liked the concept, and liked the orange cream flavor, but thought the apples and banana were out of place.  I'd make this again, but without them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KTWhite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641860/"
                }
            }
        ]
    }
]