[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14870/trusted-brands-recipes-and-tips/campbells-kitchen/",
                    "name": "Campbell's Kitchen",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235588/mini-chicken-pot-pies/",
        "name": "Mini Chicken Pot Pies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8204030.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2015-01-08T07:01:04.000Z",
        "description": "Thirty-five minutes is all you need to have these delicious mini pot pies on the table. Refrigerated biscuits form the crust for a flavorful chicken mixture and baked to golden perfection. They're so good you'll want to make them again and again!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "10 mini pies",
        "recipeIngredient": [
            "Vegetable cooking spray",
            "1 ½ cups cubed cooked chicken",
            "1 (10.75 ounce) can  Campbell's® Condensed Cream of Chicken Soup (Regular or 98% Fat Free)",
            "½ (16 ounce) package frozen mixed vegetables, thawed",
            "All-purpose flour",
            "1 (12 ounce) package refrigerated biscuits",
            "½ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oven to 350 degrees F. Spray 10 (2 1/2-inch) muffin-pan cups with the cooking spray. Stir the chicken, soup and vegetables in a medium bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle the flour on the work surface. Roll or pat the biscuits to flatten slightly. Press the biscuits into the bottoms and up the sides of the muffin-pan cups. Spoon about 1/3 cup chicken mixture into each biscuit cup. Lightly press the chicken mixture down so it's level. Top each with about 2 teaspoons cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 minutes or until the biscuits are golden brown and the cheese is melted. Let the pot pies cool in the pan on a wire rack for 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Campbell's Kitchen"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Campbell's Kitchen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5181818181818185,
            "ratingCount": 110,
            "itemReviewed": "Mini Chicken Pot Pies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "402.2 calories",
            "carbohydrateContent": "40.3 g",
            "cholesterolContent": "38.6 mg",
            "fatContent": "19.2 g",
            "fiberContent": "3.3 g",
            "proteinContent": "18 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "1208.7 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-10-30T15:47:39.26Z",
                "reviewBody": "I hate pot pies. I always have. Whether is was homemade with a flour crust or the frozen in boxes pot pies, they were all nasty. My girlfriend's mother saw this commercial and twenty minutes later, we hadn't even known she'd left, she was back from the store cooking them. She followed the recipe to a T and they were delicious. The crust was perfectly flaky and the veggies were firm. This one recipe changed my view on pot pies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chaes_life",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14546120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-01T02:07:26.093Z",
                "reviewBody": "UUUUUMMMMMmmmm ummmmmmmm goooood just like the Campbell's soups slogan promises!!! These mini chicken pot pies are little but they hit with big awesome flavor! I made some changes & additions I didn't measure out the chicken I just bought a 2lb package of boneless chicken. I didn't want to have fresh tasting chicken so I seasoned my chicken after cutting them up in cubes with garlic powder black pepper cayenne pepper chicken seasoning and a little salt since I know that cream of chicken has a lot of sodium (regular taste better than the low sodium). I didn't need to pre-cook the chicken because they were cut up small enough to cook in the oven but big enough to feel the bite of them. I was making a double amount of the recipe so I also used 1 can of cream of broccoli and a half container of sour cream with a little of water so that the mixture would still be thick but stretch. I added some black pepper and parsley flakes to the creamy mixture to give it some color and depth then added the chicken frozen peas & carrots. After placing them in the biscuits cups I sprinkled pepper flakes to the top for some added zing then the cheese and followed the directions as given. These were also fun to make as my kids helped in the process one doesn't like veggies so I had to put his into some biscuits cups then add the veggies to the mixture. Try these you will enjoy it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Peterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4636324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-26T16:24:08.69Z",
                "reviewBody": "My mother used to make her own rendition of this when I was a kid. None of us kids like mixed veggies so she substituted 'flakey' biscuits (our favorite), chopped frozen broccoli for the veggies and cream of broccoli soup and topped with shredded cheddar cheese. When she was feeling particularly patient, she'd even let us kids press the dough into the cupcake tins ourselves. She/we never rolled the biscuit dough out, just patted and formed it into the cupcake tins. Secret tip for moms- kids are more likely to eat something they actually had a hand in making themselves!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14761880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-09T04:38:46.36Z",
                "reviewBody": "Very simple and delicious recipe... Instead of buying canned biscuits, I made my own biscuits using another recipe from this site (Never Fail Biscuit recipe) and added Parmesan cheese to the biscuit dough. Turned out great!!! Definitely adding this to my recipe pile!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Aljerome Taalib Harvey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5537818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-30T19:22:06.613Z",
                "reviewBody": "I've made this mini pot pies 3 times thus far and I have some recommendations. The filling is too salty for me. Use low sodium cream of chicken and add more salt accordingly. Add 2 tsp of thyme basil onion powder and garlic powder to the filling. Instead of topping muffin with cheese I mix the cheese in the filling. I also blanch carrots before mix them with other vegetables because half cooked carrots are disgusting. At last the biscuit cup can be as thin as possible to make more pot pies. Otherwise you might have some leftover filling for creamy chicken soup. If you like the result next time try to make biscuit yourself. At last instead of chicken I use leftover turkey from Thanksgiving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CLL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6394851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-08T22:17:17.083Z",
                "reviewBody": "Not bad. On accident I bought the jumbo biscuits so these came out very breast. It sort of tasted like a bunch of veggies on a biscuit just not very flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "shayda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3319052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-21T16:30:19.737Z",
                "reviewBody": "I was inspired by the size of the little pot pies. What a good idea for portion control. I decided to make mine healthier and skip the canned soup and lower my sodium intake. I made a roux and used my homemade chicken broth to make a really thick sauce to mimic the canned soup. The rest was made just as the recipe was written. Thank's Campbell's marketing department for the idea.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "healthyeater",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6338239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-09T22:37:08.493Z",
                "reviewBody": "This was super easy to make but the combination of the biscuit cream soup and the Tyson pre-cook grilled cubed chicken I used for a short-cut made the recipe way too salty. I think next time I'm going to add cubed potatoes too to help cut the saltiness. Other than than that hubby loved it. I'll do it again with the changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheryll Gent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9244422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-09T01:58:44.293Z",
                "reviewBody": "I doubled the ingredients to make a larger batch. I rolled two biscuits at a time and folded the excess dough over the top of the mixture once in the muffin pans. Delicious!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3575149/"
                }
            }
        ]
    }
]