[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234631/thanksgiving-leftovers-casserole/",
        "name": "Thanksgiving Leftovers Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7393310.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2013-09-23T17:29:46.000Z",
        "description": "This layered casserole with stuffing, turkey, veggies, mashed potatoes and cheese is the perfect way to serve Thanksgiving leftovers.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H55M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (6 ounce) package STOVE TOP Stuffing Mix for Turkey",
            "4 cups chopped leftover roasted turkey",
            "2 cups frozen mixed vegetables (carrots, corn, green beans, peas), thawed",
            "¾ cup KRAFT Mayo Real Mayonnaise or MIRACLE WHIP Dressing",
            "3 cups leftover mashed potatoes",
            "1 cup KRAFT Shredded Cheddar Cheese",
            "⅛ teaspoon paprika"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oven to 375 degrees F.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare stuffing as directed on package; spread onto bottom of 13x9-inch baking dish sprayed with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine turkey, mixed vegetables and mayo; spoon over stuffing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix potatoes and cheese; spread over turkey mixture. Sprinkle with paprika.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 30 to 40 min. or until heated through.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kraft"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.511111111111111,
            "ratingCount": 90,
            "itemReviewed": "Thanksgiving Leftovers Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "329.5 calories",
            "carbohydrateContent": "14 g",
            "cholesterolContent": "61.5 mg",
            "fatContent": "20.7 g",
            "fiberContent": "1.7 g",
            "proteinContent": "20.9 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "411.5 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-12-01T00:31:32.293Z",
                "reviewBody": "This recipe turned out a lot better than I was expecting. Honestly, I love my Thanksgiving leftovers and I eat them, as is, for breakfast, lunch, & dinner. My husband gets bored easily though, so I gave this a try. I wasn't expecting it to be great, but it was. I reduced the servings to two, because I didn't want to use up all my leftovers. I used my homemade stuffing, green beans we had instead of mixed veggies, and we don't care for mayo so I swapped it for leftover gravy so the dish would have moisture and it worked like a charm. This was so simple to throw together and it tasted wonderful. I will keep this recipe handy to use throughout the year for quick meals when I have leftover chicken to use up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RainbowJewels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rainbowjewels/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-01T06:52:15.95Z",
                "reviewBody": "This is a great recipe.  I made it twice.  The first time I adapted it to make a festive looking meal for the vegetarian clients of our soup kitchen.  I started with Stovetop Cornbread stuffing, prepared as directed then added sautéed celery, onions and grated carrot and pressed it into the baking pan as a crust.  I added a layer of chopped Portabella mushrooms which I sautéed with onions and mixed with Italian cheese blend.  The top was mashed potatoes, piped into rosettes.  This was the first time I felt we presented a vegetarian meal equal to the regular meal.  The second time I made it as per the recipe, but using leftover stuffing and a frozen vegetable mix with leftover turkey.  The mayo made it moist and enhanced the flavors.  The topping was a bit scant because there was only a small amount of left over mashed potatoes.  I served it with homemade cranberry relish and no one whined about leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-25T18:39:59.927Z",
                "reviewBody": "OK, so this recipe was a pleasant surprise.  I have to be honest and say that I wasn't sure I was going to like it.  Sure, I like all of the Thanksgiving food ingredients.  But the mixed vegetables, added with the mayo...I was skeptical.  But I have to say this casserole is absolutely fabulous!  The end result is very pot pie-ish, and that's always a winner with my family.  It's the ultimate comfort food, and this puts a wonderful Thanksgiving spin on it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookie734",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookie734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-04T19:01:38.427Z",
                "reviewBody": "My family loved this recipe! I used Kraft Olive Oil Mayo and added some dried thyme and poultry seasoning to the turkey and vegetable mixture. Serve with gravy and whole berry cranberry sauce--it reminded us of a turkey shepherd's pie. This is a great way to use up leftovers and it's so versatile. Use your own stuffing favorite vegetables and make it your own!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-10T16:22:47.26Z",
                "reviewBody": "I cooked my \"make-ahead\" turkey gravy this weekend so I added extra turkey wings and used that meat to make half of this recipe. This takes minutes to assemble and it gets two thumbs up in this house. I had some concerns about the addition of mayo but I think all is did was add some moisture but none of its flavor. I can see making this with leftover chicken as well as turkey throughout the year. Great new casserole that will be recycled often here!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-10T03:10:32.44Z",
                "reviewBody": "I was actually surprised I liked this as much as I did. I did lighten it up by using Kraft reduced fat sharp cheddar cheese Kraft Olive Oil Mayo and making the stuffing with only 1 TBS of butter. I also added a tsp of poultry seasonings (recipe from this site) to the mayo-turkey-vegetable mix. Garnished the top of the casserole with green onions as well as the paprika. This is a good recipe to use up Thanksgiving leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ReneePaj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/reneepaj/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-08T21:57:41.027Z",
                "reviewBody": "I thought this tasted good but honestly reminded me of a Thanksgiving plate layered. If making this with leftovers it took considerably more turkey and potatoes than I had expected. I used about 8 good sized medium potatoes and the turkey was about 2/3 of the white meat on a turkey. I liked the potato and stuffing layer. I boiled the potatoes in water flavored with no-sodium chicken broth powder for extra flavor. The stuffing I tweaked to a homemade stuffing with sauteed onions dried sage and some extra bread and a little liquid added to Stove Top's cornbread stuffing. I didn't love the middle layer. I added some seasonings but it kind of reminded me of turkey salad. I used regular mayo as I find miracle whip more of a sweet salad dressing. However all together it worked fine. As this doesn't have any sauce to it definitely serve with your favorite Thanksgiving additions. Think I will be making some homemade cranberry sauce to go on the side. It's a must for me with a Thanksgiving meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-06T17:51:45.093Z",
                "reviewBody": "This was a huge hit! Simple to throw together and a great (and versatile) way to use leftovers. My daughter is a picky eater and she gobbled her serving up and asked me to put it in her lunch the next day! Since it's not Thanksgiving yet and I didn't have any leftover turkey lying around I subbed leftover chicken and it was just fine. This one will definitely be made again after Thanksgiving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyDaysNora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/greengirl24/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-09T18:06:57.147Z",
                "reviewBody": "This recipe is a good base recipe for your holiday leftovers. It can be tweaked to your personal taste which I plan on doing the next time I make it. As written my husband loved the idea behind it and was full of suggestions on how to make it better. One kid ate it no complaints 2 others picked at their favorite parts and my picky eater wouldn't touch it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "My Hot Southern Mess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/myhotsouthernmess/"
                }
            }
        ]
    }
]