[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/244198/baked-apple-roses/",
        "name": "Baked Apple Roses",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5859987.jpg",
            "width": null,
            "height": null,
            "caption": "Baked Apple Roses"
        },
        "datePublished": "2015-06-01T20:01:07.000Z",
        "description": "These were inspired by a cook named Ana, a Brazilian food blogger living in Italy. I really hope you give these gorgeous looking, and very delicious apple roses a try soon. Enjoy!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "2 apple roses",
        "recipeIngredient": [
            "1 large red apple, cored and very thinly sliced",
            "¼ cup white sugar",
            "1 teaspoon ground cinnamon",
            "1 sheet frozen puff pastry, thawed",
            "¼ cup melted butter",
            "1 egg",
            "2 teaspoons water",
            "1 teaspoon confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Butter 2 small ramekins (6 to 8 ounce) and dust with white sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place apple slices on a plate, overlapping slightly if necessary. Microwave on High about 45 seconds just until slices have softened a bit. Cover plate with plastic wrap and a kitchen towel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together sugar and cinnamon in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll puff pastry sheet to less than 1/8-inch thickness. Using a pizza cutter, cut two 3-inch by 12-inch rectangles. Reserve remaining pieces for another use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread melted butter over dough; top with a generous amount of cinnamon-sugar. Place apple slices along 1 long edge of dough, about 1/4 inch beyond edge of dough, overlapping slices slightly. Fold bottom half of dough over the apple slices to form a long \"folder\" of dough with rounded edges of apple slices exposed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg and water together in a bowl. Paint surface of dough with egg wash. Sprinkle with more cinnamon-sugar, to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Starting from one end, roll dough not too tightly to form a rose-shaped pastry. Seal roll with end of dough strip.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer roses to prepared ramekins. Sprinkle with a little more cinnamon-sugar. Place ramekins directly on middle rack of preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until well browned, about 45 minutes. Remove ramekins with tongs and place on baking sheet to cool 5 to 10 minutes. Remove apple roses from ramekins and finish cooling on rack. Dust with confectioners' sugar before serving.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.718954248366013,
            "ratingCount": 153,
            "itemReviewed": "Baked Apple Roses",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1058.4 calories",
            "carbohydrateContent": "96.3 g",
            "cholesterolContent": "142.8 mg",
            "fatContent": "71.3 g",
            "fiberContent": "5 g",
            "proteinContent": "12.1 g",
            "saturatedFatContent": "26.9 g",
            "servingSize": null,
            "sodiumContent": "495.5 mg",
            "sugarContent": "38.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-09-22T00:48:28.487Z",
                "reviewBody": "We made these for Home School Home Ec, and they turned out great! The main addition/substitution I would suggest, and we made, was instead of using butter and sugar to cement the apple slices into place, use blackberry jam. Raspberry, or even a marmalade of choice would work. The blackberry juice, was absorbed by the apples and gave them a lovely blushed hue!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tali Hermit Lang",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16397876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-10-27T23:10:14.957Z",
                "reviewBody": "Advice: cut the apples in the thinnest slices possible.\n I microwaved the apple slices in lemon juice to keep them from browning. I used jam instead of butter and I sprinkled it with cinnamon sugar. I also used the smaller and thinner apple slices to roll in the middle (cause those ones are being bent the most) then gradually placed the bigger slices outside. Then dusted with powdered surgar mixed with a bit of cinnamon ^^",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KPAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7215602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-18T20:41:31.467Z",
                "reviewBody": "I followed the recipe exactly and the roses came out looking just gorgeous! Crispy on outside and quite tasty.  A word of caution: I have made them in a muffin tin and to make sure they fit, I might have rolled the roses a bit to tight, because when they were done, the inside was a bit underdone to my taste. Next time I will try ramekins and will make sure to make the rolls a bit more lose so the hit can cook them more evenly. I would also try to make them sweeter  next time, may be will use jam as other reviewer recommended. Thank you,  Chief John for yet another great recipe. I will definitely make them again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lubatime",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10123923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-16T05:11:43.793Z",
                "reviewBody": "I will make it again until my mother-in-law likes the taste and then we are making 48 for our family get together next year. My recipe actually came from someone else...who used no eggs. Added lemon to the apples so they don't turn color and used apricot jam on top of the dough then sprinkled with cinnamon and lay the apples on top. They are rolled the same and everything else is done the same. My only problem is that I scrimped on the jam but I will use my own recipe...Its nice to see that others make it too. I used Maple Leaf Puff Pastry on my first batch but will use PC All-Butter Puff Pastry with the second...and see if it comes out less heavy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Evelyn Jepson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2271778/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-10-24T19:56:37.327Z",
                "reviewBody": "I made this but did it an easier way. I laid the apple slices on the strips of dough and just sprinkled them with brown sugar and cinnamon powder. I didn't sprinkle the tops with sugar because then the sugar burns and looks like black roses. This is a pretty apple dessert. Tastes even better served warm with a scoop of ice cream on the side. I'm adding my photo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lillianrusso/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-28T14:47:04.757Z",
                "reviewBody": "Followed the recipe using the instructions in the video. They were beautiful and delicious. Would say they are just as (or more) tasty than apple pie yet more beautiful and easier to make. Even bigger bonus - they're easy to make just the right amount when you're preparing for only two or three people. Will definitely make them again and keep them in mind for guests and parties. They were a little difficult to eat with just a dessert fork - perhaps because the apples are a little more firm than in pie which makes them more flavorful but not as easy to cut through. Changes: o Maybe our apples were too large or sliced too thin; used an average of 1/2 apple per rosette. o Tried different levels of layering the apples and different size ramekins. When baked even heavy layering looked good. For ramekin size however if you want to easily remove an attractive rosette after baking be sure it's tall enough to hold all of the rosette. o They were starting to look pretty dark by 30 minutes of baking so turned the oven down 10 degrees for the last ten minutes. Perfect! o Took the advice of the video and went lighter on the sugar with most of this test batch. We liked those with lighter sugar better. Thanks for a wonderfully easy and impressive recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5629526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-17T16:58:19.113Z",
                "reviewBody": "I used Pink Pearl apples because they're pink all the way through and they were very pretty. No microwave so I placed my apple slices on a parchment-lined baking sheet with another parchment sheet on top baked about 5 min @ 350 and left covered to cool and soften. I used an entire apple for each one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cheesemite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2301149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-12T15:30:24.173Z",
                "reviewBody": "I could not find 'puff' pastry I used seamless crescent roll dough. To speed things up I treated the whole square of rolled out dough with the butter sugar and cinnamon and then cut each strip. I spayed paper cupcake liners with butter flavored cooking spray and put them in the ramekins so all I had to do was lift out the 'roses' and place them in a windowed bakery gift box for my friend. Fun and so easy I'm going to do it with my grade school granddaughters!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liks2Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15874706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-24T05:52:54.44Z",
                "reviewBody": "Pretty impressive and tasty!  Followed instructions except omitted egg wash.   Used the apples from my tree, and a muffin pan instead of ramekins.  Next time I will tent the apple roses after about 30  minutes baking to prevent over carmelizing  the apples/rose top .  One sheet of puff pastry made three apple roses.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Foody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4563196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-26T04:55:49.32Z",
                "reviewBody": "I made two sets of these for the first time on 9/26/16. In both cases I used non-stick baking pans - one was a muffin pan; the other one had a ruffled shape to it. I cooked one pan at a time for the alloted 45 minutes at 375 degrees and all of the bottoms and part of the sides got extra dark (just short of burning). I had to actually scrape a few off before putting them on a presentation plate. I was disappointed that apples done this way hardly retain any of their bright vibrant red skin color...they basically all just turn very dark. On the second set I had the good sense to put a tent of foil loosely over the top of the pan to help prevent over-browning but this did nothing to help the BOTTOMS of the pastries which still pretty much got burned a bit. I definitely don't suggest putting any sugar on the top before baking them. Any suggestions on how to keep the bottom of the pastries from burning or over-caramelizing would be appreciated! Perhaps putting a cookie sheet under my muffin pan? I don't know. Help. LOL M.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMAMIMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641477/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Baked Apple Roses",
            "description": "Dessert made from puff pastry, apples, and cinnamon sugar, shaped as roses.",
            "uploadDate": "2015-06-04T21:23:29.908Z",
            "duration": "PT8M23.636S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa6f0f306-295c-46e1-a396-63894a5d9e0b%2F198ed9e1-a13a-42da-adeb-0ab89ffc6214%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4276333089001"
        }
    }
]