[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141728/chicken-sandwiches-with-zang/",
        "name": "Chicken Sandwiches with Zang",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F491165.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2015-07-25T06:03:17.000Z",
        "description": "Chicken sandwiches are just great for any time of the day.  Lunch or dinner makes a great meal for you to eat with your family, outside or in.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 sandwiches",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "3 tablespoons Italian seasoning",
            "3 tablespoons grill seasoning (such as Montreal Steak Seasoning)",
            "½ cup barbeque sauce (such as Big Moe's®)",
            "1 teaspoon butter",
            "1 onion, thinly sliced",
            "1 green bell pepper, sliced",
            "4 mushrooms, sliced",
            "4 hamburger buns, split and toasted",
            "4 slices Swiss cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor or indoor grill for low heat, and lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle the chicken breasts generously on all sides with the Italian and grill seasonings. Slowly cook on the preheated grill, turning every 10 minutes; brush the chicken with the barbeque sauce each time you turn it. Cook until the chicken is no longer pink in the center and the juices run clear. Once done, an instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the chicken is cooking, melt the butter in a skillet over medium-low heat. Cook the onions, bell peppers, and mushrooms in the butter, stirring frequently until the vegetables are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sandwiches, place a chicken breast on each hamburger bun half. Spoon the pepper and onion mixture overtop, and top with a slice of Swiss cheese. Cover with the hamburger bun tops.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Heather"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.46,
            "ratingCount": 50,
            "itemReviewed": "Chicken Sandwiches with Zang",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "465.4 calories",
            "carbohydrateContent": "46.2 g",
            "cholesterolContent": "93.4 mg",
            "fatContent": "14.6 g",
            "fiberContent": "4.7 g",
            "proteinContent": "36.9 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "2777.5 mg",
            "sugarContent": "12.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-27T22:21:04.337Z",
                "reviewBody": "Great for a quick meal! I pounded the chicken breasts down thin first and then seasoned them before grilling. I used some red and green peppers along with some red onion. I left out the mushrooms as I didn't have any on hand. I toasted the buns before assembling the sandwiches and added a little ranch dressing along wih some extra bbq sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-25T17:00:47.55Z",
                "reviewBody": "This is pretty good. I thought it was missing something so I think next time I will use a spicy bbq sauce. I used original flavor since I didn't know if the suggested brand was spicy or not. I also pounded the chicken breasts flat so they would cook evenly and we would not have a really fat piece of chicken on the sandwich. When sauteing the veggies put the bell peppers in first and let them cook a little bit then add the onions and when they are about done add the mushrooms. I didn't think about doing this when I made it so I ended up with over cooked mushrooms perfect onions and crunchy bell peppers. I used an onion bun. Definitely worth trying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-27T19:40:33.91Z",
                "reviewBody": "Since we don't have a grill I made this in a skillet. I coated the skillet with Pam put seasonings on the chicken and then seared it on both sides. Then I started spreading BBQ sauce on it every time I flipped it - about every 5-6 minutes. I did kinda eye the seasonings instead of measuring them out and used a \"bold\" BBQ sauce. It took about 18 minutes on medium heat in my skillet to cook through using medium-sized chicken breasts. I toasted the buns in the oven for a few minutes then put on the chicken and cheese (used provolone because that was all I had) and put back in the oven for about 2 minutes until the cheese melted. Then I topped with the onions and mushrooms (didn't use bell peppers because we don't like them and I didn't have them). Hubby and I both really enjoyed this sandwich. We served it with homemade fries and cut up apples.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3118990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-27T18:07:23.14Z",
                "reviewBody": "We liked these sandwiches. The sandwich was pretty simple to make. Like another reviewer I also flattened the chicken breast a little by lightly poundimg them. I also made enough chicken breasts so I could use \"Everything\" Hogie Rolls. I put the Italian seasoning and the grilling seasonings in a paper bag added the breasts and shook them. Boy were they coated. I used Mesquite BBQ sauce our favorite and grillled them inside on the George Forman. When I sauted the veggies I used olive oil. And I did cook the veggies one at a time as suggested so they would be done at the same time. I forgot to get cheese so I used a smoky swiss and cheddar. We will probably have these again but I will probably rethink the seasonings. Maybe leave out the Italian seasoning and along with the grilling seasoning add some Mesquite Grilling seasoning and onion and garlic powder. Oh I cooked the chicken at a higher heat so they would cook faster. I didn't want them to dry out and they didn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kitten/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-04T17:28:56.14Z",
                "reviewBody": "Like others I pound the chicken breasts thin so they absorb more flavor and I marinate the chicken in bbq sauce and a sprinkle of dry Italian dressing for a few hours. I cook them on the Foreman grill and it takes no time at all. This is a great filling sandwich for lunch - keeps me going all day! Thanks Heather!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-28T00:47:10.393Z",
                "reviewBody": "We liked these; I did follow Rae's advice about not cooking all the veggies at once since some take longer to cook until soft. We also used colby jack cheese because kids wont eat Swiss... I thought 3T Italian seasonings was a bit much so I just seasoned it until it looked right!.. This was sort of just like making a hamburger not sure you really need a recipe but good for beginning cooks!.. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Traci-in-Cali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/traciskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T16:21:42.817Z",
                "reviewBody": "I halved the recipe for 2 servings tho' kept the same full quantity of vegs. & mushrooms. I'd been thinking of leaving out the Italian seasoning because I sensed it might throw off the sweet smokey tangy flavor of the Neely's BBQ Spice Rub & the chipotle barbecue sauce I used; I also didn't want the Italian herbs to burn on the grilled chicken. Reading another reviewer's statement about the Italian herbs made me decide to go with my instinct. I had to addat least another tsp. of butter to saute the vegs which I added at different stages per other reviewers. We both liked this but probably will make only a few more times as there are so many other chicken dishes I prefer. After tasting this as recipe was intended we found we liked it better with crunchy moist lettuce more Swiss cheese & 1 Tblsp. of mayonnaise mixed with 1-1/2 tsp. of the same chipotle BBQ sauce spread on the whole wheat Kaiser roll. Out of curiosity & having 3 types of mushrooms available I sauteed in separate pans mostly the sliced common white button mushrooms (this was best) some chopped portabello (this was very good) & some hedgehog mushrooms (I now know I don't like this type).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-03T00:23:28.543Z",
                "reviewBody": "I marinated my chicken in Italian dressing for a couple of hours before cooking than pounded my chicken down to make a little flatter. As I was going to turn on the grill found we were out of proprane--so I used the broiler which worked fine except for the fact that it's a pain to clean off. I used frozen pepper mix (love this stuff) fresh onion and canned mushrooms. I really liked this sandwich found it really good. Both my husband and I think a hearty roll with a back on it would work best since our veggies kept falling off the sandwich. I liked the swiss cheese with the sandwich and I plan on making these again. I liked them very much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Wilson Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-02T17:57:32.383Z",
                "reviewBody": "A little on the salty side but very flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hnoelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3575152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-09T17:06:09.16Z",
                "reviewBody": "This was good but I was expecting more flavor with all the seasonings. I found this to be just a basic barbecued chicken sandwich with toppings. I doubt that I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BroncosFan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1302669/"
                }
            }
        ]
    }
]