[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/130651/lithuanian-kugelis/",
        "name": "Lithuanian Kugelis",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F776122.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2015-11-19T07:09:26.000Z",
        "description": "This is a Lithuanian dish that my family makes mainly during the holiday season. It goes great with ham or turkey. It is also served in many authentic European restaurants.  This recipe is time consuming but well worth the work put into it.  This is a 'stick to your ribs' dish and is in no way considered lo-cal or healthy.  A dollop of sour cream on top of each piece is a great topping.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound bacon, diced",
            "2 large onions, diced",
            "½ cup butter",
            "5 pounds russet potatoes, peeled and shredded",
            "1 (12 fluid ounce) can evaporated milk",
            "6 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place bacon in a Dutch oven set over medium heat, cover, and cook until the bacon has softened and begun to release it's grease. Stir in the onion and cook until softened and translucent. Remove the cover, and continue cooking and stirring until the mixture caramelizes and turns a deep, golden brown. Remove from heat and stir in butter to melt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir shredded potatoes into the onion mixture, then stir in the evaporated milk and eggs until well combined. Pour into a 9x13-inch glass baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour, or until golden on top. Remove and let stand for 10 minutes before slicing into 3x3-inch squares. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "J Sell Sr/Jr"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.484848484848484,
            "ratingCount": 33,
            "itemReviewed": "Lithuanian Kugelis",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "474.7 calories",
            "carbohydrateContent": "39 g",
            "cholesterolContent": "148.2 mg",
            "fatContent": "29.8 g",
            "fiberContent": "4.6 g",
            "proteinContent": "13.9 g",
            "saturatedFatContent": "12.8 g",
            "servingSize": null,
            "sodiumContent": "450.4 mg",
            "sugarContent": "5.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-15T20:08:49.3Z",
                "reviewBody": "I'm a Lithuanian and tried to make Kugelis myself following this recipe. There were few things I have done differently to make it as closet to what I have eaten in my home country. First of all in Lithuania we do not use Russet potatoes. I actually hardy ever use this sort of potatoes at all - too dry. My favourites are, and this what I used in this recipe, \"Yukon yellow\". You most definitely have to use the smallest grader available. It has to be a \"mash\" out of row potatoes. Take a cheese cloth and squeeze out juice. Leave juice stand for a while for starch to build on the bottom. You will have to remove juice and put the starch back into potato mash. I used 5 pound of potatoes and 6 eggs. However after I fried onions and bacon, I  only added about 1/3 into the potatoes mash and did not use any additional butter. Fat from bacon is more then enough for this dish. Also I did only use about 1/4 cup of evaporated milk. Just a note, next time I will use regular milk or cream. Can not remember even seeing evaporated milk in the stores in Lithuania, only the sugary type. Bake for a hour. Serve with sour cream and the left over bacon and onions mix. Gero apetito!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "marinka.p",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4945468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T17:58:04.61Z",
                "reviewBody": "I made sure to drain-out the water from the shredded potatoes.  The kugelis came out delicious -- good enough for my Lithuanian father-in-law to comment how great it is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vadamonis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2858384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-24T22:11:58.48Z",
                "reviewBody": "Everyone in my family has made this many times and I have been eating and making all the variations for 30 years now.  Some things to note are that you need to finely shred the potatoes (like mashed raw, not like cheese); use salted butter at your own risk, but add salt and pepper to the mix to taste; use nice cheap fatty bacon, stick it in the freezer for a bit to make it easy to dice raw; coming from my Lithuanian family, a bit more bacon never hurt (I use and extra 1/2 lb); and, finally, serve with real sour cream (not light or fat free, this is a Lithuanian recipe!). All in all, this is a recipe you have to perfect on your own, but is well worth the trouble!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "zasquatch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3809398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-11T00:57:45.057Z",
                "reviewBody": "DELICIOUS!!! Being Lithuanian myself. I really LOVE these Ethnic Reciipes. Excellent for Parties - Makes a Lasting Impression.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2343091/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-16T17:03:14.71Z",
                "reviewBody": "This is a family tradition (yes Lithuanian!) However we use chopped bacon & diced ham. We just chop everything up in the food processor shred the potato transfer all into a large bowl add eggs & evaporated milk transfer to a baking dish (coated with Pam for easy clean-up!) and bake at 350 for about an hour. The flavor is AMAZING!!! We also serve with a dollop of sour cream. Just as a note - you can freeze leftover ham (from holidays) and leftover bacon and thaw them out when you're ready to make the Kugeli!:) No need to have anything pre-cooked except the bacon just to get rid of the excess grease. I disagree with the review who said the potatoes have to be thinly shredded - we just use a standard shred my grandmother used to use an old fashioned grater and it comes out PERFECT!!!:) Enjoy!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stormychick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3851259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-11T19:28:12.12Z",
                "reviewBody": "Time consuming but worth the effort. I liked that you did not have to squeeze the juice out of the potatoes. We made this for an ethnic day at my childs school every one enjoyed this dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "radgal43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2698970/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-18T23:51:46.677Z",
                "reviewBody": "I hate rating this recipe so low. I made this tonight exactly as listed and although the dish came out of the oven looking beautiful it was very bland. I realized after the fact that there was no salt or pepper in the recipe and even though I added salt on my plate and tried it with a dollop of sour cream it still wasn't enough. I'll try to salvage the leftovers with some cheese but I don't imagine I can do much more. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Brooke Vible",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/32880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-17T15:43:10.15Z",
                "reviewBody": "Major flaw: where's the salt? You'll need about 1 T per kg less if your bacon is on the salty side. I grate one raw onion in with the potatoes and use extra bacon or other smoked meats (try smoked chicken thighs!). I always strain the potato mush and pour off the liquid retaining the starch but you don't have to. Absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Vaiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1750065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-17T17:44:19.683Z",
                "reviewBody": "I also used Yukon Gold potatoes, they didn't seem to brown after peeling. I halved the recipe but only used 4 slices of thick cut bacon for 2 lbs of potatoes, this was sufficient but bacon lovers could use more. I only used 2 T. of butter but think it would work without it. I don't know how anyone got 5lbs of potatoes in a 9x13 dish, my 2 pounds filled mine to the top and I only used 3 eggs and 6 oz of evaporated milk. Unless you have a very large family I think my version would work well for most. Excellent recipe no need to squeeze the potatoes, make it easy on yourself. Also don't forget to add SALT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Guam Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2140747/"
                }
            }
        ]
    }
]