[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17501/everyday-cooking/more-meal-ideas/",
                    "name": "More Meal Ideas",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1951/everyday-cooking/more-meal-ideas/pet-food/",
                    "name": "Pet Food Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140483/doggy-meatloaf-with-vegetables/",
        "name": "Doggy Meatloaf with Vegetables",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6500377.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2015-11-19T07:09:41.000Z",
        "description": "This is a simple, easy and nutritious recipe to use as a substitute for canned dog food.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "4 meatloaves",
        "recipeIngredient": [
            "1 ½ pounds lean ground beef",
            "3 stalks celery, chopped",
            "2 carrots, grated",
            "1 apple, cored and diced",
            "2 eggs",
            "2 slices white bread, torn into pieces",
            "1 cup regular rolled oats ",
            "1 cup wheat germ",
            "1 (6 ounce) can tomato paste",
            "4 medium potatoes, cubed",
            "3 carrots, chopped",
            "1 stalk celery, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Coat a large roasting pan with oil and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the ground beef, 3 stalks of celery, grated carrots, apple, eggs, bread, oats, wheat germ and tomato paste using your hands. Divide the meat mixture into four equal parts and make loaf shapes. Place the loaves in the roasting pan. Surround them with the potatoes, remaining carrots and remaining celery. Cover the pan with a lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 80 minutes in the preheated oven, or until the meat is cooked through. The internal temperature should be 175 degrees F (80 degrees C) when taken with a meat thermometer. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Portion the food into containers with one loaf and one quarter of the vegetables in each one. Refrigerate. To serve, give your dog 1/3 of a container with each portion of kibble.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "More Meal Ideas",
            "Pet Food Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "secondchancebaker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.458333333333333,
            "ratingCount": 24,
            "itemReviewed": "Doggy Meatloaf with Vegetables",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.4 calories",
            "carbohydrateContent": "27.1 g",
            "cholesterolContent": "42.6 mg",
            "fatContent": "13.4 g",
            "fiberContent": "4.4 g",
            "proteinContent": "15.6 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "195.9 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-02T21:47:46.197Z",
                "reviewBody": "Good recipe to start making your dog's food from scratch. I substituted cooked brown rice for the bread and wheat germ and swapped potato for yams. There's no nutritional value in white bread - that was an absurd suggestion by the editors. I also added 2 cloves garlic - just learned recently that garlic is good for dogs in very small amounts. Also instead of making the logs (and therefore a mess) I baked the meatloaf using a 12-cup muffin tin spraying it with olive oil first. Then you have neat little servings already portioned out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "fozzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2884975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-13T18:47:42.783Z",
                "reviewBody": "I changed the preparation method of this recipe, but did not tamper with the ingredients, which my dog loved. I found that if i served the vegetables on the side as stated in the recipe, that my dog either picked them out, or ate them and did not digest them fully (ask me how I know...). So I just put all the vegetables called for in the food processor and chopped them very finely, then mixed with the rest of the ingredients and proceeded as directed in the recipe. Nothing picked out this time! My dog ate up the whole thing. My dog is old...15 years old...so maybe some of those vegetables were too hard to chew, maybe her digestion isn't as efficient as it used to be, but whatever the reason, changing the preparation as I did worked for us. If you have an older or picky dog I recommend you try this. Also, I always add some flaxseed oil and some ground flaxseed to this before I serve it. It's great for the coat, and helps dogs with arthritis.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2744588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-23T01:15:09.607Z",
                "reviewBody": "Thank you emnd1204 for reviewing my recipe. The original recipe called for 2 pieces of bread. I did not specify \"white\" bread. I left this up to the cook. Personally I haven't eaten white bread since I was a child. I prefer whole wheat myself. If you consider the recipe ingredients you will see that it contains 1 cup of rolled oats and 1 cup of wheat germ. Also in the original recipe the vegetables that surrounded the loaves were mashed prior to placing in the storage containers to allow for easier digestion. My dogs always picked at these and often left them uneaten. The recipe was changed by the editors when they reviewed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "secondchancebaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2172306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-14T00:47:33.917Z",
                "reviewBody": "Going by my dogs' reactions this was a 5 star recipe! The only changes I made after reading other reviews was I boiled and mashed the potato and added it in the mix and I added cooked brown rice instead of the oats and wheat germ. I didn't cook the pieces of potato carrots and celery around the sides. Also I did mine in two regular-sized muffin tins sprayed with cooking spray for about 50 min. I'll be freezing all the extras. The dogs sure loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jody Campos Dowling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-25T01:04:00.947Z",
                "reviewBody": "My dogs love this and lap it up in seconds! I do change a few things to their liking but nothing important enough to mention.:) I always make this when I make meatloaf for my family (seperate recipes obviously). I also freeze the leftovers and give it to them a week or so later. Thanks for the great recipe! My dogs thank you too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMLVS2COOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1341716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-02T00:07:30.07Z",
                "reviewBody": "My dog really loves this. I started cooking all his food except for the kibble. I feel a lot better about what kind of care he is getting now. The changes I made to the recipe were to use 1/2 ground beef and 1/2 ground pork. I just went ahead and grated the apple too and instead of using potatoes I used turnips and instead of cubing them I grated them too. I did not do the last step and add the big pieces of celery and carrot. I thought that was a little too much. All in all it's not too much work and the results are well worth it. Give the recipe a try you will like it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Trinks-McCluskey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3708874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-10T18:16:28.46Z",
                "reviewBody": "I have made this recipe for years as my old dog got quite fussy before the end.  She couldn't smell her food anymore so the addition of garlic helped and she just had to have her tomatoes or tomato sauce.  I also pureed the veggies as she was picky and pushed them aside if it was one of her fussy days.  I froze the leftovers and left a few in the fridge for a few days.  I WOULD HIGHLY RECOMMEND LABELLING THIS IN SEVERAL LANGUAGES ''' FOR THE DOG '''\nThere is nothing in here that is harmful to people.\nGood thing.  The significant other packed it for lunch with some left over pasta.....  Didn't come home barking (at least not more than usual) so it\nwas okay.  Never mentioned that it was for the dog.......",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LindaD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3241178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T20:08:53.03Z",
                "reviewBody": "good recipe..changed the oats and white bread to brown rice ground beef to ground turkey and pureed the vegies before adding to muffin tins....cheaper than canned food and so much better for them...I have three weims...1 needs to gain and 2 need to lose weight....works both ways with the proper kibble...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dgerk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5811953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-04T19:01:04.277Z",
                "reviewBody": "I think this is a great recipe although I would prefer something not as time consuming and I have no problem adding a slice of white bread - it's not that bad considering the other ingredients; and when I look at the list of ingredients on the dog food label white bread is OK to me: however my pup doesnt seem to like wheat germ or anything connected to tomatoes - so next time I wont put in the tomato flavouring. (too bad I didnt know til after I made it) She loves boiled beets - go figure!!:-) ps I wouldnt put the veggies around the loaves either",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lucy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4642339/"
                }
            }
        ]
    }
]