[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/176229/divine-hard-boiled-eggs/",
        "name": "Divine Hard-Boiled Eggs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F191512.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2015-11-19T07:11:39.000Z",
        "description": "These hard-boiled eggs are cooked perfectly every time without turning the yolks green.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "12 eggs",
        "recipeIngredient": [
            "12 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place eggs in a pot; pour enough water over the eggs to cover. Cover and turn stove to high; bring to a boil; turn off heat and place pot on a cool burner. Let the pot sit with the cover on for 15 minutes. Meanwhile, fill a large bowl halfway with cold water; transfer the eggs from the pot to the cold water. Replace the water with cold water as needed to keep cold until the eggs are completely cooled. Chill in refrigerator at least 2 hours before peeling.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "rockyroad"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5684575389948,
            "ratingCount": 577,
            "itemReviewed": "Divine Hard-Boiled Eggs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "71.5 calories",
            "carbohydrateContent": "0.4 g",
            "cholesterolContent": "186 mg",
            "fatContent": "5 g",
            "fiberContent": null,
            "proteinContent": "6.3 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "70 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-03T17:54:39.533Z",
                "reviewBody": "This is the method I use and it always works perfectly.  Another hint...If you are making deviled eggs, or a dish where it is important the yolk be centered...try this trick...while the eggs are still in the carton, place a rubberband or two around the carton and place in refrigerator on its side.  Leave on side overnight prior to cooking and you will have perfectly centered yolks every time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gail",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2899896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-07T19:53:06.683Z",
                "reviewBody": "Makes perfect hard boiled eggs. If you plan on using the eggs immediately after cooling you can tap them with a spoon to slightly crack the shells before placing them in the cold water. The shells will peel off like butter in about an hour letting you skip the refrigerator step. This recipe produces gorgeous firm eggs with brilliant yellow yolks and deviled eggs have never looked better!\nThanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chefini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3180775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-08T22:12:29.017Z",
                "reviewBody": "For the longest time I did not know how to boil eggs the correct way. As silly as this recipie may seem I think it is a must to have on this site for the new cooks. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUASINAUGHT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/163293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:42:38.467Z",
                "reviewBody": "I have been using this method for years and it works every time. I have one extra step, though, which eliminates the 2-hour refrigeration. When the eggs have steeped in the water for 15 minutes, I drain them and put the lid back on the pan and shake it vigorously until each of the eggs is cracked. Then I put ice cubes in the pan to cover the eggs and fill it with cold water. I let it sit for 15-20 minutes and the eggs are cold. Because the cold water is underneath the cracked shells, they almost fall off the egg when you begin to peel them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DorisJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6157200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T19:26:34.85Z",
                "reviewBody": "I've been boiling eggs this way all of my life.  It always works for me. Just to reiterate what a couple of other people said, if you use older eggs, they will peel easier.  Fresher eggs are always harder to peel.  So, don't blame the recipe if your eggs don't peel well.  Next time just use them closer to the expiration date and they'll peel easier.  One tip that I've heard that might help, though, is adding a teaspoon of salt to the cooking water right after taking them off the heat.  The salt doesn't actually make the egg inside salty, it just loosens the shell to make peeling easier.  Give it a try and see if it works for you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ERIDQUA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/606112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-14T21:10:37.37Z",
                "reviewBody": "I could never figure out how to hardboil eggs without the green tinge until I met my father in law. This recipe is EXACTLY\nthe same way he used to cook his. If you have family members who are hardcore about hardboiled eggs(or like deviled eggs as much as my husband), give this a go. You'll be pleasantly surprized.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-10T14:10:20.253Z",
                "reviewBody": "I did this over the 4th of July for deviled eggs and they came out perfect!  A couple other tips: never boil more than 12 eggs at a time and let them get to room temperature before boiling - that reduces the chance of them opening while in the water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-09T21:02:50.11Z",
                "reviewBody": "Even though I'm embarrassed, I'm going to review my epic fail with my eggs.  My way of making hard boiled eggs is similar but I've always needed a 'tester egg' so I thought I would try this recipe (using 3 eggs because that is all I needed) and I followed it to a T.  Came time to peel and cut my eggs.  Pull an egg out of the water, spin it on the counter (see a hard boiled egg will spin beautifully while a raw egg just wobbles around..hmmm, my egg isn't spinning like it should...hundreds of people can't be wrong so I'll go with it) peel, and cut.  Imagine my surprise when it was only soft boiled. Let's just pop these other two in a bowl of water and finish them off in the microwave...yes, I've been alive 42 years and NO ONE has ever told me that I couldn't/shouldn't do that...Kaboom and my microwave door blows open and I have hard boiled eggs EVERYWHERE!  Here is what worked for me: 1) Bring eggs to boil and turn heat to the lowest setting 2) Set timer for 18 minutes 3) When timer goes off, take an egg out of water and see if it spins on the counter top.  If it spins it's done, if it wobbles a bit put back in water for a few more minutes and re-spin to check 4) Run cool water over eggs, while in pan.  5) You don't have to cool for hours.  I peeled mine after 2 minutes.  Just make sure you peel under a trickle of cold running water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "melissaroth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2538923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-12T20:54:26.017Z",
                "reviewBody": "Followed the directions exactly and the eggs turned out PERFECT.  As someone else suggested I cracked the shells with a spoon and soaked the eggs in a bowl of cold water to cool them rather than waiting for the refrigerator.  They cooled as I prepared other parts of the meal and were ready to peel in about an hour. Made great deviled eggs and added to potato salad. This is a VERY SIMPLE yet VALUABLE recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3195954/"
                }
            }
        ]
    }
]