[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17020/main-dish/pasta/pasta-primavera/",
                    "name": "Pasta Primavera Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236218/chef-johns-pasta-primavera/",
        "name": "Chef John's Pasta Primavera",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1104151.jpg",
            "width": 1500,
            "height": 1154
        },
        "datePublished": "2014-01-13T22:19:10.000Z",
        "description": "Pasta primavera is quite a straightforward recipe; spaghetti or fettuccine tossed with an array of fresh spring vegetables. When done right, this is one of the year's great seasonal recipes. This looks, smells, and tastes like a cool, sunny spring day.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 bunch fresh basil",
            "3 cups chicken broth, divided",
            "½ cup olive oil",
            "2 cloves garlic",
            "1 pound fettuccine pasta",
            "2 tablespoons olive oil",
            "1 large leek, white and light green parts only, chopped",
            "1 bunch green onions, chopped",
            "2 jalapeno peppers, seeded and diced",
            "2 pinches salt",
            "2 zucchinis, diced",
            "1 cup chopped sugar snap peas",
            "½ cup shelled English peas",
            "1 bunch asparagus, stalks diced, tips left whole",
            "½ cup grated Parmesan cheese, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil. Hold basil bunch by the stems and dip basil leaves in boiling water until bright green, about 2 seconds. Immediately immerse basil in ice water for several minutes until cold to stop the cooking process. Once the basil is cold, drain well. Remove basil leaves from stems and discard stems.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend basil leaves, 1 cup chicken broth, 1/2 cup olive oil, and garlic together in a blender until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir fettuccine into the same pot of boiling water, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat remaining 2 tablespoons olive oil in a large saucepan over medium heat. Cook and stir leek and green onion in hot oil until softened, about 5 minutes. Add jalapeno and salt; cook and stir until jalapeno is soft, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase heat to medium-high. Stir 2 cups chicken broth, zucchini, sugar snap peas, and English peas into jalapeno mixture; bring to a simmer and cook for 5 minutes. Add asparagus and continue cooking until asparagus is soft, about 3 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1/4 cup basil-garlic mixture into zucchini mixture and cook and stir until heated through, about 1 minute. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pasta in a large bowl; pour zucchini mixture over pasta and pour remaining basil-garlic mixture over the zucchini mixture. Spread Parmesan cheese over the top. Toss mixture briefly to combine and tightly wrap bowl with aluminum foil. Let stand until pasta and vegetables soak up most of the juices and oil, about 5 minutes. Toss again.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Pasta Primavera Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4,
            "ratingCount": 195,
            "itemReviewed": "Chef John's Pasta Primavera",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "589.5 calories",
            "carbohydrateContent": "72.5 g",
            "cholesterolContent": "8.4 mg",
            "fatContent": "26.9 g",
            "fiberContent": "8 g",
            "proteinContent": "18.6 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "606.7 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-12T15:51:09.11Z",
                "reviewBody": "This recipe is FANTASTIC for so many reasons.  I've been making this for about 3 years in every season because I can, because it's so healthy, and because my family and friends all love it.  I added the friends part because my kids take the leftovers to school in a thermos and their friends fight to share it with them.  Funny, my family wouldn't enjoy half of the vegetables on their own but somehow love it in this combined dish.  Do chop ALL the vegetables and have them in prep dishes as well as having all the other ingredients readily available before starting the cooking process.   It helps tremendously in the timing, speed, and enjoyment of making this dish.  No need to flood the reviews section with ideas to delete or add ingredients, just go green in whatever you have available and let the basil sauce blend it all for you.  This is the second recipe (after no kneed bread) that got me hooked on the wonderful world of Chef John.  Enjoy ...you have just stumbled on a goldmine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jab",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4889836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-19T00:45:16.887Z",
                "reviewBody": "This recipe lends itself well to modifications. I reduced the olive oil to 1\\3 cup to cut calories. I found it was lacking in salt, so you may wish to add some extra.  I didn't have jalapenos, so I skipped that step.  I added broccoli instead of snap peas because that's what I had on hand. To keep the zucchini from getting mushy, add it with the asparagus at the end.  I found 3 cups of broth to be too much; if I make it again, I will reduce it to 2 cups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Georgia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4899209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-30T19:29:37.07Z",
                "reviewBody": "What's not to love about a pasta dish packed with healthy vegetables? I felt great serving this to my family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LisaCT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13051194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-24T23:48:32.957Z",
                "reviewBody": "What a surprise! Delicious! I admit I was hesitant looking at all these green vegetables chopped up thinking there was no way my family was going to like this. My husband was skeptical, too. Also, at first it seemed like way too many vegetables for the pasta. Then I was chopping jalapeño thinking this is going to be hot. And then cutting the huge bouquet of basil from the garden thinking this was going to be wayyyyy too much basil flavor. The odds were stacked against it all in my mind, but I trusted the reviews, and Chef John has never steered me wrong. Glad we did! Everyone was surprised and LOVED this dish! It doesn't taste anything like what you think it will based on the individual ingredients. It comes together magically flavorful and filling. Even if you don't like one of the ingredients, you probably won't notice. My step-daughter said, \"I don't like zucchini, but I like this 'cause there's hardly any zucchini in there\"--to which my husband replied, \"Keep believing that.\" Haha. What a great way to \"get your vegetables.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "julietdavis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4964780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-12T10:43:11.893Z",
                "reviewBody": "We have been snow and cold bound in the Northeast this winter. Yesterday was the first warm day of the winter. We spend the entire day outside and then came home and made this AMAZING pasta dinner. This recipe is perfect as written. Not even one change is needed. Be sure to use fresh vegetables and really GOOD cheese. I used a combo of Parm and Asiago which I grated by hand. I will be making this again and again in the warmer months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2239830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-12T18:20:46.6Z",
                "reviewBody": "I give it a 4 only because I make a few alterations, so cannot comment on the original recipe. Changes: I use my homemade pesto instead of the garlic-olive oil-basil ingredients; the pesto provides essentially the same flavors plus a bit of thickening from the pine nuts or walnuts. Other main change: I would first boil the pasta (I recommend Bionaturae whole wheat spaghetti, and don't dismiss the idea until you try it. Available, at about 3 bucks a pound, from Amazon), then stir fry everything in a big wok, adding the veggies in the order of leeks, onions, and peppers first, then the other stuff. But that's just me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Larrylifelines",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12002120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-12T20:26:46.397Z",
                "reviewBody": "I just made this recipe the other night and it was so delicious!! My teenagers even ate it!! Perfect dinner for a cold evening. What's even better it's full of healthy vegetables so I didn't feel guilty eating the pasta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Malissa Reno-Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11689124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-11T02:13:12.65Z",
                "reviewBody": "I wasn't a huge fan of this recipe. I wish there would have been more sauce to the dish. Also I thought there was way too much greens. Maybe more colors to the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jemisho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12634258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-31T19:04:51.667Z",
                "reviewBody": "Use less chicken stock.  Perhaps 2 cups so result will be less soupy.  I used 2 garlic cloves as recommended - and I love garlic - but the cloves were large and strong in flavor and so they overpowered the basil sauce - so just a tip to taste the strength of your garlic first or just add 1 Clove to start with and then see if you'd like to add another. .  Cook veggies less than recommended time - I prefer peas and zucchini with a bit of crunch to them.  I don't care for food that is over salted so I always use sodium free chicken broth so I can control the salt/flavor.  This dish is definitely lacking in salt/seasoning.  Granted the Parmesan does add a bit of saltiness.  I'd suggest salting your pasta water well and adding salt to taste if you used sodium free stock.  I also think using only two cups of stock will help with the whole salt issue - won't be as diluted.  A great dish you can feel good about serving your family, especially.  One last note - I'm admittedly a basil freak - but I would use a VERY large bunch of basil, otherwise the basil flavor gets lost a little for my tastes.  And I'd save some fresh basil to sprinkle over the too of the dish as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Annedo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13299107/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "How to Make Pasta Primavera",
            "description": "See how to make a delicious spring vegetable pasta.",
            "uploadDate": "2013-08-01T18:15:08.610Z",
            "duration": "PT5M3.17S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb6093029-3a55-416b-8714-bb4813ef9f1f%2F6b426e65-31df-40e9-822e-58391cac10dd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2579416683001"
        }
    }
]