[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/509/main-dish/pasta/macaroni-and-cheese/",
                    "name": "Macaroni and Cheese Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16830/main-dish/pasta/macaroni-and-cheese/baked-macaroni-and-cheese/",
                    "name": "Baked Macaroni and Cheese Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/161869/shannons-smoky-macaroni-and-cheese/",
        "name": "Shannon's Smoky Macaroni and Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2151920.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2014-02-24T18:19:05.000Z",
        "description": "This recipe is the best Mac & Cheese you'll ever have.  It is literally one of 3 meals everyone in my family will eat. The smoked gouda gives this dish its smoky rich flavor. It's a gourmet grown-up version of the kiddie classic. Take any leftovers and cut into bite-sized squares, bread, and deep fry for a yummy snack.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (16 ounce) package elbow macaroni",
            "6 tablespoons butter",
            "½ cup all-purpose flour",
            "5 ½ cups milk, divided",
            "2 ½ cups shredded smoked Gouda cheese",
            "1 ½ cups shredded Cheddar cheese",
            "1 ½ cups shredded Swiss cheese",
            "1 cup grated Parmesan cheese",
            "½ cup grated Parmesan cheese",
            "½ cup dry bread crumbs",
            "1 teaspoon ground cayenne pepper",
            "olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a pot with lightly-salted water and bring to a boil. Stir the macaroni into the water and return to a boil. Cook and occasionally stir until the pasta has cooked through, but is still firm to the bite, about 8 minutes; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large pot over medium heat. Add the flour to the melted butter and whisk continually for 1 to 2 minutes to make a roux. Whisk 2 cups of the milk into the roux until smooth and then add the remaining milk. Raise the heat to medium-high and continue cooking and stirring until thickened, but not boiling. Stir the Gouda, Cheddar, Swiss, and 1 cup Parmesan cheese into the mixture; once the cheeses have melted completely, fold the drained macaroni into the mixture to coat. Pour the macaroni mixture into a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1/2 cup Parmesan cheese,  bread crumbs, and cayenne pepper together in a small bowl; sprinkle over the macaroni. Drizzle the olive oil over the bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden and bubbly, about 30 minutes. Allow to rest 10 minutes before cutting.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Macaroni and Cheese Recipes",
            "Baked Macaroni and Cheese Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "S.Michael"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.457516339869281,
            "ratingCount": 153,
            "itemReviewed": "Shannon's Smoky Macaroni and Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "651.3 calories",
            "carbohydrateContent": "50.7 g",
            "cholesterolContent": "106.5 mg",
            "fatContent": "35.1 g",
            "fiberContent": "1.9 g",
            "proteinContent": "32.4 g",
            "saturatedFatContent": "20.5 g",
            "servingSize": null,
            "sodiumContent": "712.1 mg",
            "sugarContent": "8.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-08T20:47:20.363Z",
                "reviewBody": "CHEF'S NOTE: The measurements for the bread crumbs and cayenne are incorrect!  It should read:\n \n1/2 cup bread crumbs (I use Panko)\n1/2 teaspoon cayenne pepper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S.Michael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1609476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-05T18:29:51.823Z",
                "reviewBody": "My husband thinks he's died and gone to Heaven when I fix this! It goes great with just about any meat you choose to fix. I  never use the same cheeses, I go to the deli counter and ask them if they have ANY \"cheese ENDS\", they sell them for 50 cents a lb... This scrumptous dish usually cost me about $2.50....for 10 servings!!  Thanks S.Michael for a great recipe..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3497595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T18:05:58.19Z",
                "reviewBody": "Absolutely wonderful. I only made one change and that's using all fat free evaporated milk. The combination of these cheeses was just wonderful. My boys ate it all and the little I had was just......WONDERFUL. This is going to be my new macaroni and cheese recipe. NOTE: I did add a little hot sauce, onion/garlic powder and dijon mustard but I add that to every macaroni and cheese recipe I make as it's a family favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-13T20:00:28.44Z",
                "reviewBody": "I have tried this out at several dinner parties and first on my boyfriend.  Everyone has raved about the taste.  I haven't changed much. What I use for cheeses are: Artisan Smoked Gouda, Imported Swiss Gruyere, Aged 10 Month Parmesan Shredded, and being a loyal Vermonter I use Seriously Sharp Hunters' Cabot Cheddar.  I find that if you are patient in melting the cheese (shredding is the fastest way to melt it, not cubing like I tried once) that it does not produce a grainy consistency.  I whole heartedly give two very enthusiastic thumbs up.  Thank you Shannon for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef_Colee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4869863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-27T01:08:23.877Z",
                "reviewBody": "Really, really good, with a lot of potential.  I may have overdone the smoked Gouda, and would use half smoked, half non-smoked next time (or maybe 75/25), as the smoky flavor was a titch overwhelming (but I'm not a huge fan of smoky flavors).  I used about 4 cups of half and half, and a cup and a half of whole milk, and Provolone in place of the Swiss (not a fan of the Swiss cheese, although to be fair, I should have given it a chance in this dish).  I also used Trader Joe's whole wheat rotini, and may change that next time, although the ridges held the sauce beautifully.  The only other change I made was to use melted butter over the Panko and parm mix instead of olive oil. This recipe proves that it's only as good as the ingredients.  Use the best you can afford, as it makes a difference.  Reheats wonderfully.  I know it annoys me when people people rate a recipe up or down based on their changes, but I think this recipe lends itself to easy, personal- preference changes.  If you don't like Swiss, don't use Swiss.  If you don't like spicy, don't use the red pepper in the crust (or double it, like I did).  Wonderfully adaptable, but I promise to try it exactly as written next time, with more adaptations the time after.  There WILL be a next time.  Next times.  We're all fighting over the left-overs, and that seldom happens in my house.  One of the best recipes I've run across here, and that's saying a LOT.  Thank you for an easy, delicious, unlimited- possibilities recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trixie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1043484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-25T15:51:38.77Z",
                "reviewBody": "Fantastic. I've made it five Thanksgivings in a row, sometimes using the different cheeses called for, and sometimes using almost all smoked gouda. Sometimes it's been grainy, so one year I figured out the following adjustments and it was perfect! ANTI-GRAININESS VARIATION:\r\nINGREDIENTS: 8 T (1 stick) butter, 6 T flour, 4 c milk + 2 c heavy cream, a small amount of processed cheese for stabilizing (i.e. 2 slices American), 4-6 c shredded cheese (I used 2 half-lb packages of smoked gouda, 1 c grated parmesean, 1 c shredded cheddar), 1/2 t paprika, pasta. TOPPING: 1 c panko crumbs, 1/2 c parm, 1/2 t cayenne pepper, optional t of parsley for color, 2-3 T melted butter (or olive oil). STEPS: Melt butter. Wisk in flour to make roux. Let bubble, but don't burn. Add a little milk/cream and stir until roux is incorporated. Add the rest of the milk/cream. Heat over medium-high heat, wisking constantly, until thickened. Lower heat and simmer, stirring occasionally, 10 mins. REMOVE FROM HEAT BEFORE ADDING CHEESE. Add a small amount of a processed cheese, which stabilizes the sauce/prevents graininess. Stir until melted. Add shredded cheese, cover, and let sit until melted, stirring occasionally. Turn on low heat if necessary to get it to melt, but don't overheat-DON'T let it boil. Add paprika. Cool. Make pasta and cool. Add cooled pasta to cooled cheese sauce and pour into 13x9 pan. Refrigerate until chilled. Combine topping ingredients and sprinkle over pasta. Bake at 400 until golden.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Tucker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4103594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-15T17:12:13.4Z",
                "reviewBody": "Great recipe! the cayenne pepper does add quite a kick, so i'll probably cut it down to 1/2 a tsp, just for personal tastes. and i also did the topping 1/4 c cheese and 1/4c bread crumbs. and it was fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2282357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T16:54:40.22Z",
                "reviewBody": "I've tried a few different recipes on this site and I have to say this is the best one yet. The Gouda brings on a thickness without the cheesy taste. Word of warning, this is also the heaviest Mac and cheese I've had so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "spicejenn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3752117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T18:49:20.02Z",
                "reviewBody": "This was really good!! It was my first time to make homemade mac and cheese and I thought it was pretty easy. I was a little confused on how thick to make to milk butter and flour roux....I just stirred it until it was thick little buttermilk and it worked perfect. I also added a little lemon juice to my shredded cheeses so the sauce would not be string. I also took the pan off the heat before I added the cheese to the mixture. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4267832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T23:11:31.103Z",
                "reviewBody": "Mine came out a little grainy. I guess I didn't do something right with the sauce. Overall it was good, but not great. Too much cayenne for my taste. I would reduce it by half next time. But it was definitely a nice creamy mac & cheese - not dry at all. After I made it I topped it with a little crumbled bacon to try to add some texture, and that was good. Will probably try it again with the bacon cooked into it. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTARAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/369750/"
                }
            }
        ]
    }
]