[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/254280/chef-johns-pourable-pizza/",
        "name": "Chef John's Pourable Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3699573.jpg",
            "width": 2500,
            "height": 1666
        },
        "datePublished": "2016-06-17T01:43:37.000Z",
        "description": "Besides being kind of fun to make, this pourable pizza method doesn't require kneading or rolling/stretching/spinning. So it's an easy way to achieve a really thin-crust pizza. Plus you get that crispy, near-charred bottom you usually get only from a pizza oven.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT1H40M",
        "recipeYield": "4 (8-inch) pizzas",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 (.25 ounce) package active dry yeast  (2 1/4 teaspoons)",
            "1 teaspoon kosher salt",
            "1 ½ teaspoons honey",
            "1 tablespoon olive oil, plus more to oil pan",
            "2 cups warm water (105 degrees F/41 degrees C)",
            "Pizza sauce",
            "Favorite pizza toppings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place flour in mixing bowl with dry yeast, salt, honey, olive oil, and warm water. Whisk together for about 5 minutes. This will be a very thin batter-like dough. Cover and let rise 1 1/2 hours. Dough should be bubbly. Stir with a ladle to eliminate the bubbles.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously oil a cast-iron skillet with olive oil off heat. Pour batter in a squeeze bottle or zip-top bag with a bottom corner snipped. Slowly pour the batter into the skillet starting from the center of the pan and working in circles toward the edge. Try to avoid mixing batter with the oil. If small bubbles of oil appear on the surface, use the tip of a paring knife to gently stir them into the dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pan over medium-high heat. Wait for the dough to form bubbles over the entire top surface and the crust starts to dry out a bit. Flip over and continue cooking one side and the next. The bubbly side should be dry and achieve a golden brown color; the bottom should be well browned, about 4 to 5 minutes total per side. Doneness times will depend on how thickly the batter was poured. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread with pizza sauce and top with your favorite pizza toppings: mozzarella cheese, grated Parmigiano-Reggiano cheese, pepperoni, etc. Try to avoid topping too heavily.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pizza under broiler until toppings are cooked, 3 to 4 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9473684210526314,
            "ratingCount": 19,
            "itemReviewed": "Chef John's Pourable Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388.4 calories",
            "carbohydrateContent": "75.2 g",
            "cholesterolContent": null,
            "fatContent": "4.4 g",
            "fiberContent": "3 g",
            "proteinContent": "10.5 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "527.7 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-08-02T00:02:50.76Z",
                "reviewBody": "It was tricky to decide how many stars to give this because, although it was really good, there is a glaring error in the recipe.  3 cups of flour is way too much.  This recipe is supposed to make one smallish pizza, and the batter is supposed to be thin, and the 3 cups of flour was not compatible with that.  I wound up adding more water to my batter, but it was still too thick, so when I piped it into the pan it didn't make a thin, crispy crust like it was supposed to.  I also made two more pizzas and still had some batter left over!  I did get better at making the pizzas as I was working on it, so I bet I'll be really good at it next time when I use the correct amount of flour.  Chef John, if you fix the recipe, I'll adjust my review to 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2107363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-24T12:21:13.86Z",
                "reviewBody": "I love this method of making thin crust pizza dough! It's amazingly easy! I recommend weighing the flour based on Chef John's notes to obtain the correct consistency. Should you choose not to weigh the flour start with 1 cup of flour add the honey olive oil salt yeast and water; mix and then gradually add the remaining flour in small increments (approximately 1/4 cup each addition) until the desired consistency is achieved. Ensure that each additional flour is completely incorporated before adding more. The dough should have the consistency of a runny batter (watch the video for guidance). I changed the recipe and method a bit solely out of necessity. I substituted instant yeast for the active dry yeast since I only have instant yeast at home. As a result of this change I was able to cut the rest time by about one hour. I have to admit to cutting corners at the end; instead of piping the dough onto the cast iron skillet I poured approximately 1 cup to 1 1/2 cups of dough into the center of the skillet and spread it around with a large offset spatula using the circumference of my skillet as a guide in making perfectly round pizzas. This method worked for me; however Chef John may not approve of it!;-) I was able to make three 12-inch pizzas with this recipe which my family absolutely loved! I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carson's Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7660973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-25T23:34:50.4Z",
                "reviewBody": "this is really crisp and delicious! I did have an issue with my bigger skillet, the dough was stuck to the bottom and it wouldn't flip. when I changed to my medium skillet it was much better. I was craving a pizzeria thin and crispy and this definitely met my craving! I did cut the flour to 2 cups as suggested by others and it was perfect pouring consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Benak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9916435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-27T02:31:19.46Z",
                "reviewBody": "My mixer wouldn't do the job so I tried whisking by hand. When that put too much strain on the whisk I used a spatula and no matter how long I mixed it I never got it to liquify. Close but not like yours. It did rise (out of a large pyrex bowl) and that consistency was like yours but after stirring with a ladle again not as thin as your batter. I still made it but for some reason I had enough batter for 2 full size cast iron pan pizzas that were about 1/2\" thick. I gave you 5 stars because I see someone else tried it and had a 5 star experience and I'm sure it was. Also I really liked your presentation and witty comments. I'm still a big fan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "honda4fun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17385400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-08T10:26:05.797Z",
                "reviewBody": "I used ap flour. Using a plasitic bag and piping the batter onto the pan did not work for me. I used a ladel and then a spatula to spread it out almost like a crepe. Also the batter absorbed the olive oil that was in the pan so I ended up spraying the pan with oil instead and it worked out much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kathyc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8376098/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-12T00:55:53.293Z",
                "reviewBody": "This did not work for me. It wouldn't stay together. Soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Missbrett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14099411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-05-30T01:15:11.09Z",
                "reviewBody": "Okay. I’ve made this twice. First time was a hot mess, but they tasted good. Second time I added about 1/2 c more water before rising.   After  an hour and a half, still looked a little thick and added a little more water. I don’t have a cast iron skillet so I used my non stock.  Used about 1 T oil the first time but  on the second one, I poured the batter in and then drizzled a little oil around the edge.  Came out perfect!  Also I used  this container and it worked perfectly!  Take the pan off the heat between crusts so you can take your time pouring the batter. Excellent!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shirley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20020695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-04T10:40:50.103Z",
                "reviewBody": "I used the ingredients exactly as described no modifications. It was a cool day where I live so I put it into a 150 degree oven to rise. That worked out fine. However I was confused about the cooking instructions. I thought the batter was for one pizza crust so my crust was very thick (like deep deep DEEP dish) so had to be cooked much longer in the pan before I considered it done. The end result was delicious though - a true carb lover's delight. I will try this again and make 3-4 crusts with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LCL77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13197764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-06T07:07:12.91Z",
                "reviewBody": "this is so tasty and fun! I had to modify the cooking a bit since I wanted 6 small pizzas instead of one large, but by turning up the heat and adding a little extra water, these came out great. all 5 children asked that we have it again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sirah7229",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15516695/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pourable Pizza",
            "description": "Perfectly pourable & wonderfully crisp!",
            "uploadDate": "2016-06-15T18:37:06.722Z",
            "duration": "PT7M31.217S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd84649a7-a128-4a61-89b3-91ec11e6bf90%2F9086ed5c-f16f-4b9e-b9c9-16623fe3f029%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4943175296001"
        }
    }
]