[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16217/trusted-brands-recipes-and-tips/goya/",
                    "name": "Goya&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215226/ropa-vieja-cuban-meat-stew/",
        "name": "Ropa Vieja (Cuban Meat Stew)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F992833.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2016-07-30T03:15:57.000Z",
        "description": "A filling beef meal, Ropa Vieja is a main course of shredded and braised beef with plenty of healthy, tasty vegetables like onions, peppers and olives. Our GOYA&reg; Ropa Vieja recipe is sure to satisfy the hungriest of appetites. Lots of rice adds a fluffy texture to a full plate, too. Serve Ropa Vieja with GOYA&reg; Frozen Ripe Plantains for a classic Latin pairing.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT2H35M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons Goya Extra Virgin Olive Oil",
            "2 ½ pounds flank steak, cut in 3-inch x 4-inch pieces",
            "Goya Adobo with Pepper, to taste",
            "2 large yellow onions, finely chopped",
            "1 ½ green bell peppers, finely chopped",
            "1 (6 ounce) jar Goya Sofrito",
            "3 teaspoons Goya Minced Garlic",
            "1 (8 ounce) can Goya Tomato Sauce",
            "1 packet Sazon Goya with Coriander and Annatto",
            "1 packet Goya Powdered Beef Bouillon",
            "¼ teaspoon Goya Ground Black Pepper",
            "1 cup Goya Spanish Olives Stuffed with Minced Pimientos, sliced",
            "1 (2 ounce) jar Goya Capers",
            "1 tablespoon chopped fresh cilantro",
            "2 cups cooked Canilla Extra Long Grain Rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in large heavy-bottomed pot over medium-high heat. Season meat with Adobo. Add steak to pot and cook in batches, flipping once, until well browned, about 10 minutes. Transfer meat to a plate. Lower heat to medium. Stir in onions and peppers. Cook, stirring occasionally, until vegetables are soft, about 10 minutes. Add sofrito and garlic to pot; cook until fragrant, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in 3 cups of water, tomato sauce, Sazon, beef bouillon and pepper. Bring mixture to a boil. Return beef to pot. Lower heat to medium low and simmer, covered, stirring occasionally, about 45 minutes. Stir in olives and capers. Cover pot; simmer until meat shreds easily with fork, 1 - 1 1/2 hours, adding more water in 1/4 cup measurements, if pot becomes dry. Transfer meat to work surface; shred meat with two forks. Bring remaining sauce to a boil. Mix meat and cilantro into sauce. Serve with white rice.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Goya&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Goya"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.78,
            "ratingCount": 50,
            "itemReviewed": "Ropa Vieja (Cuban Meat Stew)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": null,
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-20T22:58:54.657Z",
                "reviewBody": "I was intimidated @ first with making this dish because my husbands mother is Honduran and makes it...So I felt under pressure to make it taste as good..My husband tasted it and said it was better than his mother's! I loved it. I left out the capers as well and used skirt steak...I also saw to late that the recipe called for minced garlic so i substituted 2 teaspoons garlic powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lilmami1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5216436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-08T18:37:54.96Z",
                "reviewBody": "This was time consuming but worth it! It smelled great and the meat was so tender and delicious! The only Goya ingredients I used were Adobo Sazon and capers. My can opener broke so I did could not use tomato sauce and subbed with ketchup instead. Also I used my own home-made sofrito (FIVEBRIGS recipe on this site). I did not have olives so omitted it. I know this is not traditional but I love potatoes and carrots with this beef so I added some diced pieces to the pot during last 30 min of cooking. Word of caution braising the beef caused a lot of smoke and oil splatter. Not sure if this step is necessary. Also if your pot gets black at the bottom like mine did after cooking the beef deglaze with some wine or water and clean with a paper towel and you're in business again. I paired this with Puerto Rican steamed rice by FIVEBRIGS on this site. Also had the Goya frozen maduros but will make my own next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BMARIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/428817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-23T16:40:11.973Z",
                "reviewBody": "I did not add the capers and I did not use all goya products for this recipe. But this recipe was great. Very flavorful. I love cilantro so I used a LOT of cilantro. It was very easy to make as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Organic Nut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2790120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-19T18:45:12.537Z",
                "reviewBody": "I made it tonight and it was really good! I started to worry that the olives and capers were overpowering the flavor but once I added the cilantro it evened out and was so tasteful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "imaqtjv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5226823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T19:32:34.75Z",
                "reviewBody": "Ropa Vieja Haiku: \"Just finished a bowl. Big props to Goya's kitchen. They nailed this meat stew!\" I actually had nearly all of the Goya products on hand except I had several ice-cubes' worth of frozen homemade Sofrito that needed to be used. Left out the capers (can't stand 'em) and after browning the steak and sauteeing the veggies I tossed everything in the crock-pot on low for 8 hrs. About half-way thru I removed the steak and shredded it and added a much heavier handful of cilantro (c'mon Goya - 1 TB??) prior to serving. My husband ate his (scooped w/ a slotted spoon) in a corn tortilla while I ate mine slurpy-soupy-style. The flavor isn't intense but it's unusual enough that I would definitely make this again although I think next time I would consider adding some sweet potatoes or some kind of additional veggie for more stew-ey substance along w/ a diced chipotle or jalapeno for a little blaze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-01T23:18:58.45Z",
                "reviewBody": "Goya, you never cease to amaze me! I had no idea what to expect from this recipe since I had never had Ropa Vieja before, but I can see making this over and over again! It is so full of flavor. I wouldn't change a thing. I made the recipe exactly as written and I'd recommend not omitting the olives or capers, unless you're totally opposed to them or deathly afraid. They really make the dish! I didn't have to add any seasonings at the end, the flavor was just perfect.  If you're thinking the consistency looks too thin, wait until you shred the meat...that really thickens it up. The house smelled amazing while this was cooking. A keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-27T03:45:18.427Z",
                "reviewBody": "I've had ropa viega before and this was way better. I was a little skectical of using 3C water so I added 2 and when I lifted the cover to the pot there was still a lot of liquid left. So during the last half hour as I was shredding the beef I let the sauce simmer to thicken up and gain flavor (I didnt want a soupy texture) and it came out great. I also used a large beef broth goya cube. AND BTW this recipe doesnt mention which sofrito to use. Theres a cilantro based and a tomato based. I used a little bit of both but since there was already a tomato flavor from the tomato sauce the cilantro is fine since you should add some fresh cilantro anyway at the end. Attached a pic 12/26/11",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aarista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2077994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-30T21:29:10.187Z",
                "reviewBody": "I was being lazy so I finished this in a slow cooker - I used a 2lb chuck roast & left it as is (don't need to) & browned meat in very little oil, approx 1 TBS, until it was nicely seared (if you heat your pan correctly before cooking anything, you don't need much oil and food won't stick to the pan...also, no oil splatter); dumped in my crock pot then sautéed veggies in remaining oil & added garlic once it softened a bit and cooked 1 min (or until I smell the garlic) before adding to crock pot; dumped everything else, except olives & capers, and cooked on high 2 hours; added olives, capers & cooked for another 2 hours on high before adding cilantro (I used way more, like a handful, because what's written won't do much flavor-wise... and, I had a bunch chopped already from making cilantro rice already) and let it finish on low until I felt like getting up and serving the family dinner (probably 30-45 min, maybe an hour). Served with cilantro rice, some Puerto Rican-style beans, and a bacalao salad (my pops-in-law is from San Juan, PR so I learned to cook a lot of Puerto Rican food).\n\nAlso, I'd like to correct a previous comment: There's only ONE sofrito (it's the red, tomato-based cooking base). The green, culantro-based cooking base is called RECAITO (which is what I used for the rice). Side note, culantro is NOT the same as cilantro, nor is it used to describe cilantro-culantro is an herb I associate with pho because it's part of the veg/herb plate that comes with a bowl of",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "babycakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15267611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-07T22:10:40.887Z",
                "reviewBody": "I could not find sofrito so I made some using a recipe on this site otherwise followed the recipe. One thing that I did change was the amount of water. It calls for 3 cups (not in the ingredient listing) which I felt was going to be excessive so I used 2 cups which turned out to be just about right. Wonderful full-bodied flavors in this stew with fork-tender beef. Served with Goya's recipe for Black Beans & Rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-07T14:07:45.993Z",
                "reviewBody": "This was OK. It did lack flavor. Only ingredient I didn't use was the capers. I used a slow cooker. Came out real tender. Just add more seasoning. Otherwise good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kris Bongard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5081580/"
                }
            }
        ]
    }
]