[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16217/trusted-brands-recipes-and-tips/goya/",
                    "name": "Goya&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218773/goya-easy-arroz-con-pollo/",
        "name": "GOYA&reg; Easy Arroz con Pollo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3817107.jpg",
            "width": 960,
            "height": 1014
        },
        "datePublished": "2011-08-24T00:29:23.000Z",
        "description": "This simple arroz con pollo recipe is a cinch to prepare with a few GOYA&reg; pantry staples. GOYA&reg; Adobo lends irresistible flavor to the chicken; GOYA&reg; Extra Virgin Olive Oil makes the veggies even tastier and GOYA&reg; Yellow Rice takes away any guess work. One bite and you'll taste an authentic, homemade meal that's easier than ever to make!",
        "prepTime": "P0DT0H5M",
        "cookTime": null,
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound chicken breasts and/or thighs*",
            "½ teaspoon GOYA® Adobo All-Purpose Seasoning with Pepper",
            "1 tablespoon GOYA® Extra Virgin Olive Oil",
            "½ medium yellow onion, finely chopped",
            "½ medium green bell pepper, finely chopped",
            "2 teaspoons GOYA® Minced Garlic",
            "1 (8 ounce) box GOYA® Yellow Rice",
            "1 (4 ounce) jar GOYA® Fancy Sliced Pimientos, drained",
            "8 GOYA® Manzanilla Olives Stuffed with Minced Pimientos, thinly sliced",
            "¼ cup GOYA® Frozen Peas, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season chicken with Adobo. Heat oil in large skillet over medium-high heat. Add chicken to pan; cook until golden brown on all sides, about 5 minutes. Transfer to plate. Add onion and peppers to pan. Cook until vegetables are soft, about 5 min. Add garlic to pan; cook until fragrant, about 30 seconds more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 2 cups water into pan with vegetables; bring water mixture to boil; add rice and chicken to pan. Return water to boil; boil 1 min. Lower heat to medium low; simmer, covered, until water is absorbed, rice is tender and chicken is cooked through, about 25 min.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange pimientos, olives and peas over Chicken and Rice.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Goya&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Goya"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.555555555555555,
            "ratingCount": 18,
            "itemReviewed": "GOYA&reg; Easy Arroz con Pollo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": null,
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-08-11T21:46:30.157Z",
                "reviewBody": "This was very good for a quick meal! I tweaked it to suit our tastes! I used 3 boneless chicken breasts cut into strips. I doubled the olive oil using 1 Tbls. to brown the chicken and 1 Tbls. to sauté the veggies. I doubled the green pepper and used chicken broth instead of water. I used 3 cloves fresh garlic instead of jarred. I doubled the Spanish olives and the peas. And I cooked the peas with the rice instead of adding them raw on top at the end! The chicken was so tender and juicy with lots of flavor from the adobo and flavored yellow rice! I will definitely be making this more often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lillianrusso/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-24T07:04:56.473Z",
                "reviewBody": "Very easy and quick.  Used three chicken breasts and chicken stock and plenty of garlic and cumin.  Everyone loved it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Seiden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14275088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-26T07:58:04.18Z",
                "reviewBody": "This is a great quick and easy recipe for a speedy dinner. I will definitely make it again for a quick mid week dinner. But my definite favorite arroz con pollo on this site is the Panamanian one with the mixed olives raisins fixed paella style.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mpiralla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8958118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-20T00:28:33.29Z",
                "reviewBody": "I loved this recipe though I found it a little over simplified for the actual steps needed. Served with hot buttered Cuban bread and fried plantains; it makes for a well rounded filling meal. I made it with 2 split chicken breasts and also cooked the olives and pimentos with the rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kumiko Koerte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20053116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-03T02:41:55.47Z",
                "reviewBody": "I've made this several times & We love it. Pretty sure this recipe is foolproof! I've used chicken breasts & boneless skinless thighs. I season the chicken with whatever I have on hand.... seasoned salt pepper etc. i use chicken broth rather than plain water. I usually add in a good handful of both frozen corn & frozen peas when I add the rice & water! I serve it with parm cheese",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOAN2005",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-11T08:48:20.23Z",
                "reviewBody": "I don t do the peas or pimentos but other wise it s excellent",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Poland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20252627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-15T09:49:04.847Z",
                "reviewBody": "Very good easy and versatile. Didn't have adobe seasoning so I seasoned chicken with garlic and onion powder cumin paprika salt and black pepper. I also added a 14 oz can of stewed tomatoes that I diced up. Rather than only green peppers I used some frozen mixed peppers (red yellow and green) that I diced up. Instead of both pimentos and stuffed green olives I just used the stuffed olives since they already had pimentos in them. However I sliced them into thirds and cooked them in the pot with everything else instead of just placing them on top of the finished dish. Same goes for the frozen peas I cooked them along with everything else too. As for the chicken I used a couple boneless skinless breasts. After seasoning them I cut them into small cubes then quickly sauteed them prior to adding them into the pot with everything.. I diced half a yellow onion and sauteed it with the peppers before adding the chicken. For the rice I used another brand of yellow saffron rice since our local store does not carry the Goya brand and I used chicken broth rather than water. Once everything was almost completely finished cooking I added a couple table spoons of sherry and the bit of juice that was left over from the can of stewed tomatoes and I folded that into the entire mixture. basically just to give it some additional flavor. All in all it came out great and the entire family loved it had seconds and there wasn't a single grain of rice left!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WiskThis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2898198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-18T08:22:19.38Z",
                "reviewBody": "Yes! I loved it and I put my own spin on it I used 3 chicken breasts I had boiled the chicken so I didn't cook it in oil. I diced it up then cooked peppers and garlic then; like one reviewer I just used chicken broth and it really helped to bump up the flavor! I added Mexican chili powder and cilantro. I used red pepper strips since I didn't have pimentos and I opened a can of green chili peppers to go on top and it was amazing! And my picky son ate a serving and a half! My mother who I do a lot of cooking for LOVED it!! She couldn't stop bragging! This will certainly be made again. Oh I also call the the Ricky Ricardo dish since I can't say Arroz Con Pollo. LOL. He loved for Lucy to make this on the show.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacie Bonner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3352370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-21T09:23:18.64Z",
                "reviewBody": "This is my new go to one pot dinner. Added a spiced green pepper fresh red bell and artichokes. Used chicken tenderloin and added the Goya with black pepper as well as Sazon' Goya with the onions. Trying white fish next time with muscles",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Cahoon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7477997/"
                }
            }
        ]
    }
]