[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15013/desserts/specialty-desserts/liqueur-desserts/rum/",
                    "name": "Rum",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230145/rum-balls/",
        "name": "Rum Balls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F937684.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2017-04-12T13:00:37.000Z",
        "description": "I wanted a good rum ball with a lot of kick, so I sat down and came up with this recipe. I didn't realize how good these were until one year I didn't make them for work. I just about got lynched! Needless to say, I've made them every year since (about 20 years). These are best if you use Meyers Original Dark Rum® chilled, and Nabisco® 'Nilla wafer cookies. They are at their peak if you make them 2 days in advance. Remove from fridge 30 minutes before serving.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "2 dozen rum balls",
        "recipeIngredient": [
            "1 (12 ounce) box vanilla wafer cookies (such as Nilla®)",
            "1 cup semisweet chocolate chips",
            "¼ cup light corn syrup",
            "¾ cup dark rum (such as Meyer's®)",
            "1 cup confectioners' sugar, plus more for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place vanilla cookies in a food processor and process into fine crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat chocolate chips and corn syrup together in a saucepan over low heat. Cook, stirring often, until chocolate is melted and smooth, about 5 minutes. Remove from heat and stir in rum and confectioners' sugar until smooth. Fold in cookie crumbs; dough will be sticky.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place saucepan in the refrigerator until dough is firm and easy to roll, about 15 minutes. Cover 2 plates with waxed paper; dust with confectioners' sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into 1-inch balls and place on the prepared plates. Dust rum balls with confectioners' sugar. Refrigerate until firm, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove rum balls from refrigerator and transfer to a resealable bag, including the extra confectioners' sugar. Seal the bag and shake to coat the rum balls completely with confectioners' sugar.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Rum"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Matt Story"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.478260869565218,
            "ratingCount": 69,
            "itemReviewed": "Rum Balls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "147.6 calories",
            "carbohydrateContent": "22.3 g",
            "cholesterolContent": null,
            "fatContent": "4.9 g",
            "fiberContent": "0.7 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "46.4 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-14T16:44:20.56Z",
                "reviewBody": "This was really good and really easy! I've never made rum balls before so I didn't realize there are so many different recipes out there. These are nice and rich exactly what I was looking for. They've now been in my fridge for 2 days and I'll be bringing them to a party tomorrow night. I didn't put them on wax paper or in a bag with icing sugar I just rolled them up and then dipped half in coconut and half in cocoa (next time I'll coat a third in icing sugar to give people even more variety.) No fuss no mess no baking and you only use the stove for 5 minutes. Thanks a lot for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cold Ethyl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6498003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-13T01:38:29.017Z",
                "reviewBody": "I just finished decorating these and they are fabulous! I decorated them all different ways following a video I saw at joyofbaking after googling rum balls. I liked the ease of this recipe better than that one. So I decorated some with powdered sugar and some with unsweetened cocoa powder (both best sifted) And then I melted some chocolate chips in the microwave and (after the rum balls had been in the fridge for a while) rolled some in that. Of the chocolate ones I (immediately!) sprinkled crushed nuts on some of them. And the others after putting back in the fridge to set I melted white chocolate and did a small design on the top. The presentation is amazing even with my lack of decorating talent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FERRYDUST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-16T18:37:09.077Z",
                "reviewBody": "Delicious! I did chicken out and use a little less rum which I thought made them perfect but hubby said he would like me to add more rum next time...go figure lol. I do believe these will get stronger the loner that they sit though so I think he'll be happier in the end. I didn't shake them in the bag w/ powdered sugar I just rolled them in the powdered sugar on a plate and that worked well. I will def be making these again...they were very easy and yummy! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-08T19:11:46.91Z",
                "reviewBody": "this was something new for me to make for the holidays but I remembered how good they were. While in Tech school in the Air Force (years ago) a buddy's grandmother had sent them to him and I was lucky enough to be able to try them all remember was Wow there's some rum in those! After trying a few other recipes without coming close to what I remembered I saw this recipe and thought Hmmm this one has 3 times the rum of the other recipes. I didn't have Meyers dark rum but I had Captain Morgan and tried it. These are what I remember having years earlier very good. I received compliments from everyone that had them. I do think next year I use just a little more rum and make it Sailor Jerry since it's 92 proof to boost them up a little bit. Thanks for sharing this great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "martyb1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8729077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-03T16:06:11.173Z",
                "reviewBody": "Very tasty I did these but I added 1 cup of pecans finely chopped",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JerryC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14709046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-18T21:12:28.967Z",
                "reviewBody": "This was my first time making rum balls and I must say that this recipe was great!  Not too sure why there aren't more reviews...I am definitely making these again for my guests over Christmas.  Give 'em a try, you won't be disappointed!  Hope this helps!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "michigan829",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9301714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-27T08:28:35.28Z",
                "reviewBody": "Very simple recipe. Let them sit in the fridge for a few hours before you sample them. The flavor keeps getting better with each passing day. I used 2 cups of powdered sugar and I also used dark chocolate chips. This will work with a variety of other spirits. I intend to try this with Rumple Minze Cointreau etc. Update 11/26/17--I have also made these with orange liqueur (Paula's Texas Orange) and raspberry liqueur (Drillaud). These have been very well received every year I've made them. I have always used the 3/4 cup of booze that the recipe uses.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRENFRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/910875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-29T00:07:51.693Z",
                "reviewBody": "There are so many different rum ball recipes out there, I wasn't sure which to try!  I opted for this recipe because it didn't include nuts, and uses chocolate instead of just cocoa powder. I think these rum balls are more fudge-like and less gritty than others I've tried.\n\nA couple of things that might be helpful to others who try the recipe:\n\nMy box of Nilla wafers was only 11oz, so I ended up adding two graham crackers (the equivalent of 1oz) to give me the full 12oz of cookie crumbs.  I don't know if that was necessary, but if you get a couple extra rum balls out of it, it doesn't hurt, right?  \n\nChocolate can be easy to scorch, so I would recommend melting your chocolate in a double-boiler.  An easy way to fake a double boiler is to put a couple of inches of water into a sauce pan and then set a similarly sized Pyrex bowl on top of it, so that your bowl is resting on the top rim of your pan. The boiling water in the pot gently heats your bowl, allowing your chocolate to melt without risk of burning it.  \n\nFor booze, I used a combination of Captain Morgan's Spiced Rum and Tuaca.\n\nAs a personal preference, I used honey instead of corn syrup and added a couple of dashes of cinnamon. I think they added complexity to the flavor.\n\nI rolled the rum balls in granulated sugar because I like the look of it better, and it's less messy to eat.\n\nP.S.  I highly recommend wearing food-safe gloves when rolling out your rum balls.  No one wants to eat your skin cells in their dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGARFUNKFAIRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/777800/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-18T23:39:52.863Z",
                "reviewBody": "Best recipe ive tasted. And very easy to do in a hurry. I did find that refrigerating between doing up and rolling Into balls was not necessary. At the party i had to make another double batch while everyone watched and waited for more. Good stuff Maynard!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ggmameeks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12246078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-25T19:35:54.497Z",
                "reviewBody": "I felt like it had way too much rum!!!! I think if you use half that amount they would be better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jseely",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6966952/"
                }
            }
        ]
    }
]