[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/844/desserts/cookies/cut-out-cookies/",
                    "name": "Cut-Out Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235870/moms-sugar-cookies/",
        "name": "Mom's Sugar Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1997664.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2017-04-17T13:00:45.000Z",
        "description": "An old-fashioned recipe, for fragrant and soft sugar cookies. You will not get the best results if you choose to use margarine and imitation flavorings. Decorate with your favorite icing and decorations.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H45M",
        "recipeYield": "60 cookies",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 egg",
            "1 teaspoon pure vanilla extract",
            "½ teaspoon almond extract",
            "1 ½ cups confectioners' sugar",
            "2 ½ cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon cream of tartar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat butter, egg, vanilla extract, and almond extract together in a bowl using an electric mixer until smooth. Add confectioners' sugar and beat until incorporated. Mix flour, baking soda, and cream of tartar into butter mixture until dough sticks together. Cover bowl with plastic wrap and refrigerate for at least 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut dough into quarters and roll each quarter onto a floured work surface to almost 1/4-inch thickness. Cut dough into shapes using cookie cutters and arrange on the prepared baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake each batch in the preheated oven until edges start to brown, about 8 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Cut-Out Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Patsy Snyder Hennessey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.28,
            "ratingCount": 25,
            "itemReviewed": "Mom's Sugar Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "59.9 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "11.2 mg",
            "fatContent": "3.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "44.1 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-01-27T18:54:08.167Z",
                "reviewBody": "When I made these cookies today I made a very critical error - I didn't make nearly enough of them.  This is one of the best cookies I've made in a looooong time,  and I can only explain my making so few of them  because I didn't want a lot of them laying around in case they  were duds.  Oh, quite the contrary.  What a beautiful, perfect cookie  this is!  Not to mention it's an absolute cinch to put together.  I had them ready to pop in the oven before it was even preheated.  The proportions of all ingredients are just perfect - no tweaking necessary unless you 'd like to change up the flavor with a different extract.  Just because rolling out sugar cookies has never floated my boat I simply dropped the dough onto  UNgreased cookie sheets and flattened them just slightly.  Making them a little thicker than the recipe called for made them tender and soft, ideal for a glaze or butter frosting.  Hubs requested a glaze and, happy to oblige, I  used Shiny Cookie Icing, also from this site, for its lack of any flavoring.  The subtle flavor of almond in these cookies was just right.  The submitter suggests these are the perfect cookie for Christmas gift boxes but I submit these are perfect as  a \"go-to\" cookie all year round.  As this recipe's first reviewer I'm thrilled to give these an enthusiastic two thumbs up.  No wonder this recipe has been passed down through the generations!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-08T19:45:52.26Z",
                "reviewBody": "Sugar cookies are my absolute favorite guilty pleasure. These are spectacular. I don't like to roll out the dough and cut them either, so I made little logs, chilled till very firm, then sliced and baked. Wow! A home made butter cream frosting makes these irresistible! Thanks for sharing your mom's wonderful recipe, Patsy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spud Buddies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1683460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-26T10:16:00.413Z",
                "reviewBody": "Every year I make sugar cookies for my kids for Christmas, and every year I HATE it. The dough sticks, it breaks, i have to roll it too much and it gets tough. Not this year! These were great. I used 1/2 butter and 1/2 butter flavored crisco. I didn't have the entire 3 hours to wait, so they only got 2. We wanted to roll them, and honestly the dough was easier to work with when warm. The cold dough was too brittle to roll. We made a double batch, and had it perfect by the last few trays.  Rolled out a little thicker than 1/4\" and undercooked them just ever so slightly (7minutes). Perfect. I think next time instead of almond, I will use lemon extract or zest. This is my new go-to sugar cookie recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachael Beck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2182215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-22T16:44:59.353Z",
                "reviewBody": "Flavor was ok. Mine were very dry. After refrigerating the dough as the recipe states it was rock hard. Had to bring back to room temperature. The recipe also states it makes 60 cookies I got 25 from the recipe. The only thing I changed was not rolling them out can't imagine that would make a difference. Even though the flavor was ok I won't make again. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMTOAUSTIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4177636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-16T01:27:04.673Z",
                "reviewBody": "Pretty good flavor. Kodi made them into shapes and covered with frosting to decorate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Krista Ferrill Donahue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-13T15:41:19.623Z",
                "reviewBody": "This is a great recipe.. Its easy to make I just followed the directions and they came out fabulous.. I added as the finishing touch icing with sprinkles.. They didn't stand much a chance in my home.. This is my go to recipe for sugar cookies from here out..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginny LeVeille",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3371728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-24T03:44:33.323Z",
                "reviewBody": "This recipe needs to be removed. I spent 4 hours of time I can't get back on this. I followed the recipe exactly. First off the 3 hour refrigeration time produces a rock solid dough that cannot be worked at all. If you have an extra hour to let it come back to a workable temp you may get a better product. I didn't have that luxury of time. I was forced to microwave 1/4 of the dough and then work it into the rest to bring to a workable temp. Rolled out cut cookies and they CHARRED at 8 minutes. Second tray came out okay at 6 minutes but at this rate I suspect the dough is far too overworked. And because the first tray burned I now don't have enough to send to school for my son's birthday. So thanks for the wasted time the wasted money and resources and the ruined birthday surprise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "whosthatlady321",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12811254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-26T00:24:19.373Z",
                "reviewBody": "Best sugar cookie I have ever eaten! 3 hour chill time is too long. Press the dough into a rectangle wrap in plastic wrap and chill for 45 minutes. I rolled it out and cut out 2 dozen cookies. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maxemom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5605464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-14T21:50:10.46Z",
                "reviewBody": "Since it was my first time using this recipe I made a half batch gave them a simple royal icing and sprinkles topping and sent to my husband deployed overseas. I saved a few for myself and they were absolutely delicious. Heard from my husband and even after a week shipping across the world he said they were delicious. Whenever my husband reports back that he likes something the recipe goes in my file and it gets an automatic 5 stars:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15510165/"
                }
            }
        ]
    }
]