[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/257938/spicy-thai-basil-chicken-pad-krapow-gai/",
        "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F07%2F15%2F4507925-spicy-thai-basil-chicken-pad-krapow-gai-photo-by-chef-john-cropped.jpg",
            "width": 1117,
            "height": 745
        },
        "datePublished": "2017-04-20T02:07:26.000Z",
        "description": "My version of this classic Thai dish has spectacular taste even with regular basil instead of Thai or holy basil. The sauce actually acts like a glaze as the chicken mixture cooks over high heat. The recipe works best if you chop or grind your own chicken and have all ingredients prepped before you start cooking.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "⅓ cup chicken broth",
            "1 tablespoon oyster sauce",
            "1 tablespoon soy sauce, or as needed",
            "2 teaspoons fish sauce",
            "1 teaspoon white sugar",
            "1 teaspoon brown sugar",
            "2 tablespoons vegetable oil",
            "1 pound skinless, boneless chicken thighs, coarsely chopped",
            "¼ cup sliced shallots",
            "4 cloves garlic, minced",
            "2 tablespoons minced Thai chilies, Serrano, or other hot pepper",
            "1 cup very thinly sliced fresh basil leaves",
            "2 cups hot cooked rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.762206148282098,
            "ratingCount": 1106,
            "itemReviewed": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "715.4 calories",
            "carbohydrateContent": "58.6 g",
            "cholesterolContent": "155.9 mg",
            "fatContent": "30 g",
            "fiberContent": "1.4 g",
            "proteinContent": "49.8 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1181.9 mg",
            "sugarContent": "6.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2017-05-25T06:53:43.793Z",
                "reviewBody": "This was delicious! My first time using fish and oyster sauce though... I think next time I make this I might reduce the fish and oyster sauce by half, but the rest of the recipe was spot on! I used serano peppers since I can't handle super hot and it worked out well for me but was still spicy enough for my heat loving husband. I will definitely be making this agian. We loved this dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Raechael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/raechael/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-07-13T05:16:25.017Z",
                "reviewBody": "YUM!  Great recipe.\n\nChef John does say in his video that the cooking technique he used is not the \"authentic\" method, but it gets the job done, and it's likely that most home cooks will use a variation of his video method.\n\nMy stove is also typical for American stoves and the burners do not generate the blazing BTUs needed for authentic \"stir fry\" cooking method that creates that wonderful caramelization without overcooking lean meats like white meat chicken and most cuts of pork.\n\nTo get a better caramelization without overcooking/drying the meat I use the Chinese meat \"velveting\" technique, and cook the meat separately from the veggies, or rice when doing a fried rice.\n\nVelveting is very simple.  Once you've cut the meat into small cubes, slices, or chopped, then put the meat in a non plastic bowl and a bit of white wine, soy, and the very important corn starch, mix to coat and let it sit for about 15-20 minutes.  The liquids will high salinity will seep into the meat bringing a bit more moisture into it, and the corn starch will create a coating that tempers the high heat of the pan so that the meat cooks nicely yet retains its moistness.  It is a WONDERFUL technique that works.\n\nOnce everything is prepped, heat up your pan with some oil in it.  Don't use EVOO as it has a low smoking point and will burn too quickly with the high heat you need.  Plus, EVOO has a particular flavor that is better suited to salad dressings and low heat saute dishes.\n\nOnce the oil starts to sm",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tome Trajkovski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22924845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-08T03:10:24.913Z",
                "reviewBody": "This is a great recipe! It was better than the expensive take out that I get. I doubled the sauce because I wanted to add some vegetables. I seared mushrooms in a cast iron skillet (hint: put in microwave for 30 sec and it will release water that doesn't allow them to brown) also added some bok choy.  Yummy, wish I had left overs. It was a little salty but I think I may have added a bit too much fish sauce. First time using oyster sauce and I love it. Thai basil is a great addition to the recipe. You can get it at your local Asian market.  Thank you, Chef.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22024980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-15T03:16:27.47Z",
                "reviewBody": "Wow, it was FANTASTIC! I followed the recipe to a Tee and wouldn't change a thing. As for the variables, I used chicken breast instead of thighs, a Serrano Pepper (with all seeds) and one little habanero pepper (used 4 seeds), 2 tsp palm sugar, and regular basil. I enjoy a medium spice for the most part at restaurants and the pepper ratio I used worked really well, very spicy but the flavorful kind. It will get you sniffling for sure! Tone down the spice by removing some seeds. I made it last week, and I am making it again this week! A new dinner staple! Thanks Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sailor_Coutts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10444519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-09-22T10:49:11.033Z",
                "reviewBody": "This is sooooo good!   I made this to serve as lettuce wraps with some jasmine rice and veggie egg rolls.  It was savory, sweet, spicy and delicious.  Next time I will serve it with rice and a sunny side egg as suggested...but the lettuce wraps were an excellent alternative.   \n\nTip: Double or triple the recipe as the leftovers make a quick and delicious lunch for work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cat667",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15522304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-25T01:11:59.897Z",
                "reviewBody": "This is absolutely delicious!! My husband would eat Thai food EVERY day if he could.  I've always been so intimidated to try cooking Thai cuisine, but, Chef John made this so easy.  I love, love, love Chef John's recipes & his videos are immensely helpful and priceless!  Definitely chop chicken when it's still partially frozen!  I backed off on the fish sauce a bit b/c it just smells so unappetizing and the 1st time I made this I felt like it was all I could taste...only used 1 tsp. of fish sauce and it's perfect for us.  Also, Chef John loooooves spice in his food.  While I love spice, too, the rest of my fam isn't crazy about it, so, use peppers at your own discretion.  I think I use 1 (sometimes only 1/2) serrano pepper, seeded.  This barely makes enough for  3-4.  If making for a bigger crowd then I would double.  Also, make sure you have all of your ingredients prepped & ready since this cooks up FAST.  In his video he actually cooks this in what looks like a cast iron skillet, but, I actually cook it in my wok.  Have made this several times & comes out perfect every time!--thanks, Chef John!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7500810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-30T07:30:28.313Z",
                "reviewBody": "Fantastic! The hardest part was chopping up the chicken without a butcher knife. Might have to invest one because this was a hit in my house (also, it looks like fun...and a great de-stressor :) ). Flavor was amazing! I had about 1-1/2 pounds of chicken and I doubled the sauce because we like enough sauce for the rice so soak up some. I served over jasmine rice. Everyone loved it and not a bite left over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KALNICH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kalnich/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-07-13T07:28:57.95Z",
                "reviewBody": "What did I do wrong?! I followed the recipe word for word, made absolutely no substitutes, and the juices from the chicken totally took over the dish and ruined it. The oyster-fish sauce never thickened or caramelized leaving the chicken extremely bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Rose Herring Cobb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4968095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-26T04:37:35.803Z",
                "reviewBody": "I read the reviews before making and so doubled the sauce as that seemed to be a common thing. I used 3 chilli peppers and found it was only a hint of spice, nothing over powering. Would definitely make again, with additional Thai peppers and possibly bell peppers for colour.\nEdit: 3-4 chilli peppers seems to be right for us (5 was a bit too much, although can handle). Half an orange bell pepper added nice colour to the dish. Take the time to cut up the chicken into smaller than bite sized pieces.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17374074/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
            "description": "Chef John's all-time favorite Thai dish!",
            "uploadDate": "2017-04-26T18:43:23.795Z",
            "duration": "PT7M51.304S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe280d878-78af-4dd8-aec8-5075c9cb66d9%2Fcf6557c2-7764-48b9-be16-da6dc45e505f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5412308064001"
        }
    }
]